[
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "HOMESTEAD, Fla.  She started in go-karts when she was 10, and was a national champion two years later. By the time Danica Patrick turned 16, she was on her own in Europe, pursuing a racing career.Patrick was a fearless woman in a sport almost exclusively comprised of male drivers. She raced hard, sparred with her rivals off the track and rarely flinched while becoming one of the most recognizable athletes in the world.Her tough-girl persona almost never cracked in public.When it came time to announce her retirement, with her mother, father, sister, brother-in-law, boyfriend and support team watching from the back of a crowded room at Homestead-Miami Speedway on Friday afternoon, Patrick broke down in tears.I feel like this is where my life should be headed, and sometimes we just get kind of nudged there, she began. Sometimes its big nudges and sometimes its little.The 35-year-old Patrick paused several times to compose herself to announce that she will race only in the Daytona 500 and the Indianapolis 500 next year and then she will walk away from a sport where success was elusive even as she grew into a superstar with multiple labels, not the least of which was savvy businesswoman.Patrick has known for at least a month that she will end her career next season at the Indianapolis 500, a decision that will bring her full circle and return her one last time to the storied track that made her famous. Discussing her decision with The Associated Press a few hours before her announcement, Patrick was giddy with excitement and thrilled at the chance to take one more spin around Indianapolis Motor Speedway.Patrick told AP it took her many months to come to the realization her career is all but over. Once she accepted it, she began putting together plans for The Danica Double over the last several weeks.Nothing that was being presented excited me, then about three weeks ago, I just blurted out, What about Indy? Lets end it with the Indy 500,' she said. This ignites something in me. But I am done after May. Everyone needs to put their mind there. My plan is to be at Indy, and then Im done.Patrick would not reveal who she will drive for in either race next year, but Chip Ganassi Racing is the likely ride at Indy. Ganassi has room to field additional cars  hes scaling down from four full-time cars to two next year  and would give Patrick a car capable of winning. Roger Penske and Michael Andretti both have full lineups announced for next years Indy 500.Patrick will not be driving in the Daytona 500 for Stewart-Haas Racing, team co-owner Tony Stewart told AP. Patrick moved from IndyCar to NASCAR after the 2011 season, and has been racing Cup cars for SHR since 2012. She is being replaced after Sundays season finale at Homestead-Miami Speedway by Aric Almirola.I met with her and her agent once, Ganassi said. I think it is a good idea for her to do, in fact I think its a great idea. The business-side of the deal still has to work.Ganassi already has Cup star Kyle Larson in his camp practically begging for a shot at the Indy 500. Would he enter one-off entries at Indy for both Patrick and Larson?Id have to talk to Larson about that, Ganassi smiled.Larson and Patrick are close friends, and he posted on Twitter he was happy for her following her Friday announcement: Shes done so much for Motorsports. Im excited for her and her future adventures!! #Namaste.Patrick is the only woman to have led laps in both the Daytona 500 and the Indianapolis 500. Patrick ran the Indy 500 from 2005 through 2011. Her highest finish was third in 2009, and she was the first woman to lead laps in the race when she paced the field for 19 trips around the Brickyard as a rookie.Patrick was highly marketable early in her career even though wins were rare. She won the pole for the Daytona 500 in 2013, but finished 24th in the standings the last two seasons. She won her only IndyCar race in 2008, in Japan.Sponsorship trouble surfaced this year, too. When no strong opportunities for next season presented itself, Patrick decided to call it a career next Memorial Day weekend.I think its awesome and it will make for a huge month of May that shes back there, said Stewart, who spent half of his career trying to win the Indy 500. It would be really cool to see her face on the Borg-Warner Trophy, if she can pull that off.Patrick had been adamant she would never return to IndyCar or the 500, but changed her mind as she realized her competitive options were dwindling.I know I always said Id never go back to Indy, and I was always being honest, she said. Well, things change. I know now you can never say never. Id been going through this in my head and kept asking myself, How am I going to get the words out and say its over? And trust me, I lost my (stuff) a few times over that.But this seems right, and this seems good.Patrick told AP she had only informed about 10 people of her decision prior to Fridays announcement. Everyone had been extremely happy with the path shes chosen. She said longtime boyfriend Ricky Stenhouse Jr. has never been more excited about something about me in his life.Stewart praised Patrick for her time at SHR, and said his team would never have expanded to four cars without her assistance. Kevin Harvick will try to win a second championship in four years for the organization on Sunday, and Stewart said Patrick has been a huge part of the teams success.He was disappointed to learn shes ready to stop driving.I am happy that she is doing it on her terms, but I am sad because I feel like there are wins under her belt that she can still get, Stewart told AP. I thought shed go road racing or back to IndyCar or something along those lines, because I think thats where she can be successful.Patricks fame was launched in IndyCar, and her relationship with former sponsor GoDaddy made her one of the most recognizable female athletes anywhere, from Super Bowl commercials to race days in the green-and-black firesuit. She has a winery in California, a line of athletic wear and an exercise and fitness program. Patrick said shell have more time to spend on those ventures after the Indy 500.Her career crossroads was put in motion when GoDaddy left auto racing after 2015, then new sponsor Natures Bakery was unable to fulfill its three-year commitment to SHR and Patrick. The team pieced together sponsorship all year, but the deal for Almirola next year made Patrick expendable.I didnt want to be pushed into anything, and everyone can relate, sometimes things just shift and change around you, she told AP. Especially with me and the sponsor situation. Ive never been there before. Ive always had a sponsor. It forces you into thinking about things and nothing was lining up easily. If I dont feel like I can run better than where I am, then I dont want to do it. And, there have been times that I could not have been more miserable.Thats not why I come, and I feel like it takes away from everything else I accomplished. I dont want to be remembered for the things that didnt go as well. I want to be remembered for the things that went well.",
    "title": "Danica Patrick to end racing career at next years Indy 500",
    "top_image": "http://sports.inquirer.net/files/2017/11/Danica-Patrick-AP-1118-1024x725.jpg",
    "url": "http://sports.inquirer.net/272854/danica-patrick-end-racing-career-next-years-indy-500"
  },
  {
    "authors": [
      "Agence France-Presse"
    ],
    "publish_date": "",
    "text": "LONDON  Former world number one Andy Murray announced Friday he has split with coach Ivan Lendl for the second time as he works towards regaining full fitness for the 2018 season.The 30-year-old Scot has enjoyed all of his Grand Slam success under the guidance of Lendl, securing a second Wimbledon title last year and another Olympic title in the second instalment of their fruitful partnership.Overall, in his two spells with Lendl, Murray won three Grand Slams, two Olympic golds and reached the top of the rankings in a fearsomely competitive era of mens tennis featuring Roger Federer, Rafael Nadal and Novak Djokovic.Im thankful to Ivan for all his help and guidance over the years. Weve had great success and learned a lot as a team, Murray said on his website.My focus now is on getting ready for Australia with the team I have in place and getting back to competing.The statement said the decision to end the coaching relationship had been mutual.Murray, who has missed a big chunk of the current season through injury, will continue to work on his fitness in Miami before heading to Australia ahead of the Australian Open, the first Grand Slam of the year.I wish Andy well going forward. We had a great run and a lot of fun, said Lendl, himself an eight-time Grand Slam winner as a player.Lendl will continue to work in the field of player development at the US Tennis Association, where his groups Patrick Kypson recently won his first professional event.Murray has won just a single title in 2017 after his golden year in 2016.Injury-ravaged 2017That came in Dubai in March, while his best Grand Slam performance was reaching the semi-finals of the French Open.A hip problem ruined his Wimbledon defence and forced him out of the US Open, ultimately ending his season with three months to run.Murrays 2012 US Open and 2013 Wimbledon titles came under Lendl and after they split in 2014 he worked with former French player Amelie Mauresmo before reuniting with Lendl in 2016.The top of the mens game is currently beset by a glut of injuries to big-name players, with Murray, Djokovic and Stan Wawrinka all missing from the ongoing ATP Finals in London, which Murray won last year.Murray has slipped to 16th in the world this year.Nadal pulled out of this years tournament after his opening round-robin match.Murray replaced Djokovic as world number one in November 2016 and held the top spot for 41 weeks before being replaced by NadalMurray practised with Austrias Dominic Thiem for two hours ahead of the ATP Finals last week.",
    "title": "Murray splits with coach Ivan Lendl for second time",
    "top_image": "http://sports.inquirer.net/files/2017/11/andy-murray-AP-1118-1024x755.jpg",
    "url": "http://sports.inquirer.net/272849/tennis-murray-splits-coach-ivan-lendl-second-time"
  },
  {
    "authors": [
      "Musong R. Castillo"
    ],
    "publish_date": "",
    "text": "Andray Blatche, barring any injuries, will finally join Gilas Pilipinas in the next couple of days and will reinforce the Filipinos in their first two Fiba Asia Qualifying games against Japan and Chinese Taipei.The 6-foot-11 Blatche, Team PHs naturalized player, will play Xinjiangs final game for the year in the China Basketball Association slated Friday night.Blatche was set to arrive Nov. 12 but apparently, failed to get a leave from the Flying Tigers.Xinjiangs next game will be in January, and that poses another problem for the Gilas coaching staff as the Filipinos will play the Taiwanese and Australia in February.Reports reaching the Gilas camp say that Blatche could flaunt his best form yet in a Team PH uniform.Gilas flies out for Japan on Nov. 21 to play the Japanese before coming home to tangle with the Taiwanese three days later at Smart Araneta Coliseum.Their next games in February are away matches against Chinese Taipei and Australia.June Mar Fajardo, the reigning four-time PBA MVP, Jason Castro, Calvin Abueva, Gabe Norwood, Terrence Romeo, Matthew Wright and RR Pogoy are the consensus shoo-ins for the final 12-man lineup in Tokyo.",
    "title": "Blatche arriving soon, will play for Gilas vs Japanese",
    "top_image": "http://sports.inquirer.net/files/2017/05/Gilas_7186-1024x683.jpg",
    "url": "http://sports.inquirer.net/272828/blatche-arriving-soon-will-play-gilas-vs-japanese"
  },
  {
    "authors": [
      "Bong Lozada"
    ],
    "publish_date": "",
    "text": "San Beda head coach Boyet Fernandez putimmense trust on Robert Bolick in leading the Red Lions, and when it mattered the most the mustachioed guard delivered and repaid his mentor with the championship.Bolick finished with 18 points, five rebounds, six assists, and a dagger that embedded itself to the collective heart of Lyceum.With San Beda holding an 86-82 lead with a minute remaining, Bolick took his spot at the top of the key and launched a triple in the face of Mike Nzeusseu that gave the Red Lions an 89-82 lead with 50.9 seconds left.San Beda eventually won 92-82 to clinch its 21st NCAA seniors basketball title and that championship trophy was Bolicks payment for the confidence Fernandez had given him.I want to thank coach Boyet, because he was the one who helped me grow as a basketball player, said Bolick in Filipino Thursday at Smart Araneta Coliseum. He made me into an MVP, although I didnt win the award because I was thrown out.When we lost twice in the eliminations, we had a team-building exercise and I told him to trust us because I think the only way to repay coach Boyet for what he has given us is to win a championship.And Bolicks bone-crushing triple late in the game was the manifestation of the trust Fernandez gave him.Coach Boyet always told me I got your back so at the start of the fourth quarter thats the moment you wont be able to get back to, said Bolick. And I kept telling myself that this is the time to step up.For the complete collegiate sports coverage including scores, schedules and stories, visit Inquirer Varsity.",
    "title": "He made me into an MVP: Bolick repays Fernandez trust with NCAA crown",
    "top_image": "http://sports.inquirer.net/files/2017/11/NCAA-SAN-BEDA-VS-LYCEUM_0669-1024x683.jpg",
    "url": "http://sports.inquirer.net/272820/made-mvp-bolick-repays-fernandez-trust-ncaa-crown"
  },
  {
    "authors": [
      "Bong Lozada"
    ],
    "publish_date": "",
    "text": "National University secured a double championship in the UAAP Season 80 taekwondo, dominating the three-day competition.The Bulldogs bagged their first mens title after going undefeated in all their six outings including an identical 6-1 wins over University of Santo Tomas and Far Eastern U Friday at Blue Eagle Gym.University of the Philippines took the second spot after finishing the tournament with a 4-2 win-loss slate while UST salvaged the bronze medal.NU also clinched back-to-back in the the womens division with a 6-0 sweep.NUs Arven Alcantara and Rheza Aragon were named the mens and womens MVP, respectively.",
    "title": "NU gets golden double in UAAP taekwondo",
    "top_image": "http://sports.inquirer.net/files/2017/11/36510609_M.jpg",
    "url": "http://sports.inquirer.net/272799/nu-gets-golden-double-uaap-taekwondo"
  },
  {
    "authors": [
      "Bong Lozada"
    ],
    "publish_date": "",
    "text": "In the middle of a loud Smart Araneta Coliseum during the second game in the Finals between San Beda and Lyceum, Robert Bolick and CJ Perez shared a quiet moment.Perez left the game with 36 seconds left, just before San Beda celebrated its 92-82 title-clincher, but Bolick stopped him on the way to the Lyceum bench to share some words.I told him good job, you made it tough on me, said Bolick in Filipino Thursday as San Beda won its 21st seniors basketball title. I told him you know what, you did a good job, youre the guy who came in and made an 18-0 sweep.Last year, they never did it and they were very low in the standings.Lyceum finished the Season 93 eliminations with a perfect 18-0 record after Season 92s ninth place finish where it went 6-12 without Perez, who was still serving his residency at the school.This year, just one guy, he changed the culture of Lyceum, said Bolick who finished with 18 points, five rebounds, and six assists in Game 2. I said to him keep your head up because theres nothing to be ashamed of.Bolick said its just unfortunate that Lyceum still hasnt got the championship experience that couldve saved them in crunch time.As for San Beda, championship experience is practically running through its DNA.Bolick gave the Red Lions an 89-82 lead with 50.9 seconds left with a cold-blooded triple with Lyceums Mike Nzesseu rising up to challenge him.I think the only advantage we have was our Finals experience, we know how to compose, and we know how to finish games in crunch time, said Bolick. Im pretty sure next year, CJ will be working hard.For the complete collegiate sports coverage including scores, schedules and stories, visit Inquirer Varsity.",
    "title": "Bolick tips hat off to Perez: He changed the culture of Lyceum",
    "top_image": "http://sports.inquirer.net/files/2017/11/NCAA-SAN-BEDA-VS-LYCEUM_0259-1024x683.jpg",
    "url": "http://sports.inquirer.net/272777/bolick-tips-hat-off-perez-changed-culture-lyceum"
  },
  {
    "authors": [
      "Bong Lozada"
    ],
    "publish_date": "",
    "text": "ONE Championship is in search of the next fighting superstar.The premier mixed martial arts promotion in Asia launched a new documentary series that features Rich Franklin traveling from gym to gym looking for up and coming martial arts talents.One of our biggest missions is taking martial arts, Asias greatest cultural treasure, and placing it front and center for the entire world to witness, said ONE Chairman and CEO Chatri Sityodtong.We are excited to travel across Asia, visiting the most iconic cities, to discover the next big superstar.Franklin, a multi-time middleweight champion when he was still fighting, will make stops in Bangkok, Manila, Seoul, Tokyo, and Beijing.Now serving as ONEs vice president, Franklin said he looks forward to the new practitioners that can elevate the sport of mixed martial arts to a new level.Throughout my time in ONE Championhsip, I have been a witness to some of the best martial arts talents, said Franklin. Stars today such as Angela Lee and Eduard Folayang came from the grassroots level of talent in Asia and the next martial arts superstar is just waiting to be discovered.Selected athletes will compete in trial exhibition bouts and all have a chance to earn a six-figure contract with ONE Championship.",
    "title": "ONE launches reality search for next MMA superstar in Asia",
    "top_image": "http://sports.inquirer.net/files/2017/11/DSC_5074-1024x683.jpg",
    "url": "http://sports.inquirer.net/272774/one-launches-reality-search-next-mma-superstar-asia"
  },
  {
    "authors": [
      "Randolph B. Leongson"
    ],
    "publish_date": "",
    "text": "If there was one player in San Beda who struggled to adjust from coach Jamike Jarin to coach Boyet Fernandez, it was Davon Potts.The Fil-Am spiners minutes and numbers dwindled under the new mentor, mustering only 6.7 points, 2.5 rebounds, and 1.2 assists in 21.9 minutes in the elimination round.It was really hard for me this year, he admitted.READ: San Beda sweeps Lyceum for 21st NCAA championshipBut Potts stayed the course and got the chance to show his worth in the Finals, averaging 15 points, 4.5 rebounds, and one assist.His contribution seemed to be the missing piece as the Red Lions finally solved the puzzle that was the Pirates, sweeping the best-of-three title clash to claim the NCAA Season 93 title.Its a great feeling, said Potts, who is ending his two-year stay in Mendiola with a pair of rings. I keep a lot of things at the back of my mind with the history of San Beda, and I owe it to them in bringing me here. I just wanted to make sure that we live the legacy and continue the championship, and make sure that we continue the winning culture here.READ: Drop in draft blessing in disguise for Davon PottsThe championship is as a validation for Potts as he overcame every challenge thrown his wayfrom the tough transition brought by the coaching change to his killer schedule with the preseason grind and the PBA D-League.It was worth it because this is a testament to show that no matter what you go through, no matter how much you have a downfall, you can always bounce back, he said, drawing a valuable life lesson in the process he had to go through.When you get up, you got to make sure to stay disciplined and persistent mentally and physically to get where you need to be. That is a testament to all the people that look up to me and make sure that nothing is easy, you have to earn it. Everything in life, you have to fight for everything you want to get.Now, Potts begins a new chapter in his career, this time in the PBA with Alaska which picked him in the second round of the 2017 PBA Draft.But before he leaves Mendiola for good, his final year with the Red Lions taught him one thing.I won two championships with Cignal and I won two championships with San Beda. This just shows that you sacrifice not for your individual stats, but you sacrifice for the team, he said. Thats what counts, not the individual stats. You have to win because thats what counts.For the complete collegiate sports coverage including scores, schedules and stories, visit Inquirer Varsity.",
    "title": "Potts grateful to end college career with a title after seasons struggles",
    "top_image": "http://sports.inquirer.net/files/2017/11/NCAA-SAN-BEDA-VS-LYCEUM_0266-1024x683.jpg",
    "url": "http://sports.inquirer.net/272717/potts-grateful-end-college-career-title-seasons-struggles"
  },
  {
    "authors": [
      "Bong Lozada"
    ],
    "publish_date": "",
    "text": "Kobe Paras encouraged high school sensation Kai Sotto to continue playing basketball in the United States while also taking a swipe at the current hoops scene in the Philippines.In a Twitter post, Paras made use of the new 280-character limit saying Sotto moving to the US will be the right decision instead of playing in the Philippines.I was 15-years-old when I moved out here in LA, said Paras, who is now a member of the Cal State Northridge Matadors.Hopefully one day Kai may make a mature decision to continue his basketball career in the States so that he wont get rotten and brain washed in Manila.Sotto is still in high school playing for Ateneo and his 7-foot-1 frame puts him a literal head above his opponents.Paras, for his part, moved from La Salle Greenhills to Cathedral in Los Angeles where he made a name for himself as an athletic forward.Creighton eventually recruited Paras, who did not flourish with the Bluejays and later transferred to Cal State Northridge where he is now on redshirt status, an academic sophomore on his first year of athletic eligibility.Paras said Sotto, given his height, would have endless opportunities in the United States.",
    "title": "Kobe Paras urges Kai Sotto to go to US to develop basketball game",
    "top_image": "http://sports.inquirer.net/files/2017/06/Gilas_0043-1024x683.jpg",
    "url": "http://sports.inquirer.net/272755/kobe-paras-urges-kai-sotto-go-us-develop-basketball-game"
  },
  {
    "authors": [
      "Francis T.J. Ochoa"
    ],
    "publish_date": "",
    "text": "There are so many ways the PBA can heal itself after a major fissure split its Board of Governors into two blocspurportedly, the drawn lines are the same ones that separate two major conglomerates in the board.Fire Chito Narvasa? That certainly is an option.Retain him as steward of an iconic institution? Perhaps.Name a caretaker OIC or appoint a new commissioner? Maybe.There are many immediate solutions that the PBA could apply to make sure that when Dec. 17 rolls around, there will be an opening night for Asias first professional basketball league. But thats exactly what the PBA needs the least right nowimmediate solutions. What it needs right now are lasting programs and a major culture change.The problem hounding the PBA is a political one. Only in some short-sighted manner can this mess be blamed on the trade between San Miguel Beer and Kia for the services of Christian Standhardinger. In reality, the trade is just the fruit of it all. The root? It goes way deeper than what has been already discussed numerous times in all forms of media.There has been a lot of clamor for the PBA to reexamine its soul. But what it needs in this dire moment of introspection is to look at its heart. And the heart of the league is its fans.One of the perils of political problems lies in perception. And what is the prevailing perception? That of fans being hoodwinked. But to apply surface-only solutions to the problem leaves the league open to confronting the same crisis in the futureand the same result perception-wise.True, we can easily lay the blame on the doorstep of the commissioners office. It has been the most convenient scapegoat, after all, instead of asking a group of powerful team governors to shoulder some accountability for the decaying fan trust over the years.But heres the quick-heal we get by merely replacing the commissioner: In the publics perception of this ongoing civil war, it becomes a mere transfer of the balance of power. Fans will be wary that the commissioners backers will ultimately turn into his sacred cows.How has the perception of the league sharply dropped to this?Look at it this way: How many of you really believe that if the commissioners office shot down the San Miguel Beer-Kia trade, Standhardinger would remain a franchise player who would turn the Picantos fortunes around and make people believe they actually belong in the PBA? If you raised your hand, you have overdosed on naivete.The moment Standhardinger declared for a draft class where the top pick belonged to Kia, his career direction was clear. He would be a franchise player for a team that belonged to either the MVP or SMC group. This is what Kias mission in the PBA looks like, after all: To build powerhouse squads outside of their own franchise.A true and deep-healing solution to the problem means creating an authority infrastructure that shields the commissioners office from board influence; it means painting over the gray areas of league rules to make sure lottery teams dont pawn off their basketball future.You dont need just a strong commissionerfans would see him as inept anyway under the same environment. Superman, in his home planet of Krypton, would just be another normal being.You need a strong commissioners office.Of the many paths the league can take toward healing itself, however, this isntshouldnt beone of them: There is now an apparent boycott of some team governors of the annual planning session where the roadmap of the 2018 season wouldve been drawn up.The absence of four team representatives in Los Angelesincoming chair Ramoncito Fernandez of NLEX has also skipped the board activitymeant no resolution was forged regarding the status of Narvasa. And it put on hold Season 43s plans, too. No schedule of games. No import ceiling. No new rules. Nothing. No healing.Maybe it would be to early to assume it is a boycott, even if the absent governors represent teams who belong to the bloc calling for Narvasas dismissal. At the very least, it is disheartening to see how these representatives cannot make time for the PBA at a time when the league needs their stewardship the most. The last dispatch we received from LA is that meetings have already been cancelled and the representatives who did make the trip are now reduced to filling those empty hours with sightseeing tours with their families.Sure, maybe the presence of the four would have meant a mere 1 percent chance that the board finally settles the impasse that has stalled league operations. But their absence? It obliterates that chance. It wipes out whatever hope of unifying the board during the planning session.Worse, in the perception play, their absence only reinforced the belief that the league has stopped caring for the heart that beats within it. The fans. The people who shell out hard-earned money for pricey tickets for the chance to see the best basketball in the country being played right before their very eyes.It turned the current standoff from a driving point for a much-needed discussion on how to improve the PBA into a showcase of its officials petulance.Merely replacing the commissioner wont start the much-needed healing of the PBA. The way things are going, healing can start at one place, no matter how many different paths there are to take: The board has to treat this impasse with a heightened urgency to reassure the fans that they remain the heart of the countrys only professional basketball league.",
    "title": "Commentary: The last thing this PBA standoff needed was a boycott",
    "top_image": "http://sports.inquirer.net/files/2016/11/PBA-SEASON-42-OPENING_7549-1024x683.jpg",
    "url": "http://sports.inquirer.net/272771/commentary-last-thing-pba-standoff-needed-boycott"
  },
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "PARIS  Former French minister for health and sport Roselyne Bachelot was ordered to pay 10,000 euros ($11,800) in damages to Rafael Nadal on Thursday after accusing him of doping.In March last year, Bachelot said on a French television show that Nadals seven-month injury layoff in 2012 was probably due to a positive doping test.Nadal, who has won 16 Grand Slam titles, filed a defamation suit against Bachelot in Paris.The Spanish player said he will donate the money to a non-governmental organization or a foundation in France.When I filed the lawsuit against Mrs. Bachelot, I intended not only to defend my integrity and my image as an athlete but also the values I have defended all my career, Nadal said in a statement.Nadal said he wanted to keep public figures from making insulting or false allegations against an athlete  without any evidence or foundation and to go unpunished.He said the lawsuit was never motivated by money.Bachelot was also ordered by the French tribunal to pay Nadal a suspended fine of 500 euros ($590).In April 2016, Nadal wrote to the president of the International Tennis Federation asking for all of his drug-test results and blood profile records to be made public. In the same letter, he said of Bachelot: It is unacceptable and mostly unfair that someone that should have knowledge of sports to a certain point and degree can publicly say something like this with no proof or evidence.",
    "title": "Ex-France minister has to pay damages to Nadal",
    "top_image": "http://sports.inquirer.net/files/2017/11/AP17317789789839-1024x699.jpg",
    "url": "http://sports.inquirer.net/272744/ex-france-minister-pay-damages-nadal"
  },
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "PHOENIX, ArizonaJames Harden had 23 of his 48 points in the second quarter while the Houston Rockets scored 90 points in the first half en route to a 142-116 win over the Phoenix Suns on Thursday night.Houston dominated with Chris Paul back in the lineup after missing 14 games with a knee injury. The Rockets made 61 percent of their first-half shots to match the second-most points in a first half in NBA history.Houston came up 14 points shy of the franchise record for points in a game. The Rockets knocked down 21 of 44 3-point attempts, and Harden made all 18 of his free throws.Harden, the NBAs leading scorer, had 33 points at halftime. Houston used a 13-1 over the final 3:08 of the first quarter to take control and was never threatened after that, leading 45-23 going into the second.Paul, who hadnt played since the season opener, got the start and didnt miss a beat, scoring 11 points and handing out 10 assists in limited action.Coach Mike DAntoni said before the game that getting the two stars, Harden and Paul, in sync will take care of itself over the next week or so. DAntoni planned to play Paul for 20 minutes; Paul saw 21 minutes of action and sat out most of the fourth quarter.Ryan Anderson added 24 points for the Rockets, who have won seven of eight.The Suns also shot well in the first half, getting 65 points before the break. They got the lead down to 14 with one of Troy Daniels six 3-pointers in the second quarter, but the Rockets repeatedly scored with ease at the other end.Daniels tied a Suns franchise record for 3s in a quarter and led Phoenix with 23 points. Devin Booker added 18 points and 10 assists.The Suns have lost seven of eight.As the first half came to a close, a fan yelled at DAntoni from the stands. Sit down Mike, youre up 40! DAntoni, a former Suns coach, turned and deadpanned, Its 25. You cant count.Center Greg Monroe made his Suns debut, starting and playing 26 minutes. Monroe, acquired by Phoenix from Milwaukee with two draft picks for guard Eric Bledsoe on Nov. 7, was dealing with a left calf strain when he arrived.He finished with 20 points and 11 rebounds.Monroe played amid speculation that he could be traded or have his contract bought out.",
    "title": "Harden, Rockets get 90 in first half, beat Suns 142-116",
    "top_image": "http://sports.inquirer.net/files/2017/11/063_875149050-1024x683.jpg",
    "url": "http://sports.inquirer.net/272758/harden-rockets-get-90-first-half-beat-suns-142-116"
  },
  {
    "authors": [
      "Cedelf P. Tupas"
    ],
    "publish_date": "",
    "text": "La Salle coach Aldin Ayo believes his Green Archers are peaking at just the right time even as he expects a dogfight when they clash with the Adamson Falcons on Saturday in the Final Four of UAAP Season 80 at Smart Araneta Coliseum.Game time is at 4 p.m. with the defending champion Archers, armed with a twice-to-beat advantage, looking to punch a Finals ticket for the second straight season.But they would have to deal with a familiar roadblock in the Falcons, the same team that gave them all that they could handle in the Final Four last season.In fact, Ayo is already bracing for a nip-and-tuck affair with Adamson the same way their second round clash panned out last month when they won, 80-74.Same expectation, it will be a dogfight. Our last game in the second round was close, it was decided [in] less than a minute or two minutes, said Ayo.They were up for most of the game, but we were able to get the win, so for sure it will be difficult for us.But the UAAP and NCAA champion coach is upbeat over his teams chances especially after their 79-76 conquest of fierce rival Ateneo last Sunday, which prevented an elimination round sweep for the Blue Eagles.I think were peaking at the right time, said Ayo, whose team is entering the playoffs on a seven-game winning streak.Every player has been responsible and committed for us to achieve our goals, added the former Letran mentor.The Falcons are hoping to have Jerrick Ahanmisi and Jerie Pingoy back in the mix, after the two guards left the game against Far Eastern U to ankle injuries.Were just hoping for the best with regards to their injuries, said Adamson coach Franz Pumaren. It will be a tough game going up against La Salle, but I also believe in my team.For the complete collegiate sports coverage including scores, schedules and stories, visit Inquirer Varsity.",
    "title": "Peaking Archers seek Finals slot vs Falcons",
    "top_image": "http://sports.inquirer.net/files/2017/10/UAAP-LA-SALLE-VS-ADAMSON_8373-1024x683.jpg",
    "url": "http://sports.inquirer.net/272834/peaking-archers-seek-finals-slot-vs-falcons"
  },
  {
    "authors": [
      "Marc Anthony Reyes"
    ],
    "publish_date": "",
    "text": "Defending champion Foton and unbeaten leader F2 Logistics clash with lightweight foes Saturday hoping to gather enough momentum for the pivotal phase of the Chooks To Go-Philippine Superliga Grand Prix at De La Salle Lipa Sentrum.Foton, stung by Petron last time around, is expected to vent its ire on Sta. Lucia at 4 p.m., while F2 Logistics deals with winless Victoria Sports-UST at 6 p.m. in the double-header that is dubbed Laro Para Sa Marawi.The Cargo Movers took a hiatus but it hardly showed after they thrashed the Generika-Ayala Lifesavers (25-21, 25-17, 25-17) last Thursday.American import Kennedy Bryan and Venezuelan Maria Jose Perez led the Cargo Movers in that match along with locals Aby Marano and Majoy Baron.Naturally, they will be the focus of the Tigresses who are sharpening their skills ahead of the UAAP competitions slated next year.Victoria Sports-UST coach Jan Paul Doloiras is not bothered by the 0-3 start as he is not expecting too much from his team that is seeing action in the league minus stars Cherry Rondina and EJ Laure.Rondina is with Petron, while Laure suits up for Foton.Good things happen when you work hard, said Doloiras. They may be taller and stronger than us, but rest assured that we will go there to work hard and give our best.After all, all the Tigresses have to do is make sure they dont finish last among the nine teams as the top eight squads make it to the do-or-die quarterfinals.With the pressure of a winning streak removed, the Tornadoes hopes to blow away the Lady Realtors shaky campaign.",
    "title": "Foton faces stern test vs F2 Logistics",
    "top_image": "http://sports.inquirer.net/files/2017/11/2-1024x743.jpg",
    "url": "http://sports.inquirer.net/272791/foton-faces-stern-test-vs-f2-logistics"
  },
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "BOSTON, MassachusettsHours before the Celtics took the court Thursday night to protect their winning streak against the defending NBA champion Golden State Warriors, Jaylen Brown was walking around in a fog.Bostons second-year forward was not even thinking about basketball after learning about the sudden death of his childhood best friend, Trevin Steede, on Wednesday night.It was tough to kind of accept it, Brown said. Everybody was kind of in shock.But after talking to his family and having conversations with Celtics coach Brad Stevens, Brown looked to the basketball court to find solace. The 21-year-old ended up playing one of the best games of his young career.Brown had 22 points and seven rebounds, Kyrie Irving had 11 of his 16 points in the fourth quarter, including two free throws that put Boston ahead in the closing seconds, and the Celtics beat the Warriors 92-88 on Thursday night for their 14th straight victory.He inspired me to come out and play and I played in his spirit, Brown said about Steede.They met after Brown transferred to Joseph Wheeler High School in Marietta, Georgia.I remember I didnt have any friends, Brown said. The first few days I sat at the lunch table by myself  Im super quiet and didnt know anybody.Steede noticed Brown sitting alone one day and told him he could sit with him.Ever since then weve been best friends.  Hes been my brother. Brown said.He said the circumstances of Steedes death are still being determined and he declined further comment out of respect for his family. After the final buzzer, Irving walked over and embraced Brown.Ky gave me the game ball and said, This one was for Trevin,' Brown said.Kevin Durant had 24 points for Golden State. The Warriors had won seven in a row.Playing his second game since suffering a facial fracture, Irving shed his protective mask in the second quarter. Then, with the game tied at 88, he was fouled on his layup attempt and calmly made a pair of free throws. Durant then came up empty on his jumper on the other end.Golden State led by as many as 17, but had to lean heavily on its reserves as its trio of Stephen Curry, Klay Thompson and Durant struggled offensively.Curry, who returned to action after missing a game with a bruised right thigh, was the most ineffective. He was 3 of 14 from the field  2 of 9 from the 3-point line  and had nine points.It was just one of those nights, Curry said. We had control of the game despite how bad we all were shooting. We just didnt sustain ourselves defensively.Curry sat for a long stretch after picking up his fourth foul early in the third quarter.We kind of fell out of our rotation in the third quarter, Warriors coach Steve Kerr said. They were just tougher and smarter than we were tonightBoston came in limiting opponents to just 94.5 points per game, the stingiest mark in the NBA this season. It did even better against a Warriors team that entered the night averaging an NBA-best 119.6 points.The Warriors went without a point from Durants 20-foot pull-up with 4:49 left in the third quarter until Omri Casspis floater with 34.5 left tied it at 68  a 19-2 Celtics run.Curry, Durant and Thompson were just 7 of 26 combined from the field in the first half. But the Warriors were able to maintain their lead thanks to 14 fast-break points.Durant was the only one of the three to score during a 12-0 Warriors run late in the second quarter.Boston trailed by just 47-42 at the half, closing the quarter with a 13-2 spurt.Celtics guard Gordon Hayward, who has been sidelined since suffering a broken ankle on opening night, was on hand for Thursdays game. He sat behind the Celtics bench and received a loud ovation from the Garden crowd when he was shown on the jumbotron.",
    "title": "After friends death, Brown fuels Celtics win over Warriors",
    "top_image": "http://sports.inquirer.net/files/2017/11/AP17321145909591-1024x700.jpg",
    "url": "http://sports.inquirer.net/272765/friends-death-brown-fuels-celtics-win-warriors"
  },
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "Deontay Wilder cant wait to get Anthony Joshua into the ring.Hes just not sure when its going to happen.I just want to prove who is the best, thats all I want to do, Wilder said Thursday. I want people to see a great fight and witness the two best heavyweights compete with each other one night in the ring.Wilder, who is coming off an impressive first-round knockout of Bermane Stiverne, said his representatives have been in contact with Joshuas camp, and the sides are exploring ways to stage the heavyweight unification fight.It could happen sometime next year, Wilder said, if Joshuas handlers arent too protective of the British fighter.I think theyre hesitant for a reason, Wilder said in a phone call with The Associated Press. Theyve got a great thing going. He can fight literally a guy who doesnt even have a name and can make millions and millions of dollars off him. Why would they risk taking a chance with the most dangerous heavyweight in the division?There are other obstacles to the fight, as well, including whether to hold it in England or in the U.S. and on what pay-per-view network. Joshuas camp has indicated their fighter would have to get more money than Joshua, too, because he has proven his ability to sell huge amounts of tickets in England.Theres also the feeling that both fighters should fight once more  perhaps on the same night  to build up more anticipation for the bout.They want a warmup fight, Wilder said. Joshuas last performance was OK, but it wasnt his best. They want to redeem that and they want to make at least one more good payday before fighting me.Joshua fought last month, stopping Carlos Takam in the 10th round of a sloppy fight in Wales. A week later, Wilder destroyed Stiverne in Brooklyn to keep his share of the heavyweight crown.Stiverne, who lost his title to Joshua in their first fight, was criticized for being out of shape and didnt land a punch. But Wilder showed his brute power in stopping him in the first round.It was a devastating knockout, Wilder said. Being able to put on a spectacular performance like I did put the icing on the cake.Joshua is massively popular in England  his fight earlier this year with Wladimir Klitschko drew 90,000 to Wembley Stadium  but not as well known in the U.S. Wilder also is trying to grow his fan base outside his home state of Alabama and there have been questions about the quality of his opponents.But both fighters are undefeated with impressive knockout records. When they do meet it could be thebiggest heavyweight fight since the days Mike Tyson was destroying everyone in front of him.The heavyweight division was once in a dark place but now it is coming into the light, Wilder said. Its exciting and I cant wait to make it even more exciting.",
    "title": "Wilder calls out Joshua again for big heavyweight fight",
    "top_image": "http://sports.inquirer.net/files/2017/11/AP17309156191872-1024x683.jpg",
    "url": "http://sports.inquirer.net/272757/wilder-calls-joshua-big-heavyweight-fight"
  },
  {
    "authors": [
      "Agence France-Presse"
    ],
    "publish_date": "",
    "text": "LOS ANGELES, United States  Retired boxing world champion Oscar De La Hoya has said he would be ready to step back in the ring to face mixed martial arts star Conor McGregor.The 44-year-old fighter turned promoter, who has not fought since being battered to defeat by Manny Pacquiao in 2008, said he has been secretly training and is confident he could beat UFC champion McGregor.You know Im competitive, De La Hoya said on Golden Boy Radio with Tattoo and the Crew, a daily digital radio show.I still have it in me. Ive been secretly training. Im faster than ever and stronger than ever. I know I can take out Conor McGregor in two rounds. Ill come back for that fight. Two rounds. Just one more (fight). Im calling him out. Two rounds, thats all I need. Thats all Im going to say.De La Hoya flirted with the idea of a comeback in June 2015 only to rule it out a week later.The 1992 Olympic gold medallist, a 10-time world champion, was one of the loudest critics of McGregors foray into boxing earlier this year, when he lost a money-spinning duel with Floyd Mayweather.McGregor, 29, was knocked out in the 10th round of that fight, which De La Hoya derided as a circus and a farce.De La Hoya said he would only consider fighting McGregor under boxing rather than MMA rules.Lets get it straight: In the cage, he would freaking destroy me, De La Hoya said. Only in the ring.Ive been working out for the last five months. (My confidence) is how I feel now from my training. I dont know what it is, but Ill tell you now that Ive never felt so good before in my life. /cbb\"Visit Inquirer Sports' The Pacquiao Files (www.inquirer.net/pacquiao-files) for news, features, and other multimedia content about Manny Pacquiao and his upcoming fights.\"",
    "title": "De la Hoya: Id take McGregor in two",
    "top_image": "http://sports.inquirer.net/files/2017/11/Oscar-dela-Hoya-Conor-McGregor.jpg",
    "url": "http://sports.inquirer.net/272509/sports-boxing-oscar-de-la-hoya-conor-mcgregor-mixed-martial-arts-mma-manny-pacquiao-ufc-golden-boy-promotions"
  },
  {
    "authors": [
      "Marc Anthony Reyes"
    ],
    "publish_date": "",
    "text": "Action-packed R1 between Dante Montales of La Carlota and John Kevin Jimenez of Cebu City here in Batang Pinoy boxing competition pic.twitter.com/YfJfd3G5D7  Marc Anthony Reyes (@marcreyesINQ) November 14, 2017DUMAGUETE CITYHis coach describes him as a naughty kid with a natural athletic flair.On a humid Tuesday afternoon in front of a big crowd, Cebu Citys John Kevin Jimenez put those qualities to good use to score a unanimous decision over hard-fighting Dante Montales of La Carlota for the boys 34 to 35 kilograms boxing gold medal in the Batang Pinoy Visayas qualifying here.I was challenged because he (Montales) is also good, said Jimenez in Filipino, a lollipop already plugged in his mouth after coming off the ring. I like what I did. I fought very well.The sixth child in a brood of nine, Jimenez, a Grade 8 student, was introduced to the sport by his four elder brothers. One of them, Johnriel, is already fighting in the pros.He is mischievous and naughty, but hes a good kid and we saw natural talent in him, said his coach Jordan Dopalco.Those traits served him in good stead as he stubbornly held off Montales for the gold.Jimenez, who started boxing at 9, aspires to one day don the national colors and follow the footsteps of Manny Pacquiao and Mark Magsayo.Chris Carlos Emnas scored for Leyte after beating local boy Jhon Jeffrey Rosales via unanimous decision in the boys 38kg.Earlier, Cebu City collected three golds in karate through Gian Mangitngit in boys kumite 8 to 13 years -28kg, Genda Rya Atillo in girls kumite 8 to 13-30kg, and Adrian Ray Ayuda in kumite boys 8 to 13 -32kg.Cebu Provinces Trisha Jean Ogoc snared her second gold after topping the girls kumite 8 to 13 -25kg.Host city Dumaguete grabbed a share of the lead late Monday after its archers hit the target with six more golds at Negros Oriental State University grounds.Prisa Helen Lofranco led the gold winners, ruling the Cub girls 20 meters. Other winners were Crisha Mae Merto (Cadet girls 30m), Caryl Generoso (Cub girls 30m), Gabriel Flores (Cub boys 20m) and Carson Francis Hastie (Cub boys 30).Dumaguete dominated the sport with nine golds. The team also won five golds in swimming, led by Ranzge Benedict Quilicot, who topped the boys 12-under 200m breaststroke and boys and girls relay teams.Tagbilarans Gabriel Manigque, who at 15 already stands 6 feet, ruled the boys 13 to 15 200m freestyle for his fifth gold of the competition, which saw Aklan claim 15 golds. Bacolod and Ormoc each got eight golds from the pool.\"Visit Inquirer Sports' The Pacquiao Files (www.inquirer.net/pacquiao-files) for news, features, and other multimedia content about Manny Pacquiao and his upcoming fights.\"",
    "title": "Pacquiao wannabe plucks gold for Cebu; Aklan rules in the pool",
    "top_image": "http://sports.inquirer.net/files/2017/11/Screen-Shot-2017-11-14-at-11.10.32-PM.png",
    "url": "http://sports.inquirer.net/272493/pacquiao-wannabe-plucks-gold-cebu-aklan-rules-pool"
  },
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "UNIONDALE, N.Y.  It wasnt the impressive showing he sought. Still, Danny Jacobs was happy to be back in the ring, and to be an easy winner over an outmatched Luis Arias.Jacobs dominated on Saturday night in a middleweight bout as lopsided as a fight can get.In his return to the ring since an outstanding performance in a loss to champion Gennady Golovkin in March, Jacobs easily swept the judges cards, though he often was frustrated by the holding tactics and unorthodox style of Arias. Seeking a knockout in the final rounds, Jacobs punished Arias in the 10th, 11th and 12th, and earned a knockdown that looked more like a slip in the 11th.I wanted to impress the fans and put on a good show, Jacobs said. I hurt him early and once I knew I could hurt him, I got a little more aggressive.Jacobs, a former world champion and one of New Yorks most popular fighters, is 33-2 with 29 KOs. He is hopeful of another shot at a title in 2018, though Golovkin will be busy with a rematch with Canelo Alvarez after their draw in September.Jacobs, who overcame bone cancer earlier in his career and is nicknamed Miracle Man, held the WBA belt for two years. He remained a force in the division even after his close defeat to Triple G. Next up could be either David Lemieux of Canada or Billy Joe Saunders of England.I want to stay active, we have major plans, the 30-year-old Jacobs said. We are going to invade Canada so they can see my face, and I will call them out later.Arias, 18-1 of Milwaukee, annoyed Jacobs at times with his style, but Jacobs never was in anything but control.Most of that aggression came late as Jacobs searched for the shot that would stop Arias. That punch never came, but it didnt matter.Wearing trunks with the name of his young son, Nate, sewn on the belt, Jacobs entered the ring with a grin, and kept smiling throughout introductions. He was grimacing at points during the fight, but only because of the way Arias was carrying himself.When Arias attempted to hug Jacobs after the 12th round, Jacobs refused.We are in there to hurt each other, but it took me a couple minutes to get it out of my system, Jacobs said.On the HBO undercard before 6,921 at Nassau Coliseum  the former home of the NHLs Islanders  Long Island welterweight Cletus Seldin battered Mexicos Roberto Ortiz for most of three rounds before a deep cut on Ortizs right eye and cheek caused a stoppage. Seldin, a Long Islander who has a loud following at the arena, knocked down Ortiz twice in the opening round, using powerful right hands.Seldin is 21-0 with 17 knockouts as he climbs the welterweight division. Ortiz fell to 35-2-2 and complained that Seldins elbow opened the cut further in the third round.Seldin, naturally, disagreed.You could see how rough and tough and old school the fight was, Seldin said.Another local fighter, Jarell Miller of Brooklyn, had little trouble with Polands Mariusz Wach in a heavyweight bout stopped in the ninth round by the ring doctor. Wach was taking a beating from the undefeated Miller (20-0-1, 18 knockouts), who consistently got inside to land right uppercuts.Miller was far ahead on the scorecards and could be in line for a title fight next year with either Deontay Wilder or Anthony Joshua. Hell need to show more movement and speed than he did Saturday night for that to be a prosperous venture.",
    "title": "Jacobs easily outpoints Arias in return to ring",
    "top_image": "http://sports.inquirer.net/files/2017/11/jacobs-ap.jpg",
    "url": "http://sports.inquirer.net/272235/jacobs-easily-outpoints-arias-return-ring"
  },
  {
    "authors": [
      "Mark Giongco"
    ],
    "publish_date": "",
    "text": "Macky Cario has been named executive volleyball director and womens coach of University of Perpetual Help.Cario, who resigned as coach of College of St. Benildes womens volleyball team, which he guided to a championship in the NCAA two seasons ago, will now be in charge of Perpetual Helps volleyball program.I resigned to assume a bigger role, which is to handle not only the womens volleyball team but Perpetual Helps volleyball program as a whole, said Cario, who succeeded Sammy Acaylar as coach.Acaylar, who was promoted to athletic director last year, also kept his head coaching position with the mens team.Perpetual Help already has a strong volleyball program and Im here to just continue it and hopefully make some improvements, said CarioAcaylar has high praise for Cario , whom he described as his protg.Everybody knows he (Cario ) is my protg and Im confident he can do the job well, maybe even better, said Acaylar, who is a multi-titled mentor.Arnold Laniog will call the shots for the Lady Blazers on an interim basis.The NCAA volleyball season begins on Jan. 4 next year.",
    "title": "Cario named Perpetual Help volleyball director, womens coach",
    "top_image": "http://sports.inquirer.net/files/2017/11/PSX_20170301_141315.jpg",
    "url": "http://sports.inquirer.net/272445/carino-named-perpetual-help-volleyball-director-womens-coach"
  },
  {
    "authors": [
      "Philippine Daily Inquirer"
    ],
    "publish_date": "",
    "text": "MALOLOS CITYSurging F2 Logistics tries to stretch its early run when the Chooks To Go-Philippine Superliga (PSL) Grand Prix rolls to Malolos Sports and Convention Center in this historic city.The Cargo Movers clash with Cocolife looking for their third straight win to keep in pace with unbeaten leader Foton (4-0), in a match that follows the doubleheader kickoff between Iriga City and Cignal.F2 Logistics is coming off a morale-boosting win over Petron in four sets last Saturday in Bacolod City before dominating Sta. Lucia Realty in straight sets on Tuesday, sending notice that it is serious in dethroning two-time Grand Prix champion Foton.Head coach Ramil de Jesus, however, said they have to take it one step at a time.We have to be careful because all teams are also preparing, said de Jesus, who added overcoming Cocolife would not be a walk in the park.Veterans Tina Salak and Michele Gumabao will lead Cocolife.",
    "title": "F2 eyes third straight win, take on dangerous Cocolife",
    "top_image": "http://sports.inquirer.net/files/2017/06/F2-Logistics-1024x656.jpg",
    "url": "http://sports.inquirer.net/271966/f2-eyes-third-straight-win-take-dangerous-cocolife"
  },
  {
    "authors": [
      "Associated Press"
    ],
    "publish_date": "",
    "text": "SYDNEY  Mile Jedinak led Australia into next years World Cup with a deflected free kick and two penalties in Wednesdays 3-1 intercontinental playoff victory over Honduras.Jedinak, who missed the latter stages of Australias Asian qualifying campaign because of injury, opened the scoring when his free kick curled to the left of the wall and went in off defender Henry Figueroa in the 54th minute, bringing the 77,060 crowd at Sydneys Olympic stadium to life.The Australian captain converted from the spot in the 72nd after referee Nestor Pitana penalized Bryan Acosta for a hand ball and calmly slotted home another penalty in the 85th to ensure Australia qualified for its fourth consecutive World Cup.Ill take them all, Jedinak said of his goals. It wouldnt have mattered who scored. Im happy to chip in.Forward Alberth Elis got a consolation goal for Honduras deep into injury time.Honduras earned a playoff spot with a 3-2 win over Mexico on a hectic last day of qualifying in North and Central America and the Caribbean, securing fourth spot and ensuring the U.S. missed out.Australia had the better opportunities in a 0-0 draw in the first leg last Friday in San Pedro Sula.But after a frustrating first half, when Tom Rogic created the only real chance with a mistimed shot in the 37th, Australia dominated the second half.Australia had opportunities to qualify directly for Russia in Asian qualifying but missed out on goal difference to Saudi Arabia in a tight finish in that group.That forced the Australians into an Asian playoff against Syria, which veteran Tim Cahill sealed with two goals in Sydney last month to set Australia up for the last-ditch home-and-away series against Honduras.The Australians edged Uruguay on penalties in a playoff in 2005 to qualify for the following years World Cup in Germany, and then qualified directly for 2010 and 2014.Australia coach Ange Postecoglou said his Socceroos did it the hard way, but we deserve to be there.The final word went to the jubilant Jedinak, a veteran midfielder who plays for second-tier Aston Villa in England.We got the job done and thats all that matters  its going to be a big 2018, he said.",
    "title": "Australia qualifies for World Cup with 3-1 win over Honduras",
    "top_image": "http://sports.inquirer.net/files/2017/11/AP17319374867497-1024x723.jpg",
    "url": "http://sports.inquirer.net/272586/australia-qualifies-world-cup-3-1-win-honduras"
  },
  {
    "authors": [
      "Agence France-Presse"
    ],
    "publish_date": "",
    "text": "Substitute Lars Stindl extended world champions Germanys unbeaten run to 21 matches with a 93rd-minute equalizer in a 2-2 friendly draw against France in Cologne on Tuesday.A first international double by Alexandre Lacazette put France on the verge of a deserved victory in a clash of two of the favorites for next years World Cup.The Arsenal striker scored either side of a Timo Werner goal, before Stindl struck to maintain Germanys unbeaten run dating back to their 2-0 defeat by France in the Euro 2016 semi-finals.We conceded the goal from nothing to make it 2-1, but we also showed the morale to come back from behind, said stand-in Germany captain Sami Khedira.Security was tight in Cologne almost two years to the day since the Paris terror attacks of November 13, 2015, when 130 people were killed and over 400 injured.On that night, three suicide bombers set off devices at the Stade de France during a France v Germany friendly and the shocked visiting players had to spend the night at the stadium during a security crackdown.Germany coach Joachim Loew made six changes from the team which were held to a goalless draw by England at Wembley on Friday, switching from a 4-3-3 line-up to their trusted 4-2-3-1 formation.Paris Saint-Germain second-choice goalkeeper Kevin Trapp replaced Marc-Andre ter Stegen.Emre Can, Niklas Suele, Marvin Plattenhardt, Toni Kroos, who missed the England game with a gastrointestinal infection, and Sami Khedira, who took over the captaincy, also came into the side.French boss Didier Deschamps left star forward Antoine Griezmann on the bench and started with Kylian Mbappe, Anthony Martial and Lacazette in a 4-3-3 formation.The trio were a constant menace and the French deservedly grabbed the opening goal on 34 minutes after Mbappe and Lacazette had early chances.A diagonal long pass to Barcelona left-back Lucas Digne was squared to Manchester Uniteds Martial, who weaved past Suele, drew Trapp and squared to Lacazette who fired home.It stayed 1-0 at the break and Loew reshuffled his defensive options by swapping Mats Hummels for Antonio Ruediger.The burly Chelsea center-back had a golden chance on 52 minutes, but he fired Julian Draxlers cross wide.The Germans equalized in the 56th minute when Mesut Ozils superb final pass released Werner, who slotted his shot past French goalkeeper Steve Mandanda.Loew brought on World Cup winner Mario Goetze for the last half an hourhis first international appearance for a year after a metabolic disorder.Kroos clattered the crossbar with a free-kick with 20 minutes left, but France retook the lead almost immediately.The German defense left Mbappe in acres of space and his through ball put Lacazette into the box to again shoot past Trapp with 19 minutes to go.Lacazette made way for Griezmann for the final quarter of an hour as the French national anthem  La Marseillaise  echoed around the Cologne stadium as Stindl came on.But the Germans grabbed a draw right at the death when Ozils pass found Goetze, who set up Stindl and the Moenchengladbach forward drilled home the equalizer.Loew said he was pleased with the draws against England and France in Germanys final internationals of 2017.We played better in the second half after not everything worked so well in the first 45 minutes as we had hoped, he said.That can always happen when you are behind at the break, but we had our chances when we put pressure on in the second half.",
    "title": "Stindl equalizer saves Germanys 21-match unbeaten run",
    "top_image": "http://sports.inquirer.net/files/2017/11/000_UA0XM-1024x589.jpg",
    "url": "http://sports.inquirer.net/272534/stindl-equaliser-saves-germanys-21-match-unbeaten-run"
  },
  {
    "authors": [
      "Marc Anthony Reyes"
    ],
    "publish_date": "",
    "text": "Clarice Patrimonio and Marian Jade Capadocia, the countrys top womens tennis players, are headed for a collision course after besting their semifinals opponents in the Philippine Columbian Association Open championship Friday.Two-time defending champion Patrimonio bounced back from a horrific second set meltdown to repel fourth seed Shaira Rivera, 6-3, 0-6, 7-6 (5) at PCA shell-courts.Heavy on forehands but very light on words, Patrimonio said she got too eager to win the match after taking the opening set, getting a major shock after Rivera launched a big fight-back to force a deciding set that went into tiebreak.The daughter of PBA legend Alvin Patrimonio and sister of fellow tennis star Christine will gun for her third straight title against Capadocia on Sunday.That wont be easy, though.Capadocia, already a four-time champion here, is out to reclaim her throne after trouncing Akiko De Guzman, 6-1, 6-0.Im very excited to play in the finals after two years of absence, said Capadocia, who had stints in Europe after she had a falling out with the Philippine Tennis Association. I will do my best because Clarice is a tough player.In the mens division, defending champion Patrick John Tierro forged a title showdown against top junior netter John Bryan Otico. They also clash on Sunday after the womens finals.Tierro defeated top seed Jeson Patrombon, 3-6, 7-6 (7), 7-5, while Otico downed Leader Lazaro, 6-1, 7-5.",
    "title": "Top stars Patrimonio, Capadocia forge PCA Final duel",
    "top_image": "http://sports.inquirer.net/files/2017/08/1JGA0258-1024x683.jpg",
    "url": "http://sports.inquirer.net/272786/top-stars-patrimonio-capadocia-forge-pca-final-duel"
  },
  {
    "authors": [],
    "publish_date": "",
    "text": "Barangay Ginebra successfully defended its PBA Governors Cup title but not after holding off a resilient Meralco side in Game 7 before a record crowd of 54,086 at Philippine Arena in Bocaue, Bulacan.Veteran point guard LA Tenorio had a team-high 26 points and four assists and was awarded as the Finals MVP.",
    "title": "GALLERY: Ginebra retains title, survives Meralco in Game 7",
    "top_image": "http://sports.inquirer.net/files/2017/10/PBA-Ginebra-vs-Meralco_2454-1024x683.jpg",
    "url": "http://sports.inquirer.net/270443/gallery-ginebra-beats-meralco-game-7-pba-govs-cup-title"
  },
  {
    "authors": [],
    "publish_date": "",
    "text": "Not only did National University sweep Far Eastern University to win the Premier Volleyball League Collegiate Conference title, the Lady Bulldogs also completed a perfect run.NU disposed of FEU in four sets, 25-22, 25-19, 19-25, 25-16, in Game 2 on Saturday night at Filoil Flying V Centre in San Juan.Jaja Santiago, who was officially named conference MVP, led the Lady Bulldogs with 22 points while Jasmine Nabor controlled the game and tempo with 45 excellent sets.Nabor wound up winning the Finals MVP award.",
    "title": "GALLERY: Undefeated NU sweeps FEU for PVL Collegiate title",
    "top_image": "http://sports.inquirer.net/files/2017/10/PVL-NU-VS-FEU_5831-1024x683.jpg",
    "url": "http://sports.inquirer.net/268655/gallery-nu-lady-bulldogs-sweep-feu-lady-tamaraws-pvl-collegiate-conference-title"
  },
  {
    "authors": [],
    "publish_date": "",
    "text": "Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.",
    "title": "GALLERY: UAAP Season 80 opening ceremony",
    "top_image": "http://sports.inquirer.net/files/2017/09/UAAP-OPENING_6706_2-1024x683.jpg",
    "url": "http://sports.inquirer.net/264412/gallery-uaap-season-80-opening-ceremony"
  },
  {
    "authors": [],
    "publish_date": "",
    "text": "For the third time in five years, LeBron James gave his Filipino fans another night to remember during his Strive for Greatness Tour 2017 Saturday at Mall of Asia Arena. READ: LeBron puts on show for unbelievable PH fans, vows to come back Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.",
    "title": "GALLERY: LeBron James Strive for Greatness Tour Manila",
    "top_image": "http://sports.inquirer.net/files/2017/09/SMV9345-1024x683.jpg",
    "url": "http://sports.inquirer.net/263525/gallery-lebron-james-strive-for-greatness-tour-manila-philippines"
  },
  {
    "authors": [],
    "publish_date": "",
    "text": "LeBron James supervised the training of select members of the media and players from Gilas Pilipinas Saturday afternoon at Kerry Sports.This was part of James third visit to the Philippines for the Strive for Greatness tour.Photos are from Inquirers Sherwin Vardeleon",
    "title": "GALLERY: LeBron James trains Gilas Pilipinas",
    "top_image": "http://sports.inquirer.net/files/2017/09/SMV9064-2-1024x683.jpg",
    "url": "http://sports.inquirer.net/263512/gallery-lebron-james-training-gilas-pilipinas-manila-tour"
  },
  {
    "authors": [
      "Migg Dela Cruz"
    ],
    "publish_date": "11/15/2017",
    "text": "The Esports Industry Awards 2017  Full List of WinnersMigg Dela CruzThe Esports Industry Awards 2017 took place at The Brewery in London, England last November 13. The awards show, which started just last year, aims to recognize excellence in esports, celebrating success and achievments in esports to show the world. Aside from players and teams, they also want to aim the spotlight at the industry as a whole, acknowledging as well the behind-the-scenes guys like journalists, photographers, and videographers.The show was livestreamed on Twitch, attracting over 26,000 viewers. They kicked off with the mother of all hype videos, which featured all the greatest moments from every esport in 2017.One of the biggest winners of the night was Eefje Sjokz Depoortere, who won the Esports Personality of the Year, beating out other big esports names like Jake SirActionSlacks Kanner, Ryan Hart, Sren Bjergsen Bjerg, Damon Karma Barlow, and Michael Shroud Grzesiek. Sjokz joins Megan RheingoldRiver Cutrofello, who won the Unsung Hero of the Year, as the first female winners of Esports Industry Awards.PlayerUnknowns Battlegrounds and Counter-Strike: Global Offensive came up big, winning Breakthrough Game of the Year and Game of the Year, respectively.Check out all the awards and winners from the night:Breakthrough Game of the Year  PlayerUnknowns Battlegrounds PlayerUnknowns Battlegrounds Commercial Partner of the Year  G-FUEL G-FUEL Coverage Website of the Year  ESPN Esports ESPN Esports Game of the Year  Counter-Strike: Global Offensive Counter-Strike: Global Offensive Journalist of the Year  Duncan Thorin Shields Duncan Shields Photographer of the Year  Joe Brady Joe Brady Publisher of the Year  Riot Games Riot Games Hardware Provider of the Year  Intel Intel Videographer of the Year  Davis OpTic Hitch Edwards Davis Edwards Streamer of the Year  Dr.Disrespect Dr.Disrespect Streaming Platform of the Year  Twitch Twitch Broadcaster of the Year  Alex Machine Richardson Alex Richardson Console Player of the Year  Matthew FormaL Piper Matthew Piper Live Event of the Year  League of Legends World Championship (RIOT) League of Legends World Championship (RIOT) PC Player of the Year  Amer Miracle Barqawi Amer Barqawi Personality of the Year  Eefje Sjokz Depoortere Eefje Depoortere Rookie of the Year (Console)  Victor Punk Woodley Victor Woodley Rookie of the Year (PC)  Abay HObbit Khassenov Abay Khassenov Team of the Year  OpTic Gaming OpTic Gaming Unsung Hero of the Year  Megan RheingoldRiver Cutrofello Megan Cutrofello UK Player of the Year  Spencer Gorilla Ealing Spencer Ealing Play of the Year  Matthew FormaL PiperFor the full list of nominees and more information you can check out the Esports Industry Awards website. You can also watch the show in full on their Twitch channel.",
    "title": "The Esports Industry Awards 2017 - Full List of Winners - Esports by Inquirer",
    "top_image": "http://esports.inquirer.net/wp-content/uploads/2017/11/Esports-Industry-Awards-2017.png",
    "url": "http://esports.inquirer.net/18848/esports-industry-awards-2017-full-list-winners"
  },
  {
    "authors": [
      "Migg Dela Cruz"
    ],
    "publish_date": "11/10/2017",
    "text": "The Philippine Team for the Garena All-Star Tournament has been chosenMigg Dela CruzThe 2017 Garena All-Star tournament is back in Vietnam as Southeast Asias best of the best compete in Ho Chi Minh City on November 20-26. Because of the GPLs strong performances this year at international competitions, the region has received a direct invite to the 2017 All Star Event in Los Angeles and the winner of the Garena All-Stars will be competing with the worlds best players.After a preliminary nomination, players voted for their favorite players to represent the Philippines to go head to head with other SEA superstars. The winners of the fan vote are as follows:Team Manila Eagles Jaiby JLC PaglingayenPaglingayen Acclaim EmpireXs John Anthony Tamsu  Somollo Somollo Mineskis Eric Allen Exosen GubatanGubatan Team Manila Eagles Marc Marky IlaganIlagan Acion Arenas Robert Rey Moraytaboy TanThe team will be facing off against SEAs other All Star Teams; Vietnam, Thailand, Malaysia, Singapore, and Indonesia. The winning team will be headed to Los Angeles to compete in the All Star Event and represent the whole SEA.Earlier in October, Riot redesigned the All Star Event to be more competitive in nature. In previous years, the focus of All-Star was primarily on entertainment over competition. This year, our 2017 All-Stars will be playing to win. We feel that pulling them out of their competitive mindset to play one-off, fun game modes will inherently divert their focus and take away from the competitiveness of the main event.Learn more about the Garena-All Star 2017 tournament here.Feature image from Garena Pro Gaming Series PH Facebook.",
    "title": "The Philippine Team for the Garena All-Star Tournament has been chosen - Esports by Inquirer",
    "top_image": "http://esports.inquirer.net/wp-content/uploads/2017/11/23380100_799225240238739_1615466744691338300_n.jpg",
    "url": "http://esports.inquirer.net/18843/philippine-team-garena-star-tournament-chosen"
  },
  {
    "authors": [
      "Migg Dela Cruz"
    ],
    "publish_date": "11/04/2017",
    "text": "Samsung Galaxy etch their names in history, take down the legendary SK Telecom T1 3-0 to win Worlds 2017Migg Dela CruzSamsung Galaxy made history today at the Birds Nest in Beijing by taking down 3-time champions SKT T1 at the League of Legends 2017 World Championships. This years Finals was a rematch of last years, with Samsung coming back for revenge with the exact same lineup. This year also held a lot on the line; could Faker win his 4th title and prove once again that he is the best player in the world? Could SKT prove everyone wrong again that despite their flaws, they were still the best team in the world? Could Samsung get revenge against SKT for last year? Could Ambition, who was the first midlaner Faker had to dominate in his debut to become the legend he is now, get revenge? All of these questions were answered in a dominating performance by Samsung Galaxy.Game 1Samsungs game plan was clear: focus on Faker. With Crown picking up Malzahar in the first pick phase and banning out Syndra and Taliyah, they forced Faker on his Cassiopeia. The early matchup went as you would expect, the early harass from Malz outclassed that of Cass. Coupled with jungle pressure from Ambition and superior vision control, Samsung took control of the early game. SKT wouldnt go down that easy though, and for 20 minutes both teams were at a stalemate.The first big fight, and the first blood, came in at 22 minutes when Samsung started Baron and Peanut Body Slamming in with the steal. Samsung were quick to answer though, picking up four big kills. From there, it was all about maintaining the lead and maintaining map control. Samsung were able to snowball to victory, only conceding one turret in an almost-perfect game. In an episode of The Breakdown, Zirene touched on Samsungs ability to win games without fighting, and that style was on display in Game 1.Game 2SKT opted to remain on the red side to prepare counter picks against Samsung. With Huni locking in Yasuo into Cuvees Gnar, League fans all over the world got pumped for Game 2. But Samsung had the momentum, and shifter into the next gear. Upping the tempo, Ambition on Jarvan IV was able to make successful early game ganks and helped Samsungs bot lane get the lead over SKTs bot lane, arguably SKTs weakest link. Once more, with their superior macro, Samsung were able to run circles around SKT. In a teamfight near the Dragon Pit around the 20-minute mark, Samsung ace SKT and go for the Baron.Game 3Backs against the wall, SKT decide to switch it up. Wolf picks up Leona and Faker on Karma for the Ardent Censer backup. They round it out with Trundle and Gragas for the frontline, and Tristana for the damage. Samsung go with the Chogath and Sejuani frontline, Varus and Lulu botlane, and put Crown back on Malzahar. Things seem to go SKTs way, with the early game going better for them than the past two games. One big factor was Blank subbing in for Peanut, and with his more aggressive early game, helped Huni and Faker get early kills. SKT upped their vision control and tat did wonders for them. By the 15 minute mark SKT were up 2k gold and 3 kills. By adapting and matching SSGs control, SKT managed to secure four elemental Drakes.As SKT siege down the mid lane, Blank aggressively engages under the tower and SSG pick him off. This helped SSG put a finger back on the wheel, and a huge 3-for-nothing teamfight near the Baron pit put them back in full control. With the Baron buff SSG come crashing into the mid lane and demolish SKTs base, leaving the Nexus exposed. SKT manage to hold on however, as Huni manages to fend off and kill 3 Samung members. SKT then secure a huge Elder Dragon, and stall out the game for the time being.No one was prepared for what happened next. Ruler on Varus flashes in for the Corrupting Chains onto Faker, and SSG pick him off. With the Demon King finally down, Samsung rampage through the mid lane, nigh unstoppable. In 40 minutes, they do what no team has ever done; take down the Gods and cement their own legacy, with the Summoners Cup held high above their heads in glory.Feature image from the LoL Esports Flickr page.",
    "title": "Samsung Galaxy etch their names in history, take down the legendary SK Telecom T1 3-0 to win Worlds 2017 - Esports by Inquirer",
    "top_image": "http://esports.inquirer.net/wp-content/uploads/2017/11/37450071524_ebb454d375_k.jpg",
    "url": "http://esports.inquirer.net/18826/samsung-galaxy-etch-names-history-take-legendary-sk-telecom-t1-3-0-win-worlds-2017"
  },
  {
    "authors": [
      "Esports Inq"
    ],
    "publish_date": "10/12/2017",
    "text": "Local gaming personalities, Dota 2 teams to grace Dota 2 All-Star WeekendEsports INQDota 2 All-Star Weekend, the Dota 2 show-match-turned-mini-festival, kicks off this Friday, October 13, 2017 at the SM Mall of Asia Arena.The event, a three-day series of Dota 2 matches, will feature a Manila Invitational Challenge. The challenge will pit local team TNC Pro Team against internationally acclaimed competition: Optic Gaming, Invictus Gaming Vitality and Virtus Pro.The event will also host a special competition called the Manila Challenge; four local teams: Execration, Young Minds, Happy Feet and TaskUS Titans will compete on Friday.While the event will feature some of Dota 2s biggest international talents, local gaming personalities as well as some of the countrys top bands will be in attendance.Parokya ni Edgar, silent sanctuary, and The Itchyworms will be performing during the DotA 2 All-star Weekend side-by-side international dance team sensation The Kinjaz and Londons popular EDM duo, Addictive TV.Tier Ones Bianca Yao and Ann B. Mateo will co-host the event alongside Jake SirActionSlacks Kanner and Pinda pindaPanda Rika Dorji. The official Philippine broadcast for the event will be done by Womboxcombo.The Dota 2 All Star Weekend will run from October 13-15, 2017 at the SM Mall of Asia Arena. Gates open at 10:00 AM.",
    "title": "Local gaming personalities, Dota 2 teams to grace Dota 2 All-Star Weekend - Esports by Inquirer",
    "top_image": "http://esports.inquirer.net/wp-content/uploads/2017/10/EsInq2.png",
    "url": "http://esports.inquirer.net/18808/local-gaming-personalities-dota-2-teams-grace-dota-2-star-weekend"
  },
  {
    "authors": [
      "Migg Dela Cruz"
    ],
    "publish_date": "10/07/2017",
    "text": "Riot drops teaser for 2017 Victorious SkinMigg Dela CruzAt around 2AM UTC+08:00, Riot teased this years Victorious skin. There were speculations as to who would be receiving the yearly skin, with guesses from Jhin, to Rengar, to Urgot,However, due to a leak on the Turkish LoL website, we now know that Graves will be receiving this years Victorious Skin.Earlier in the year, during the Spring Split, Graves was the 7th most picked champion and was a very high priority pick due to his high damage output. The Victorious skin is usually decided on during the Spring Split and Riot gets to work on the skin during the rest of the year.The Victorious skins are not available to purchase and instead are given to players who achieve a rank of Gold or higher in solo queue. The very first champion to get the Victorious skin was Jarvan IV in Season 1. Following that, it was Janna, Elise, Morgana, Sivir, and last years Maokai.With Worlds well on its way and the 2017 Season nearing its end, will you be getting this shiny new skin?",
    "title": "Riot drops teaser for 2017 Victorious Skin - Esports by Inquirer",
    "top_image": "http://esports.inquirer.net/wp-content/uploads/2017/10/22221622_10159652040140556_1973579227077662620_n.jpg",
    "url": "http://esports.inquirer.net/18801/riot-drops-teaser-2017-victorious-skin"
  },
  {
    "authors": [],
    "publish_date": "",
    "text": "eSports by Inquirer.Net is the home of the Philippine eSports Organization (PeSO). The website was founded in 2014 through the partnership between PeSO and Inquirer.net.Our mission is to bring eSports news and stories to not only fans and the people who enjoy them but to the mainstream as well. We aim to bring timely, comprehensive, insightful and in-depth feature stories about eSports and gaming culture both in the Philippines and beyond.",
    "title": "Daryl \"iceiceice\" Koh with the instant-GG play vs WG.unity. - Esports by Inquirer",
    "top_image": "http://esports.inquirer.net/wp-content/uploads/2017/02/Screenshot-4.png",
    "url": "http://esports.inquirer.net/video-collection/daryl-iceiceice-koh-instant-gg-play-vs-wg-unity"
  }
]