["Philippine Consulate General in New York Team.  (Photos by NYPCG)\n\nAs part of efforts to reach out to more Filipinos and Filipino-Americans in the U.S. Northeast Region, the Philippine Consulate General in New York participated for the first time in the North American Basketball Association (NABA) Tournament.\n\nThe tournament, now on its 30th edition, was held in Mannheim, Pennsylvania from Sept. 1-3, 2017 with crowds of around 4,000-5,000 Filipinos and Fil-Ams either taking part in the competition or supporting their respective teams.\n\nWhile the bulk of participants come from the U.S. Northeast, specifically the states of New York, New Jersey, Pennsylvania, Connecticut, and New England region, other teams come from Maryland, Washington, D.C., Baltimore; some cities in the Midwest and West Coast; and teams from Montreal, Winnipeg and Ontario, Canada.\n\nAside from fielding a team composed of personnel from the Consulate General, the Philippine Mission to the United Nations, the Philippine Center in New York, and family members, the Consulate also set up an information booth on Consular, Pag-Ibig and tourism services for the information of the participants and spectators at the event.\n\nConsul General Theresa Dizon-de Vega (center) at the Opening Ceremonies with North American Basketball Association Directors.\n\nThe event allowed the Consulate to reach out to a larger segment of the Filipino Community and to establish new contacts in different states under its jurisdiction.\n\nConsul General Theresa Dizon-de Vega likewise met separately with the NABA Commissioners and Directors to discuss other ways to promote community-building through sports and to seek the NABA’s support for the Philippines’ hosting of the 2019 Southeast Asian Games (SEAG).\n\nThe NABA tournament remains one of the most popular sports-oriented programs in the U.S. and boasts of being the training ground for present and future Filipino-American players at the collegiate, amateur and professional levels in t","Paul suffered the adductor muscle injury this week against the Lakers\n\nNEW YORK, USA - Houston Rockets guard Chris Paul will miss Friday's scheduled NBA game against his former club, the Los Angeles Clippers, due to a sore thigh, the NBA win-leading Rockets announced Thursday, December 21 (Friday Manila time).\n\nPaul suffered the adductor muscle injury in the fourth quarter of a 122-116 home loss Wednesday to the Los Angeles Lakers, a defeat that snapped Houston's 14-game win streak.\n\nIt was the first loss in a Rockets' uniform for Paul, who missed a month of the NBA season with a bruised left knee suffered in Houston's season-opening victory over the defending champion Golden State Warriors.\n\nNine-time All-Star point guard Paul is averaging 17.1 points, 9.0 assists, 5.4 rebounds and 2.1 steals over 16 games for the Rockets this season.\n\nRockets coach Mike D'Antoni said Paul's status remains day to day but the team will be careful about his return.\n\n\"We're going to be real cautious with it,\" D'Antoni said. \"The good thing is he shut it down immediately.\"\n\nThe Rockets own the NBA's best record at 25-5 while the Clippers are 10th in the Western Conference at 12-18.\n\nPaul, who is 32, departed the Clippers in the off-season to join the Rockets and star scorer James Harden. Paul, who helped the US team to gold medals at the 2008 Beijing and 2012 London Olympics, spent six seasons with the Clippers. – .com","NEW YORK — Michael Beasley scored 28 of his season-high 32 points in the second half, helping the New York Knicks shake off a dismal return by Kristaps Porzingis to beat the Boston Celtics, 102-93, on Thursday night (Friday Manila time).\n\nBeasley went back to the bench with Porzingis back from a knee injury, but he was on the floor in the fourth quarter while Porzingis watched from the sideline as the former No. 2 overall pick punished the Celtics inside and out to help the Knicks pull away.\n\nPorzingis was 0 for 11 from the field and finished with one point after missing two games with a sore left knee. The \"MVP! MVP!\" chants he has heard this season instead went to Beasley, who also had 12 rebounds.\n\nHe surpassed the 30 points he scored last Saturday against Carmelo Anthony and Oklahoma City with a jumper with 1:06 remaining that stopped a little run by Boston and gave New York an eight-point lead. The Knicks held on for their fifth victory in six games.\n\nKyrie Irving scored 32 points for the Celtics, who lost for the second night. They played without starter Jaylen Brown because of left Achilles tendon soreness.\n\nThe Knicks were blown out in Boston to cap their 0-3 start but have since turned things around behind a home-heavy schedule. They have 15 of their 17 victories at Madison Square Garden, where a sellout crowd of 19,812 grew louder with every Beasley basket against the Eastern Conference leaders.\n\nNew York jumped to a 13-2 lead and led by 14 in the first quarter, but it appeared the Celtics were starting to take control by the third. Irving made three 3-pointers and one by Tatum gave Boston a nine-point lead midway through the period before Beasley brought the Knicks back.\n\nHe made three consecutive Knicks baskets late in the period to keep it close and it was 68-all going to the fourth. It was still tied before Beasley outscored the Celtics 11-4 to give New York an 86-79 lead, and Boston never got closer than six again.\n\nCeltics: Brown had appeared in 32 o","MANILA, Philippines — After two decades in his career as a professional basketball player, 42-year-old Eric Menk has officially retired this year and is now venturing into new activities as a father of two kids, Alexa and Sebastian.\n\nThe 2005 Most Valuable Player (MVP) was honored during a heartwarming tribute from a retirement ceremony last May 7 by the Alaska Aces, the team where he played his final game along with Barangay Ginebra San Miguel, his former team in which he stayed for 11 years.\n\nDuring the program of GOO.N diapers’ launch, Menk was asked to give an advice to new dads like Jesse Ho-Maxwell, President of One-Stop Distribution, Inc.\n\n“Most things are difficult and having patience is key,” Menk mentioned in his statement, talking about his life as a father of two kids with his spouse Erin.\n\nHis last basketball game was seven months ago. His current endeavors include putting up his own podcast called \"Staying Major,\" where talks happen about Philippine basketball. He also created his own YouTube channel with the username, TheEMenk30.\n\nMenk won 4 titles when he was still in Ginebra and broke the first record of becoming the MVP when he was still in the same team. He also represented the Philippines for the 2002 Asian Games and 2007 FIBA-Asia.\n\nAlso known by his moniker, “Major Pain,” Menk was surrounded by basketball and other sports personalities on radio or television as he was growing up. His father, Al, began teaching him how to play basketball at the age of seven. When he turned 10, the PBA star’s father started to bring him to high school basketball games. Since then, he became a varsity player when he was in school and received a basketball scholarship upon entering college.\n\nMenk’s career as a professional basketball player counts to 20 years. He spent a year in Denmark, two years in the Philippine Basketball League (PBL), 16 years in the Philippine Basketball Association (PBA) and another year in the ASEAN Basketball League (ABL).\n\nIn 1998, the Fi","MANILA, PHILIPPINES, Dec. 23, 2017 – Jr. NBA Philippines 2018 presented by Alaska will tip off Jan. 13 at Don Bosco Technical Institute in Makati and runs through May 2018 as part of the league’s effort to encourage youth basketball participation. This year’s program is set to reach more than 250,000 participants and 900 coaches across the country.  Online registration is open now at  NBA, the league’s global youth basketball participation program for boys and girls, teaches the fundamental skills and core values of the game at the grassroots level in an effort to enhance the youth basketball experience for players, parents and coaches.  During the 2017-18 season, the NBA will reach more than 26 million youth in 71 countries through a variety of camps, clinics, skills challenges, league play and outreach events.\n\nThe program remains free and open to boys and girls ages 10-14 throughout its four stages: skills clinics in schools and communities, Regional Selection Camps, a National Training Camp and an NBA experience trip.  Since its launch in 2007, Jr. NBA clinics have been implemented in 110 cities and municipalities across the country and the 2018 program will return to key provinces including Agusan Del Norte, Batangas, Benguet, Cavite, Misamis Oriental, and Negros Occidental.  Regional Selection Camps will be held in Bacolod (Feb. 10-11), Butuan (Feb. 24-25), Baguio (March 17-18) and Metro Manila (April 7-8), with the top 37 boys and 37 girls advancing for the National Training Camp in Manila in May 2018, which will feature an NBA and WNBA player or legend.  The program will culminate with the selection of 16 Jr. NBA All-Stars, comprised of eight boys and eight girls, who will embark on an overseas NBA experience trip with fellow Jr. NBA All-Stars from Southeast Asia.  Prior editions of the Jr. NBA Philippines program have featured notable alumni including Aljon Mariano, Kobe Paras, Kiefer and Thirdy Ravena, Ricci Rivero, and Kai Sotto.\n\n“For the past 10 years, ","MANILA, Philippines — Castrol-Yokohama drivers Carlos and Inigo Anton together with Asian Formula 3 champion Tyson Sy and three-time Golden Wheel awardee Stefano Marcelo bucked the odds to power PartsPro Racing Team to the FM1 crown in the Philippine Endurance Challenge “8 Oras ng Pilipinas Race” at the Clark International Speedway in Pampanga recently.\n\nDriving a fully equipped Honda EG, the troika completed a total of 186 laps as Team PartsPro Racing cruised to victory over Team Cebu with 185 laps and Team BMW Autoperfomance using a fully prepared E36 M3 with184 laps in the eight-hour event.\n\nThe 13-year-old Inigo Anton, the youngest national car racing champion, drove for 1.5 hours straight starting at the three-hour mark, putting the team in contention at the halfway stage.\n\nStefano Marcelo then took the wheel but had to pit when the car suffered a power steering failure that dropped the team back to fifth place. PartsPro team manager Billy Billano and team owner Raffy David then made crucial strategic changes to keep their bid alive.\n\nSy took over after repairs and pushed the team back to second before eight-time Driver of the Year Carlos Anton, after refueling for the final time, steered the team to victory.\n\nWhat made the win special was that Anton did it by running on empty and almost on fumes with still 30 minutes to go with Team Cebu forced to pit for refueling and then relinquishing the lead.\n\n“I don’t know how the car made it with no fuel in the end. I just kept on praying to finish the race. This is so special because I was with great drivers,” said Carlos.","CEBU, Philippines — It’s going to be a busy 2018 for Philippine Sports Commission officials as they laid down numerous projects for athletes in the Visayas.\n\n“Our athletes in the Visayas will have their hands and feet packed in the upcoming year. We have a full calendar all throughout 2018,” said PSC Commissioner Ramon “El Presidente” Fernandez said during PSC’s year-end report press conference yesterday at the Cebu City Marriott Hotel.\n\nPSC-Visayas officials have revealed a long list of projects for the upcoming year starting off with their Visayas Open Tournament, a  talent identification program that will kick off in January.\n\nThe Visayas Open Tournament is composed of 15 Olympic sport disciplines which aim to discover future athletes that will undergo training to prepare them for international tournaments.\n\nPhilippine Sports Institute (PSI) director Nonie Lopez said that they wll divide each sport into three age brackets including 12-under, 16-under and 22-under.\n\n“Our target is to create a pool of athletes in each discipline to represent us in the 2024 and 2028 Olympics.  We hope to produce future gold medalists that will undergo extensive training,” said Philippine Sports Institute director Nonie Lopez.\n\nThe sports program will begin with the Sinulog Fun Run that will have categories for grassroots runners.\n\nMeanwhile, Fernandez said that the PSC board have already approved a budget of P15 million that will be allocated to the Cebu City Sports Commission.\n\n“We believe that the sports commission is matured in terms of conducting sports program,” he said. (FREEMAN)","TALISAY CITY, Negros Occidental avenged their loss in the 2017 Palarong Panlalawigan after beating Bacolod Tay Tung High School (BTTHS) Thunderbolts, 2-1, to capture the Mayor Tinto Bascon Christmas Volleyball League 2017 Inter-High School Open Girls crown in Himamaylan City, Dec 18.\n\nTalisay opened the match with a 27-15 lead, but BTTHS came back in the second set, 25-21.\n\nIn the deciding set, both teams banked on their veteran players who traded spikes and blocks.\n\nBut the Talisay volleybelles, who were more determined to win the title, launched four successive attacks to wrap up the match, 25-21.\n\nDuring the Palarong Panlalawigan finals, Tay Tung swept Talisay City to earn the right to represent Negros Occidental in the 2017 Western Visayas Regional Athletic Association (WVRAA) Meet in Iloilo in February 2018.\n\nAside from Tay Tung and Talisay City, other teams which participated in the league were Himamaylan City, Pontevedra, St. John’s Institute (SJI) and Living Stone International School (LSIS).\n\nTay Tung team accepted defeat, saying that their players were tired after a series of local and national competitions.\n\nAccording to Jose Montalbo, Tay Tung’s vice president for sports, the defeat will further motivate them to improve for upcoming matches.\n\nThe Thunderbolts started their journey last month in the 2017 NOPSSCEA in Bacolod, 2017 Batang Pinoy in Dumaguete, and the Rebisco Girls Volleyball Season 15 National League of Champions at the Sta. Rosa Sports Complex in Laguna.","MANILA, Philippines — The Meralco Bolts are not a team to beat early in the new PBA season, and head coach Norman Black is perfectly aware of that.\n\n“We haven’t fared well in the last couple of all-Filipino conferences,” he said. “I don’t expect anybody thinking that we would be favorites. I mean, it’s obvious that San Miguel is the strongest team. Ginebra and TNT are very strong.”\n\nBut that doesn’t mean his crew is shying away from the challenge to be with those teams’ level.\n\n“We want to be competitive — winning as many games as we can,” he offered. “We want to improve on our performances in the last Philippine Cups and take it from there.”\n\nThe Bolts were unable to even qualify in the second round of the last two all-Filipino skirmishes. Last season, they were only able to make the quarters twice — only when teams are allowed to infuse foreign talent into their fold.\n\nAnd Black is also aware of that perception — that they’re only strong during import-laden conferences. Now, he’s bent on proving those people who think so, wrong.\n\n“I really don’t pay attention to what other people are saying,” he noted “I’m more concerned with my players making sure they’re in shape, making sure they execute well.”\n\nAnd as far as execution goes, Black went on to note how well his new acquisitions are making that happen.\n\n“We brought in some new players — Nico Salva, Jason Ballesteros, Mac Baracael and KG Cañaleta — and they’ve been mixing well with our players,” he said.\n\n“We’re missing two guys to injury: Ranidel (de Ocampo) and Cliff (Hodge). They won’t be back until the third, fourth game, so that’s going to hamper our performance a little bit.”\n\nAsked about what his agenda this season-opening conference, Black took a pause before baring his answer.\n\n“It’s really a question mark how well we’re gonna do this conference,” he shared. “Like I said, we haven’t done well. But it’s obvious to me that I have a much better team this year. So I’m expecting us to improve, our performance t","NEW YORK — There’s LeBron James, Kevin Durant and Golden State against Cleveland, for fans wanting more of the NBA’s reigning rivalry.\n\nFor those preferring something new, the league’s Christmas Day schedule has that, too.\n\nIt’s a star-studded slate, with the NBA Finals rematch standing out among the top teams and power players.\n\nThe league is driven by star power, and the NBA is going all-in this year. The schedule is about the best players, not all the best teams.\n\nAnd with Joel Embiid, Ben Simmons and Kristaps Porzingis starting the day, and Lonzo Ball, Kyle Kuzma and Karl-Anthony Towns finishing it, this year’s showcase is as much about the guys who got next on the marquee as the ones on top already.\n\n“They’re doing it for talent. You have the talent and the marketable players, so I understand why they’re picking those teams,” said Sacramento veteran Vince Carter.\n\nChristmas was once a kickoff of sorts for the NBA, the first time a national audience paid attention to basketball with the football season winding down. ABC analyst Jeff Van Gundy, who will work the Cavs-Warriors game, was among those who had said the NBA should consider starting its season at Christmas to get out from under the NFL’s shadow.\n\nNow it’s a celebration of the success the league is already enjoying. Combined viewership on ESPN and TNT is up 21 percent this season, with games averaging 1.9 million viewers, even before what figures to be the biggest numbers of the season.\n\nESPN said its audience is the second-highest it’s ever had at this point behind 2010-11, James’ first season in Miami, and Van Gundy said he’s even a little surprised.\n\n“I don’t know what it speaks to, but we do have a bunch of really good, young players,” Van Gundy said. “We have a dynasty in the making in Golden State, we have a team trying to challenge them in their own conference, or a couple teams in San Antonio and Houston, and LeBron is still rolling.”\n\nAll of them but the Spurs are in action Monday (Tuesday Manil","SURIGAO CITY ( / 11 Nov) — Endurance swimmer and environmental lawyer Ingemar “Pinoy Aquaman” Macarine will endure another record-setting 15-kilometer open water swim in Bohol Sea on Sunday, November 12.\n\nMacarine will kick off from the fish-rich island of Balicasag to the tourist haven of Panglao island in Bohol.\n\nHe is gunning for his eight marathon crossing this year and 34th successful open-water swim since he started his open-water swim on December 31, 2013 in Surigao City.\n\nMacarine, who hails from Placer, Surigao del Norte, said this marathon swim is still part of his preparation for the English Channel swim conquest next year.\n\nLast August. Macarine was stopped in his bid to complete crossing the English Channel due to unfavorable weather condition. A year earlier, he also had to cancel the 33-kilometer cold waters because of the bad weather.\n\nMacarine got into open-water swims as part of his lifetime advocacy for marine resource protection, environmental tourism and climate change awareness.\n\nThe marathon swimmer, who has an average speed of three kilometers per hour, said he has been working hard to increase his speed.\n\n“I’ve been training hard for the past few weeks that consists of a total 34-kilometer swim per week, 30-minute to one-hour run and core exercises,” adding he has never been better in shape in the last few years since he started in the open-water swim attributing on his intense training, proper rest and diet regimen.\n\nSunday’s record-setting swim is being sponsored by municipality of Panglao through mayor Leonila Montero, Integrated Bar of the Philippines-Bohol Chapter spearheaded by Atty. Warren B. Yap Jr., and Dagohoy Masonic Lodge 84 of Bohol headed by worshipful master Atty.  Lord “Cocot” Marapao.  (Roel Catoto / )","MANILA, Philippines — La Salle power forward Abu Tratter, a Fil-Am born in Laguna, is looking forward to playing with Marinerong Pilipino in the PBA D-League this season and eventually, moving to the PBA but his ultimate dream is suiting up for Gilas.\n\nTratter completed his eligibility in the UAAP this season and because he was born here, qualifies as a local with the national team under FIBA rules. Gilas head coach Chot Reyes recently said Tratter is a candidate for the Gilas pool. Tratter confirmed that he’s been asked to try out by agents linked to Gilas.\n\n“When I came over to play for La Salle, one of the first things I did was to buy a Gilas jersey,” he said. “I remember writing my name at the back of the jersey, thinking how special it would be to play for the country. It would make my mom really proud. That’s my dream, to play for Gilas. I’m fortunate that I played four years at La Salle, winning a championship once. Now, it’s time to move on.”\n\nTratter, who turns 25 on Jan. 9, was picked on the fourth round by Marinerong Pilipino in the recent PBA D-League draft. Before leaving to spend the holidays with family in Milpitas, California, the other day, he was with Marinero coach Koy Banal for four practices. Some of his Marinero teammates are former UAAP adversaries Vince Tolentino and Gboy Babilonia of Ateneo and Alvin Pasaol of UE. Tratter said he’ll be back on Jan. 7 to resume workouts with Marinero. He’ll be lined up by La Salle to play in the PCCL National Collegiate Championships on Feb. 2-11.\n\nBefore playing for La Salle, Tratter was with the St. Francis High School basketball and track varsities in Mountain View, California then suited up a year at DeAnza College in Cupertino, also in California. The year at DeAnza was counted against his five years of UAAP eligibility so he played only four seasons at La Salle.\n\n“I’ve got a year and a half left to earn my degree in psychology,” said Tratter. “That’s 70 units. I’m determined to finish my education at L","Athletes from Ateneo and La Salle dominate the list for this year, while #NBAFinals is most tweeted sports-related hashtag in the Philippines\n\nMANILA, Philippines – Even the sports community on Twitter is a sea of blue and green.\n\nWith just a couple of weeks remaining before the end of the year, Twitter Philippines revealed the list of most tweeted athletes in the country for 2017.\n\nWith over 243,000 followers, De La Salle Green Archers' Ricci Rivero is the most talked-about athlete this year. Rivero topped the Twitter list dominated by current athletes and former standouts from Ateneo De Manila University and De La Salle University.\n\nNational team member and former Ateneo ace spiker Alyssa Valdez, currently with over 1.2 million followers, ranks second, while Senator Manny Pacquiao comes in at third place – and is the only boxer in the list.\n\nVolleyball standout and television host Gretchen Ho is at 4th place, followed by another former Ateneo star athlete and now PBA rookie Kiefer Ravena. 2017 Southeast Asian Games women's volleyball team captain Mika Reyes ranks 5th, followed by De La Salle Green Archers Prince Rivero, Brent Paraiso, and Kib Montalbo.\n\nCompleting the Top 10 is Thirdy Ravena, member of the Ateneo Blue Eagles Season 80 champion team and UAAP Season 80 men's basketball finals Most Valuable Player. (READ: Ateneo Blue Eagles are UAAP Season 80 champions)\n\nIt has been another big year for sports and true enough, Filipinos went crazy over several events and competition this 2017 – especially basketball and boxing.\n\nAccording to Twitter, #NBAFinals generated around 76 million tweets worldwide, including tweets from the Philippines. (READ: 'This is why we play': Top social media moments during the 2017 NBA Finals)\n\nThis year's UAAP Cheerdance Competition ranks second, with the Adamson University Pep Squad emerging as champion this year. (READ: Adamson University is UAAP Season 80 cheerdance champion)\n\nBelow is the full list of most tweeted sports-related ","“It’s my first international tournament and I am happy that all my hardwork, trainings and motivation have paid off. I am  absolutely in awe and proud of my first achievements abroad. I would like to compete more in international events and dream of getting  a chess title in the future,” matud pa ni Peteros.\n\n“I am so grateful and thankful to all those who supported me especially my mom who never gave up on me since I started playing chess at six years old. I would like pursue my dream of becoming a chess master one day,” dugang pa niya.","DAVAO CITY -- Not this year. The Philippines will host the Bimp-Eaga Friendship Games in 2020 instead.\n\nPhilippine Sports Commission (PSC) commissioner Charles Raymond Maxey, during the Davao Sportswriters Association (DSA) Forum at Hukad, The Annex of SM City Davao, said his executive assistant Karlo Paolo Pates and another PSC staff Michelle Balunan attended a Bimp-Eaga Council meeting in Indonesia where Brunei Darussalam confirmed its hosting of the 2018 edition of the Games.\n\n\"Nag-confirm na ang Brunei maghost December next year. The Philippines will host it in 2020,\" Maxey said.\n\nHe also said that had Brunei begged off from next year's hosting, the country will host the Bimp-Eaga Friendship Games and bring it to Davao City instead.\n\nMaxey also said that swimming, which was not included in past stagings of the biennial goodwill games, will be making its debut in Brunei.\n\nHe added, \"More contact sports have also been included.\"\n\nThe PSC commissioner also bared that 2018 will be a busy year in Mindanao as more Children's Games, consultative meetings, coaches' education and talent ID will be conducted.\n\n\"Ma-busy jud mi labi na sa (We will be busy especially with the) Children's Games because this is the brainchild of Chairman (William) Ramirez. We plan to have more kids participate in this undertaking considering that the Children's Games had been recognized by Unesco,\" Maxey said. (PR)","When asked if there is a magazine title about her, what would it say? Lucky Penny says, “The New Age of Beauty”\n\n\n\nTalk of people in love and you talk of people who are lucky in life.\n\nSo when it seems everything’s coming up lucky for businesswoman/philanthropist Jennifer Helen Wiegel Sarmiento, it is because she has always looked at love and life thru rose-tinted glasses. Thus, after a fashion, her cup overfloweth. Not that she is an overly optimistic kind of woman; it is just that as a Libra – her birthdate: September 25 – she is born with a heart that is in the right place, beating with innate generosity and sense of balance in everything she does and in dealing with people who happen to come within the range of her intuitive radar.\n\nAdd to that, her Libra zodiac sign has been this year under the glittering limelight courtesy of the heavy influence of Jupiter – in astrology, it is the biggest planet and stands for luck, growth and expansion. No wonder that in the prestigious Mrs. Globe Classic pageant held last June in Las Vegas, USA, Penny – as she is called by family and close friends since she was a little girl – is, well, the lucky and very surprised recipient of a new global award, “Woman of the Year,”  the first for a Filipina. In that pageant which saw the beautiful women from all the American states and several countries in Asia, Pacific and Europe and Africa gathered under one roof, her overwhelming charm and elegant poise added two more awards to her winning streak: Best in National Costume, People’s Choice.\n\nThe past few years have also been incredibly wonderful for Batangas-born now Cebu-based Penny who garnered a few firsts in the local haute monde. The Philippine Cancer Society honored her in 2014 as one of the ten Philippines’ Best Dressed Women, subsequently inducting her as one of its Ambassadors for Life. Then in the same year she was a main feature in the glossy book “Fabulous Women of the Philippines” by top portrait-photographer Rupert Jacint","MANILA, Philippines — Meralco’s latest acquisition in KG Cañaleta delivered in the clutch to put a pesky Blackwater side for good, 103-98, in a rare PBA affair at the Cuneta Astrodome in Pasay City.\n\nCañaleta, a journeyman whom the Bolts picked up in the offseason, drilled the trey in the final 11 seconds of the game to go and make it 101-95.\n\nElite gunner Allein Maliksi responded with a long bomb of his own to threaten Meralco, 101-98, with two ticks on the clock.\n\nBut the one-time PBA champion and former league Most Improved Player was not letting off his foot on the pedal. Cañaleta went on to knock down two shots from the charity stripe to seal the deal for the Bolts.\n\n\"I thought we did a good job of recovering from a slow start today, especially in the first half. I thought Blackwater played very well, put a lot of pressure on us and forced us into a lot of turnovers,\" Meralco head coach Norman Black said.\n\n\"We did recover a little bit late in the second quarter and it carried over into the second half where we got off to a good start. But the energy that we spent trying to get that big lead really cost us down the stretch because we gave that lead up just as quickly as we got it,\" he added.\n\n\"We made some big shots down the stretch, Baser Amer's prayer was a big shot for us. And I like to just give special mention to KG who I thought was exceptional tonigt, scoring and rebounding. He's going to be a very good addition to our team,\" Black said.\n\nThe 6-foot-6 Cañaleta finished with 25 markers, nine boards and two assists.\n\nBlack said the real challenge begins now as they face three-time Philippine Cup champion San Miguel Beermen next.","LOS ANGELES — Los Angeles Lakers guard Kentavious Caldwell-Pope is serving a 25-day sentence at an Orange County detention center after violating his probation on a drunken driving arrest, the Los Angeles Times reported Thursday (Friday Manila time).\n\nCaldwell-Pope is allowed to leave the Seal Beach Police Department Detention Center for practice and Lakers games in California under a work-release program, but must wear a GPS monitor outside the facility.\n\nCaldwell-Pope has missed two road games, and won’t travel for games in Houston on Dec. 31 and Minnesota on Jan. 1. He was expected to play against Golden State.\n\nWhile playing for the Detroit Pistons, Caldwell-Pope was arrested on suspicion of drunken driving early March 29 in Auburn Hills, Michigan, after police say he was spotted going about 45 mph in a 25 mph zone. He was arrested after a field sobriety test. A further test showed he had a blood alcohol level of 0.08 percent.\n\nCaldwell-Pope is averaging 14.2 points this season. He signed a one-year, $18 million deal with the Lakers as a free agent in July.","Metro Manila (CNN Philippines, December 3) — There is no greater folk hero for the Ateneo community at the moment than Isaac Go.\n\nWith La Salle breathing down Ateneo’s necks, 82-80, Go sent the blue side of the gallery into a frenzy after draining a dagger triple to put Ateneo beyond reach, 85-80 with only 25 seconds left in the game.\n\nAfter the final buzzer, under the pour of white confetti and the booming chants of ‘Go Ateneo, One Big Fight!’, coach Sandy Arespacochaga shared a hug with Go.\n\n‘What did I tell you?! What did I tell you?!’ Arespacochaga screamed at Go.\n\nWhen asked about that particular moment, the Ateneo coach called back to their loss against La Salle last year at the same venue.\n\n“Last year we lost, and down by the far basket towards the baseline, he actually went to me and he cried,” he said. “He was telling me he was sorry.”\n\nBefore the crucial Game 3 meeting, Arespacochaga approached the Ateneo big man and made a bold prediction.\n\n“I just told him that this game we were going to exorcise that moment, and he is going to have a different feeling, he is going to have a different experience,” Arespacochaga said. “I told him don’t be afraid of losing, and I just told him that I had confidence in him.”\n\nAfter the game, Go received a sponsor selected award that got the Ateneo crowd on their feet once again.\n\nJust a year after crying on the court after losing the championship, the thousands in attendance were up and chanting Go’s name.\n\nArespacochaga believed that it was an opportunity for Go to replace bad memories with great ones.\n\n“True enough he did it,” he concluded with a wide smile.","MANILA, Philippines — A bettor from Naga City won the jackpot of the 6/45 Mega Lotto drawn on Wednesday, the Philippine Charity Sweepstakes Office (PCSO) announced yesterday.\n\nAlexander Balutan, PCSO general manager, said the still unidentified bettor won the six-digit winning combination 10-14-16-25-11-27, which had a jackpot of P8.91 million.\n\nBalutan said 61 other bettors won P12,780 each for guessing five of the winning numbers.\n\nThe Mega Lotto is drawn on Mondays, Wednesdays and Fridays.\n\nMeanwhile, the jackpot of the 6/58 Ultra Lotto draw is expected to hit P156 million after nobody won the draw on Tuesday.\n\nNine bettors who hit five of the winning numbers 13-50-8-45-7-16 each won P131,180.\n\nThe jackpot of the 6/58 Ultra Lotto was last won on Sept. 5. Two bettors shared the jackpot of P256.8 million.\n\nThe Ultra Lotto is drawn every Tuesday, Friday and Saturday.","If Marc Pingris will have it his way, he’s more than ready to play in front of a capacity crowd at Philippine Arena come Christmas Day.\n\n“If I’m asked, of course I want to play,” Pingris said in Filipino when asked if he’ll play in the much-awaited Manila Clasico clash between the Magnolia and Ginebra.\n\nAgainst all odds, Pingris is taking the 50 percent chance of him playing as he seeks to make his season debut as early as Monday.\n\n“You know me. Whatever happens, I don’t care if I feel pain. It feels good to play,” he said.\n\nUnfortunately for Pingris, he doesn’t have the final say on whether he’ll be cleared for the Hotshots’ duel against the Gin Kings as he still recovers from his back injury.\n\nBut the energetic forward should know better to heed the doctor’s advice, as even he himself admits that he’s still not in game shape.\n\n“I still need to regain my conditioning because I went back to zero, so I’m not sure. It’s 50-50,” he said. “I no longer feel any pain in my back. What I’m thinking of is my breathing. I haven’t ran in 10 days, so that’s what I’m trying to work on.”\n\nEver the warrior, Pingris is exhausting all means to make it by the 25th as he aims to give the injury-plagued Magnolia a boost this early in the 2018 PBA Philippine Cup.\n\n“We’ll see if I make it,” he said.","Collegiate volleyball heats up on Feb. 3 when the 80th season of the UAAP men’s and women’s tournaments blast off at the Mall of Asia Arena in Pasay City.\n\nThree-peat-seeking women’s champion La Salle starts its campaign when it goes up against University of Santo Tomas in the 4 p.m. main game, while Adamson University and National University open their respective bids at 2 p.m.\n\nAlso spicing up the day are two men’s matches pitting last season’s bridesmaid NU against Adamson in the 8 a.m. curtain raiser, following by semifinalist UST over La Salle at 10 a.m.\n\nWith their back-to-back title victories over bitter rival Ateneo, the La Salle Lady Spikers are expected to be the team to beat this season especially after some of their playing boasting experiences in a local semi-professional club league.\n\nBut UST, one of last season’s Final Four contenders, also boast of an experience in the same semi-pro league, although settling for the eighth and last place.\n\nMeanwhile, action resumes the following day at the same venue with last year’s women’s finalist Ateneo going up against fancied Far Eastern University at 4 p.m.\n\nUniversity of the Philippines, for its part, will parade with a new coach in Kenyan Godfrey Okumu as it clashes with University of the East at 2 p.m.\n\nThe Ateneo Blue Eagles open their campaign for a fourth consecutive crown in their 10 a.m. confrontation with FEU, while the UP Maroons and the UE Red Warriors collide at 8 a.m.","Ivan Soriano faces Jaysever Abcede for the interim OPBF junior flyweight title, plus Mark Anthony Barriga vs Glenne Calacar and AJ Banal vs Jason Egera\n\n Fight Night returns with 3 bouts from Makati Cinema Square, with one interim title fight, one Olympian continuing his progression, and the return of a fan favorite from two years of inactivity.\n\nIn the main event, Ivan Soriano of General Santos City faces Jaysever Abcede of Bukidnon with the interim OPBF junior flyweight title at stake. The winner puts himself in position to challenge for the full title, currently held by Edward Heno, and will get a chance to move up the world rankings.\n\nAlso in action, 2012 Olympian Mark Anthony Barriga faces Glenne Calacar in a 10-round bout with his eyes firmly fixed on the world title picture in 2018. And in his first fight since 2015, AJ Banal jumps back into the ring with a 6-round fight against Jason Egera.\n\nFollow the fights with  Sports editor Ryan Songalia on commentary.","HOUSTON. — Rookie Kyle Kuzma scored 38 points, and the Los Angeles Lakers snapped the Houston Rockets’ 14-game winning streak with a 122-116 upset victory Wednesday night (Thursday morning in Manila).\n\n\n\n Houston had its streak end despite James Harden pouring in 51 points and adding nine assists. The Rockets also lost for the first time with guard Chris Paul in their lineup.\n\n\n\n Paul departed early in the fourth quarter with a sore left leg and did not return after posting eight points, five assists and five rebounds over 25 minutes.\n\n\n\n Los Angeles snapped its three-game skid by torching Houston’s defense, with Kuzma scoring 24 of his 38 points in the first half on 9-for-9 shooting.\n\n\n\n The Lakers, playing without starters Brook Lopez (ankle) and Kentavious Caldwell-Pope (personal reasons), had six double-digit scorers, with reserve forward Corey Brewer tallying a season-high 21 points.\n\n\n\nWarriors 97, Grizzlies 84\n\n Golden State limited Memphis to 10 field goals in the second half, allowing the defending NBA champs to gradually pull away for a hard-earned victory, their 10th win in a row.\n\n\n\n Klay Thompson had a game-high 29 points and Kevin Durant added 22 for the Warriors, but the duo combined for just nine points in the second half, when Golden State’s defense dominated the game.\n\n\n\n Memphis lost for the 16th time in 18 games. Marc Gasol overcame 5-for-15 shooting to score a team-high 21 points for the Grizzlies.\n\n\n\nHeat 90, Celtics 89\n\n Kelly Olynyk scored a career-high 32 points to lead undermanned Miami to a stunning upset of Boston.\n\n\n\n Celtics star Kyrie Irving missed an open 20-foot jumper at the buzzer. He helped Boston recover from a late 11-point deficit and finished with 33 points.\n\n\n\n Olynyk, who had 25 points in the second half, played the first four years of his NBA career with the Celtics before signing a four-year, $50 million contract with the Heat. Josh Richardson added 19 points for the Heat, who were playing without four starters.\n\n\n\nThunder","MALAYBALAY CITY (/13 December) – An amount of P250 million from the 2018 funds of Senator Juan Miguel Zubiri has been allotted for the construction of a provincial sports complex in Bukidnon, Gov. Jose Ma. R. Zubiri Jr. said.\n\nGov. Zubiri made the announcement to members of the Sangguniang Panlalawigan during their regular session on December 12. He said they are still choosing from two sites, one each in Malaybalay and Valencia cities.\n\nThe provincial government would need at least P500 million to build a standard sports complex, so the provincial government will allot another P250 million in its budget next year, he said.\n\nHe said land acquisition alone, which could be achieved next year, is estimated at P150 million at P1 million per hectare for 15 hectares.\n\n“Finally, we’ve been dreaming about that,” said Maite Abellanosa, head of the tourism cluster of the Bukidnon Chamber of Commerce and Industry Inc. Her group had organized sports events in the past.\n\nShe said the sports complex should be in Malaybalay because it is home to world-class athletes who have performed well in international competitions.\n\n“This is going to be the biggest step that the province can make in terms of its war on drugs and alcoholism. The community needs a place wherein they can work out, run, swim and even take boxing lessons,” she said.\n\nShe added [building the complex] will enable the city to get rid of its reputation as the home of many alcoholics.\n\nKenneth Amiel M. Taylor, a sports coach and triathlete, said it will hopefully become a reality so that Bukidnon can compete well in national events.\n\n“We can’t compete due to lack of sports facilities. The sports complex will level the playing field,” he said, adding it is also good for the health of the citizens.\n\nTaylor said Bukidnon is probably the only province in Northern Mindanao without a sports complex.\n\nAlbert Celebran, sports coordinator of Bukidnon State University, said it is important to have a sports complex.\n\n“Th","MANILA, Philippines — The Pasay City Cockpit holds the Smalltime three-cock derby today with more than 60 fights on tap.\n\nParticipants from Roligon, Elorde Cockpit Stadium, San Juan Coliseum, Las Piñas Coliseum, Sta. Monica Cockpit (Novaliches), La Loma Cockpit and Mandaluyong Coliseum make up the cast in the event backed by Sagupaan Superfeeds and Complexor 3000.\n\nThe guaranteed prize is expected to reach P150,000.\n\nMeanwhile, the Erica and Marie four-cock derby will be held on Dec. 29 with PCC operations manager Erica Clemente and Marie Rama as hosts.\n\nThe Pasay Cockpit has also lined up two derbies to kick off the 2018 season, including the Battle of Friends four-cock derby on Jan. 5 (Silver Taff, Col. Val Lopez and Ryan Esteban) and the Jared and Friends four-cock derby on Jan. 12 (Jimmy Junsay).","FINDON, AUSTRALIA—There’s modesty and politeness from the Australian Boomers in their expected dominance of the months-long FIBA World Cup Qualifiers that continue here at the Titanium Security Arena.\n\nCoach Andrej Lemanis laughs with pleasantness observations that Australia, which ruled 2017 FIBA Asia Cup in Beirut last September, will easily make it to the grand stage in China.\n\n“No, not at all,” Lemanis told The Filipino Connection on the favorites tag.\n\n“They are very good teams,” he adds, referring to the Asian teams (half of which they bamboozled in Beirut by an average of 28.83 pts.). He kind of notes though that the Beirut tournament did not see the best players from the 15 other competing countries.\n\nBoomers rookie Nathan Sobey, of the Adelaide 36ers, agrees with Lemanis on not noting any tough team in Asia, or at least in Group B where the Philippines is also.\n\n“We got to worry about tomorrow night [against Japan at Titanium]. Anything can happen. We hope to execute to win,” the 27-year-old Sobey said.\n\nThe Boomers will play Gilas of the Philippines on February 22, 2018 at a venue that’s yet to be announced. In Beirut, the Philippines —without naturalized Andray Blatche— placed seventh.\n\nOn the Philippine team, Lemanis said “we’ll see.” “They look very, very good. Their style… They’re quick and all those things.”\n\nNevertheless, Lemanis respects all of their Asian opponents even if they have been hammering them at will since Beirut, like the Boomers are playing drills games.\n\n“We respect all our opponents. But at the end of the day, we always focus on ourselves. On what we need to do to be the best team we can be. We cannot control how they play. We can control how we play,” he said.\n\nAustralia kicked off its World Cup qualifying home-and-away matches with a 104-66 shellacking of Chinese-Taipei at the Heping Basketball Gymnasium in Taipei City.\n\nThe Boomers are set to play Japan (which the Philippines beat narrowly last Nov. 24 in Tokyo) tomorrow night at t","Roll of Successful Examinees in the\n\n ARCHITECT LICENSURE EXAMINATION\n\n Held on JUNE 23 & 25, 2017 Page: 2 of 31\n\n Released on JUNE 28, 2017\n\n Seq. No. N a m e\n\n 1 ABAC, MA ANGELICA MORAÑA\n\n 2 ABACAHIN, JUMAR MADJUS\n\n 3 ABAD, JOHN MATTHEW\n\n 4 ABALO, PATCHOLUO GUIRIGAY\n\n 5 ABALOS, EUNICE SARADAT\n\n 6 ABAN, DARRYL JENSEN COSTES\n\n 7 ABAN, MARIA KRISTINA CORNEJO\n\n 8 ABANDO, CARL LOUIE DEL ROSARIO\n\n 9 ABDULLAH, MOHAMMAD NAJIB EQUIPADO\n\n 10 ABELA, DHYMPHINA MINDARO\n\n 11 ABELLANA, TIMOTHY XERXES BRIONES\n\n 12 ABELLERA, LANTE RIVERA\n\n 13 ABIÑO, VAN MURRAYE PANTALEON\n\n 14 ABLA, KRISTER KIM SININING\n\n 15 ABONDA, AARON JOHN LINGBAOAN\n\n 16 ABRENICA, JERON FERRER\n\n 17 ABROGAR, ALVIN CARIÑO\n\n 18 ABULAD, ANDREA ALEXIS ASUNCION\n\n 19 ACEDO, FERDINAND PILONGO\n\n 20 ACEJO, KRISTINE ROLACE NOBLE\n\n 21 ACEVEDO, HARREN SAVILLA\n\n 22 ACHA, ARMANDO JR IGNACIO\n\n 23 ACOSTA, JAYSON BABALO\n\n 24 ACOSTA, JUVILYN PARAWAN\n\n 25 ACUÑA, ANNA TRICIA LEE\n\n 26 ACUÑA, JESCA GERONGA\n\n 27 ADARLO, NIKKO DOMINIC LUISTRO\n\n 28 ADORA, JUNY MAINAR\n\n 29 ADRA, AUDREY MAREE ANOCHE\n\n 30 ADUCAL, CHARMAINE DENISE CASIPLE\n\n 31 AGAS, HERSON ANGELES\n\n 32 AGBAYANI, RONELYN BALTAZAR\n\n 33 AGCOPRA, JONATHAN PAGARAN\n\n 34 AGITO, GRANT IRVING REYES\n\n 35 AGLASI, ANGELO DAPIAWEN\n\n 36 AGLIAM, KEVIN-KIM AGCAOILI\n\n 37 AGNIR, RENZRYLE JOHN BOLILAN\n\n 38 AGORTO, JERMAINE FONTALBA\n\n 39 AGRAMON, JAHLEEL MICAH POLOAN\n\n 40 AGUILAR, ANNA JANNELL CUNAN\n\n 41 AGUILAR, REGINE MARTHA LARON\n\n 42 AGUILAR, VIC ANGELIE TAÑO\n\n 43 AGUILLON, LUCKY JAN BASIYA\n\n 44 AGUINALDO, ROLAND JULIUS BATOON\n\n 45 ALA, PRINCE RUDOLF CALONGE\n\n 46 ALAPAR, CRIS SALAFRANIA\n\n 47 ALAPAR, KATHRINE CRIS GASPAR\n\n 48 ALASKA, NICA LOUISE TAHIYAM\n\n 49 ALBA, IAN RICARDO MAURICIO\n\n 50 ALBA, MARI ANNE MOLINOS\n\n Roll of Successful Examinees in the\n\n ARCHITECT LICENSURE EXAMINATION\n\n Held on JUNE 23 & 25, 2017 Page: 3 of 31\n\n Released on JUNE 28, 2017\n\n Seq. No. N a m e\n\n 51 ALBAR, FERDINAND ALBANIEL\n\n 52 ALBIA, PAUL II ROSALES\n\n 53 ALCANTARA, ALMAR APELLEDO\n\n 54 ALCANTARA, ALVIN ARNEZ\n\n ","Jerwin Ancajas has a breakout year, while champions and contenders rise up on the ever-changing scene of Philippine boxing\n\nMANILA, Philippines – In years past it may have been said that, as Manny Pacquiao goes, so goes Philippine boxing. Yet, just as has been the case for the past century, wherever there were opportunities for young men to literally fight their way up the ladder in life, they did so. With the spotlight coming off Pacquiao, other fighters stepped in to make their names.\n\nJerwin Ancajas, the IBF junior bantamweight titleholder, was the fighter who generated the most excitement in 2017, making 3 defenses of the belt in 3 different countries, scoring knockouts against each challenger. There were two other Filipino fighters who added world titles, with Donnie Nietes capturing the vacant IBF flyweight belt with a win over Komgrich Nantapech, joining Pacquiao and Nonito Donaire Jr as the only boxers from the Philippines to win championships in at least 3 divisions, and Milan Melindo, the hard-luck warrior from Cagayan de Oro City who made good on his mandatory shot, stopping Akira Yaegashi in the first round to win the IBF junior flyweight belt.\n\nThe Philippines also lost title belts, with Pacquiao dropping a shock decision to Jeff Horn in Australia for the WBO welterweight crown, and Marlon Tapales being stripped of the WBO bantamweight belt after he missed the 118-pound weight limit before stopping Shohei Omori in April. The 25-year-old Tapales did not fight again the rest of the year after being out of the ring for 9 months before that.\n\nWas 2017 a “Passing of the Torch” year? It’s hard to say, though the recent success of Ancajas has given some hope that fans may be ready to coalesce around a new fighter. With Pacquiao now busy in the Senate and winding down his career, there is an opening for that next great boxer to cheer for. Could Ancajas fill that void? Perhaps, he’s certainly young enough and has shown he has the nerves to win in other fighters’","MANILA, Philippines — Even after powering Blackwater in scoring on Friday night, it was evident that newcomer Raymar Jose had the rookie jitters.\n\nGoing to the charity stripe on the second period, Jose, picked third overall by the Elite, aimed carefully at his mark — the rim —cocked back his arms and launched his shot, only to fall short miserably.\n\n“Na-excite ako,” the talent out of Far Eastern University said with a chuckle. “Nagulat ako na ganoon ‘yung nangyari. Eventually na-adjust ko naman. Nakuha ko naman ‘yung rhythm ko. [Pero] practice ko pa.”\n\nTrue enough, Jose gained his bearings come the second half. In the fourth period, he teamed up with teammate and Gilas gunner Allein Malksi for a fiery run that narrowed what was then a 19-point gap.\n\nJose poured seven of his total 16 points in the final quarter alone. But his efforts were rendered futile after KG Cañaleta, a veteran free agent picked up by the Bolts during the offseason, nailed a dagger trey and a pair of freebies as the game wound down.\n\nDespite recovering from the gaffe, Jose said that it was in those final sequences where he got the most learnings.\n\nIn 22 minutes of action, D-League MVP Jose hauled six rebounds and added two assists to his double-digit scoring.\n\nHis bid to improve will be tested when he and the rest of the Elite take on crowd-favorite Barangay Ginebra on January 12 at the Mall of Asia Arena.","CLEVELAND — Isaiah Thomas is one big step closer to joining the Cavaliers.\n\nCleveland assigned the All-Star point guard to its Canton G-League team so he could practice and scrimmage with the Charge on Thursday (Friday in Manila), a significant development in his recovery from a torn labrum in his right hip. Thomas was scheduled to work out at the Cavs' training facility in Independence.\n\nOn Wednesday, Thomas said how his body responds from the stress of 5-on-5 scrimmages will determine how soon he'll be able to make his debut with Cleveland. He's been sidelined since aggravating a hip injury in the playoffs last season with the Boston Celtics.\n\nThe Cavs have said since October that they believed Thomas would be able to play in NBA games by Jan. 1. The 28-year-old was acquired during a hectic offseason in a trade for All-Star point guard Kyrie Irving. The Celtics sent Thomas, forward Jae Crowder, center Ante Zizic and a draft pick to Cleveland in the blockbuster deal.\n\nCleveland is eager to add him to the lineup, and LeBron James has sensed that Thomas is ready.\n\n\"Yeah, his attitude is getting worse and worse because he's getting closer and closer,\" James said following the team's morning shootaround before hosting the Chicago Bulls. \"When you get closer and closer to something you love and you want, your attitude actually gets worse.\"\n\nThomas, who averaged 28.9 points last season as one of the NBA's top playmakers, said he wants to be \"special\" when he returns to the floor and not \"just another body.\"\n\nAfter a slow start, the Cavaliers have won 18 of 20 and 11 straight at home. They'll visit the Golden State Warriors on Christmas and play at Sacramento and Utah next week before returning to Cleveland to face Portland on Jan. 2.\n\nThe next day, they'll play in Boston for their second matchup with Irving. This time, they might have Thomas on the floor.\n\n\"We're all excited for when he's able to come back to the team, but he's been around the team all year,\" James said.","MANILA, Philippines — After just one season, Jerry Yee is kissing Sta. Lucia Realty goodbye.\n\nYee is set to step down as head coach after leading the Lady Realtors to a quarterfinal finish in the Chooks to Go-Philippine Superliga (PSL) Grand Prix early this month.\n\nThe amiable FIVB Level III mentor revealed that the already announced his resignation during the club’s Christmas party last week and it would be formalized once his contract expires on December 31.\n\nSo far, Sta. Lucia has yet to release a shortlist of possible coaches.\n\nInsiders said the club would announce the name of its new mentor in a meeting on December 30.\n\n“I announced my resignation early to give the management an ample time to choose its new head coach since the PSL Grand Prix will start in February,” said Yee, who is credited for the revival of the women’s volleyball program of University of the Philippines in the UAAP.\n\n“I want to thank (the Lady Realtors) for the opportunity and I wish them well as they continue their quest for a PSL title.”\n\nYee took the cudgels for the Lady Realtors late in the game.\n\nHe assumed the position with only two weeks left before the start of the Grand Prix following the resignation of seasoned guru Sammy Acaylar.\n\nWith Ukrainian Bohdana Anisova and Canadians Marisa Field and Kristen Moncks as imports, the lady Realtors had a slow start before putting on a masterful finish to emerge with a 3-5 win-loss card after the single-round eliminations.\n\nThe Lady Realtors, however, ran out of luck as they were beaten by two-time champion Foton in the quarterfinals.\n\n“I’m proud of what we achieved,” he said. “Even if we had a new system, the girls responded by playing their hearts out, especially at the end of eliminations.”\n\nYee said he would be spearheading the formation of a new team — Total — that would see action in the Premier Volleyball League.\n\nHe, however, refused to bare the names of his potential players.\n\n“Moving to a new team is very practical for me, at least I","Iain Ramsay scores a hat trick for Ceres Negros FC to lift them to the league championship\n\nCEBU CITY, Philippines (UPDATED) - Ceres Negros FC has made history after becoming the inaugural champions of the first-ever Philippines Football League (PFL) after routing bitter rival Global Cebu FC, 4-1, at their home at the Panaad Stadium in Bacolod City.\n\nCeres midfielder Iain Ramsay had a big night as he demolished Global with a hat-trick in the 20th, 27th and 61st.\n\nCeres rout was started by Spanish footballer Bienvenido Marañón in the 4th minute.\n\nGlobal's lone goal was scored by Darryl Roberts in the 89th minute of the match.\n\nWhile the Busmen looked sharp all throughout the night, Global's Misagh Bahadoran and Paolo Salenga tried to keep up but their attempts either went wide, hit the post or were saved by Roland Müller.\n\nWith Ceres leading 3-0 at halftime, and Ramsay completing his hat trick at the 61st minute, the match was pretty much decided.\n\nCeres could have made it 5 if not for the fast action of Global keeper Patrick Deyto.\n\nAfter 28 games in a span of 7 months, Ceres stamped its name on the first-ever PFL trophy.\n\nThe inaugural PFL couldn't have had a better finals by having the Visayas Classico - between bitter rivals Global Cebu FC vs Ceres Negros FC.\n\nThe final was dimmed when Ceres thoroughly outclassed Global with its crisp passing to which Global just couldn't find an answer, a very different story from their 4 meetings during the eliminations which were all nail-biting encounters.\n\nAside from the PFL, both teams also got their hands full with the continental Asian Football Confederation (SFC) Cup and the Singapore Cup. Not to mention national call-ups because both teams are manned by several members of the Philippine Azkals, the country's national football team.\n\nBoth teams had fought hard for their finals ticket in the two-legged semifinal. Ceres advanced to the championship round with a 3-1 aggregate win over Kaya FC Makati while Global had it toug","Pablo to stay with Pocari Sweat amid rumors of jumping ship\n\nMyla Pablo will honor her contract with the Pocari Sweat Lady Warriors.\n\nPablo’s fiancé National University women’s basketball coach Patrick Aquino cleared speculations of the Lady Warriors ace hitter jumping fence from the Premier Volleyball League back to rival league Philippine Superliga.\n\nBut Aquino, who also serves as Pablo’s manager, admitted that there were offers from PSL teams to buy-out her contract with the Lady Warriors.\n\n“Sa Pocari pa rin siya,” said Aquino, who added that Pablo will finish the remainder of her 5-year contract that started last year. “Yes, there were offers pero we decided to stay in Pocari this year.”\n\nPablo posted on Twitter late Tuesday a picture of her while donning Philips Gold uniform back when the Federated Distributors, Inc. franchise was still playing in the PSL.\n\nHer post led fans to speculate that she might make a return to her former league.\n\n Sports tried to take Pablo’s side on the issue but the former NU open hitter has yet to give a statement as of posting time.\n\nPablo and Philips Gold left PSL after the 2015 season when the Lady Slammers finished third both in the All-Filipino Conference and the Grand Prix.\n\nThey joined the V-League, later renamed PVL, in 2016 carrying the Pocari Sweat banner.\n\nPablo signed a lucrative 5-year contract, which included a car, with the Lady Warriors last year.","ILOILO and Negros booters reinforced the impression that they are the teams to beat in the 1st Governor’s Cup Under-15 Regional Invitational Football Tournament as they blanked their respective opening day opponents at the Iloilo Sports Complex (ISC) football field, Dec. 19, 2017.\n\nTeam Iloilo comprised of footballers from various colleges and universities in the province massacred Capiz, 15-0.\n\nChristian Talamor of Cabatuan National Comprehensive High School (CNCHS) provided the spark for the Ilonggos after scoring a hat-trick in the 13th, 14th, and 31st minutes of the ball game.\n\nKhent Brian Valenzuela of Central Philippine University (CPU) made the first goal for the victors 8 minutes after the opening kick. Ateneo de Iloilo (AdI) striker Konrad Keim Sollorin followed with two shots in the 22nd and 23rd minutes.\n\nA minute later, Nhelvin Solen Leonora again punched the back of the net for the Ilonggos.\n\nOther scorers for Iloilo were Archie John Belluga (28′), Zymone Binas (40′ and 58′), Rolf John Alminaza (57′), Justin Clavaton (63′), RJ Pescadera (73′ and 79), and Joshmar Sornito (80′).\n\nThe team was led by University of St. La Salle-Bacolod (USLS) stalwart Joshua Limco who notched four goals in the second half (42′, 44′, 49′, and 66′).\n\nConsidered as Iloilo’s perennial rival in football, Negros also drew first blood courtesy of Reuben Liansing’s goals in the 26th and 38th minutes.\n\nChyle Miraflores and Jonan Lozada chipped in two goals each while Miraflores scored in the 52nd and 61st minutes.\n\nNegrense strikers Raven Mesina and Ram Treyes contributed a goal each in the 68′ and 71′ periods, respectively.","OAKLAND, California — Warriors coach Steve Kerr didn’t see much passion from his team Saturday (Sunday Manila time).\n\nGolden State better find some fast for Christmas Day, when LeBron James and the Cleveland Cavaliers come to town for a prime-time holiday rematch of the past three NBA Finals.\n\nGary Harris scored 19 points to lead a balanced Denver offense and the Nuggets stopped the Warriors’ 11-game winning streak with a second impressive road victory in two nights, beating Golden State 96-81.\n\n“It didn’t feel like we were into it emotionally tonight. Sometimes after a long winning streak, whatever reason, you let your guard down a little bit. It wasn’t there,” Kerr said. “The biggest concern for me tonight, I didn’t see a lot of joy. … We weren’t having much fun.”\n\nNikola Jokic added 18 points and nine rebounds and Jamal Murray had 14 points, six rebounds and five assists for the Nuggets after their Friday win at Portland. They held the defending NBA champions to a season low for points.\n\nKevin Durant had 18 points and six rebounds in a particularly poor shooting performance for the typically efficient NBA Finals MVP. He was 6 for 17 and missed all five of his 3-point attempts as the Warriors shot 38.6 percent.\n\nDraymond Green had 10 points, six assists and five rebounds in his second game back after missing five of six with soreness in his right shoulder. He took a sharp elbow to the face from Jokic with 7:27 remaining and went down hard, then was getting X-rays on his left elbow afterward.\n\nKlay Thompson scored 15 for the Warriors but was 6 for 21 overall and 1 of 10 on 3s as Golden State went just 3 for 27 from deep. A night after posting his first career double-double with season bests of 20 points and 10 rebounds, Warriors rookie Jordan Bell contributed seven points and 10 rebounds.\n\nPatrick McCaw’s floater with 7:13 to go pulled Golden State to 82-71, but the Warriors couldn’t do much more to fight back.\n\n“I can’t remember seeing many teams hold that team to","SALT LAKE CITY — Missing their leading scorer for the second consecutive game, the Utah Jazz needed Rodney Hood to score in bunches.\n\nHe did exactly that, including 11 fourth-quarter points to help Utah end a three-game losing streak.\n\nHood had 29 points and the Jazz fended off multiple comeback attempts by San Antonio to beat the Spurs 100-89 on Thursday (Friday Manila time).\n\nUtah played without rookie guard and top scorer Donovan Mitchell, who missed his second consecutive game with a bruised right big toe.\n\n“When Donovan is out, I have to be a lot more aggressive,” Hood said.\n\nThe Jazz led most of the way, but the Spurs fought back each time it appeared Utah was ready to put the game away.\n\nHood took over in the fourth quarter after San Antonio cut the lead to 82-81. Utah went on a 13-2 run with Hood scoring nine straight points, including a contested pull-up 3-pointer from the corner and a spinning, mid-range jumper to push the lead to 12.\n\n“You noticed he was pretty good, huh?” Spurs coach Gregg Popovich said. “I thought they did a really good job in pick-and-roll, attacking and getting the ball to really open shooters. The last two 3s he hit, they were contested pretty well and he made great shots.\n\n“In general they did a great job executing and finding the open man out of pick-and-roll and they really sliced and diced us in that regard. That was nice to watch in a weird sort of way.”\n\nRicky Rubio had 11 points and 11 rebounds, while Derrick Favors finished with 14 points and nine rebounds.\n\nThe Jazz led 50-38 at halftime thanks to a 14-point half by Hood. Utah used a 17-3 run spanning the end of the first quarter and the beginning of the second, highlighted by back-to-back 3s from Joe Johnson and Rubio, to take a 30-17 lead.\n\nThe Spurs opened the third quarter with an 11-1 run as LaMarcus Aldridge warmed up and cut the lead to two. San Antonio answered each time the Jazz tried to pull away before Hood finally sealed it.\n\n“We knew they were going to go on a r","Reflections on the Busmen's title and what lies ahead for the PFL\n\nMANILA, Philippines – There is so much to discuss following Ceres Negros' dominant performance on Saturday, December 16, when they dismissed Global Cebu 4-1 in the PFL Final in Bacolod's Panaad Stadium.\n\nCeres Negros' roster overkill paid dividends in the final. One look at the Ceres Negros roster and you can see talent overflowing. It almost seems unnecessary to have that many skilled, high-priced players on your squad.\n\nBut the past few weeks have shown that if Ceres really wanted to win a title, they had to pay for excess quality. Most teams would not have been able to cope with the season-ending injuries to Manny Ott, their slick-passing midfielder, and goalscoring machine Fernando Rodriguez. But the Negrenses kept trucking along, out-playing Kaya 3-1 over two legs then routing Cebu on Saturday.\n\nIain Ramsay and Bienve Marañon picked up the slack in the scoring department, while Stephan Schrock and Junior Muñoz assisted in the final. Global actually had plenty of chances in the first half and could have made a game of it, but their defense froze under the Panaad floodlights.\n\nThis team was built for silverware, and after an underwhelming regular season (they even lost to JPV Marikina) the squad delivered when it mattered.\n\nOne word about Schrock: we all know that he can make pinpoint, perfectly-weighted passes. But on Saturday we witnessed him do that with a huge puddle in the way. No doubt he has seen a lot in his long career, including his share of waterlogged pitches. See it on this clip.\n\nGlobal Cebu showed plenty of character this season. The bridesmaids can take a bow. They succeeded off the field by drawing the biggest paying crowds among all the clubs. On the field they battled back as the fourth seed to beat top-seeded Meralco to make the final. They also came from a goal down twice against Albirex Niigata Singapore in the Singapore Cup final only to lose the shootout 3-1.\n\nWith a new ow","MANILA, Philippines — The Philippine Football Federation is yet to decide with finality where to hold the Azkals’ all-important home game against Tajikistan in the AFC Asian Cup Qualifiers in March.\n\n“It’s a toss-up between Panaad (in Bacolod) and Rizal (Stadium in Manila),” PFF president Nonong Araneta told The STAR.\n\nPanaad hosted the Pinoy booters’ last home outing against Yemen last September but logistical concerns are making the PFF consider moving it back to Rizal, which was the site of the first home game against Nepal last March.\n\n“We’re looking at the expenses also for this game. If the coveror finds the expenses big, we just might go to Rizal,” said Araneta.\n\nThe crowd factor is also in the mix as Panaad, being in a football-loving region, can bring in larger attendance than Rizal.\n\n“Of course, the crowd is there in Bacolod but it will be more expensive to go there. If we go to Rizal, hopefully we can hype the game up for us to get more people to watch. It’s a do-or-die game so I hope fans will support,” said Araneta.\n\nThe Azkals are seeking to get the result against Tajikistan to clinch that historic stint in the 2018 Asian Cup. The Pinoy booters could have advanced earlier but settled for a scoreless draw with also-ran Nepal in Kathmandu last month.","BEN Mbala, probably the most dominating international player to ever grace in Philippine collegiate hoops, has decided to forego his final UAAP men’s basketball season with La Salle.\n\nAfter helping the Green Archers capture the championship last year and emerge as back-to-back MVPs, Mbala won’t be back as the Yaoundé, Cameroon native will strut his wares in the Mexico pro league.\n\n“It is with a heavy heart that I announce that the time has come for me to move on from De La Salle University and the Green Archers,” said Mbala in a lengthy statement through his Twitter account yesterday.\n\n“I want to publicly thank boss ECJ (Eduardo Cojuangco Jr.), the managers, coach Aldin (Ayo) and the rest of the coaching staff, and all my teammates for the incredulous opportunity that have been given during my time there,” he added.\n\nA transferee from Southwestern University in Cebu, Mbala spent three years in residency  -- the last one was a result for committing one of the violations of the league rules for players serving residency  --  before finally suiting up for La Salle.\n\nHe immediately made an impact by reaching double-double in all of the 17 games last year and led the Green Archers’ remarkable 16-1 championship run.\n\nMbala missed two games early in the season due to his Cameroonian national team duties in the Fiba Afrobasket but was able to power La Salle to a second straight UAAP championship appearance before bowing to  Ateneo.\n\n    \n\nMbala capped his collegiate career with 31 double-doubles in 33 contests.\n\n    \n\nWith his impressive performance in the Fiba Afrobasket last September where he averaged 24 points and nine rebounds per game, Mbala on the radar to many pro-squads all over the world, that even the Blue Eagles’ Kiwi-American coach Tab Baldwin receiving a message from a Turkey team inquiring about the  6-foot-8 slotman.\n\n    \n\nEventually, the Mexican pro club Fuerza Regia recently announced that Mbala will be its foreign reinforcement for the second half of the","Hall of Fame promoter Bob Arum said yesterday that there is no truth to reports in the Australian media that Manny Pacquiao has been guaranteed a purse of $5-million for his April 23 fight with Jeff Horn.\n\n“That’s not true,” said Arum from his home base in Las Vegas, noting that it is him, and not the New Zealand promoters he partnered with, is the one in charge with providing Pacquiao’s paycheck.\n\n“That (Pacquiao’s purse) was not even talked about because that is my responsibility as his promoter,” said Arum.\n\nA trip to the Philippines by Arum to meet Pacquiao is on the table “as soon as I finalized all my documents,” the 85-year-old Arum said.\n\nThe coming days will be crucial as Duco Promotions, the Auckland-based outfit that Arum forged an agreement with, is set to confer with the state governments of Queensland (Brisbane), New South Wales (Sydney), Victoria (Melbourne) and South Australia (Adelaide).\n\nEven the Middle East with the United Arab Emirates is in play to serve as host of the Pacquiao-Horn world welterweight title fight if it presents a better financial package.\n\nArum points out that what he expects Pacquiao will get will be “reasonable” given that he won’t be showcasing his stuff the way he’s gotten used to over the years.\n\nHorn’s camp is determined to stage the fight on home soil with Brisbane’s 52,500-seat Suncorp Stadium as site while his handlers are short of pleading on bended knees that the state government should step in.\n\n“It’s a travesty (if the fight lands outside Australia),” said Horn’s manager Glenn Rushton during a press conference held in Brisbane just a few hours after Arum brokered a deal with Duco Promotions.\n\nHorn is an unbeaten former schoolteacher who has a 16-1 win-loss-draw record with 11 KOs.\n\nA complete mystery outside Australia and New Zealand, the 28-year-old Horn promises to rise to the occasion and score the biggest win in Australian fight history once he gets in the ring with the Filipino eight-division champion.\n\nPacquia","BOCAUE — LA Tenorio has countlessly bailed out Ginebra in tight situations before, may it be dropping his signature baseline reverse or drilling a gutsy three whenever his team needs him the most. But more than his heroics, what makes the 33-year-old important for the Gin Kings has always been his stability, emerging as the calming force for the crowd favorites through the course of their campaign this 2017 PBA Governors’ Cup. So it shouldn’t come as a surprise that Tenorio was adjudged as the Cignal-PBA Press Corps Finals Most Valuable Player after averaging 11.2 points, 3.0 rebounds, 3.7 assists, and 1.3 steals in Ginebra’s title repeat. He also upped the ante in the winner-take-all Game 7 on Friday, firing eight of his 26 points in the first quarter and 10 more in the third quarter as the Gin Kings subdued the Bolts, 101-96. It was Tenorio’s third Finals MVP award after winning the plum in the 2010 Fiesta Conference, which he shared with Cyrus Baguio in Alaska, and in last year’s Governors’ Cup. This also ties the Nasugbu, Batangas native with PBA greats Danny Ildefonso and Eric Menk for the second-most Finals MVP awards at three.","THE Cebu City Sports Commission (CCSC) will bring back the commercial league in Cebu, starting with the Cebu City Sinulog Cup 2018 Basketball Invitational on Jan. 8 to 13 at the Cebu Coliseum.\n\nFive teams will vie for the title in the basketball tournament supported by Cebu City Government and the Samahang Basketball ng Pilipinas.\n\nCompeting for the P75,000 grand prize will be PBA D-League Team Marinerong Pilipino, University of the Visayas (UV) Green Lancers/SG ARQ Builders, University of Cebu (UC) Webmasters/M Lhuillier, Cebu Landmasters Inc. and the University of San Jose-Recoletos (USJ-R) Jaguars.\n\n“This is a launch to revive the local commercial tournaments of Cebu. We’re looking to having three commercial tournaments ever year in partnership with different stakeholders,” said Cebu City Councilor Jerry Guardo during the press conference at the Yayoy’s Grill yesterday.\n\nGuardo, who’s also the deputy mayor for sports, said that they will be spending nearly P300,000 for the 2018 Sinulog Basketball Cup.\n\n“As chairman for sports this gives me the opportunity to help the local basketball in Cebu. After college, most of the players will not have a tournament to play so we have come up with this event,” he said.\n\nOne of the organizers Raul “Yayoy” Alcoseba said that they’re considering to add more teams for the second tournament this summer.\n\nThis will be a yearly activity. We will have a summer league and we’re looking to add high school, commercial and college divisions,” said Alcoseba, who coaches UC.\n\nAlso present in the press conference were Cebu City Councilor Euginio Gabuya and CCSC Chairman Edward Hayco.\n\nThe teams will play in the single round-robin classification phase. The top two teams will advance the championship round, while the third and fourth seeded squads will play for third place.\n\nEvery team is allowed to enlist two imports but only one may play at a time during the game.\n\nThe champion will earn P75,000, the second placer gets P50,000, the third pl","Over 5 years after his first world title shot, Mercito Gesta gets a second opportunity against WBA lightweight champion Jorge Linares\n\nMANILA, Philippines - Five years is a long time in a boxing career. That’s how long Mercito Gesta has had to think about the last time he stepped between the ropes with a world title at stake.\n\nIt was December 8, 2012, a date that would become infamous in Philippine boxing for the events that happened later in the night. When the bell rang for his fight against Miguel Vazquez, he was lost, seemingly unable to find a solution for the awkward movement of the then IBF lightweight titleholder. He lost his unbeaten record, but more so than that, he lost all momentum in his career.\n\n“He didn’t show up for the Vazquez fight, that’s what I think,” said Marvin Somodio, who co-trains Gesta with Freddie Roach, before adding “he’s a better fighter now.”\n\nGesta admits it was hard to live that night down, when he never got out of first gear in a snoozer of a fight.\n\n“After that I learned that I need to just accept what happened and learn from it, and I became a better fighter, and person who accepts challenges in life,” said Gesta, 30, a native of Mandaue City now based in San Diego, California. “Because of that I trained harder, not just harder but also smarter.”\n\nHe is adamant that he’d know what to do in a rematch with Vazquez, but he can put that ghost behind him with his next big opportunity, when he faces WBA lightweight titleholder Jorge Linares on January 27 at The Forum in Inglewood, California.\n\nLinares (43-3, 27 knockouts) is no small hill to climb. The 32-year-old from Venezuela has won world titles in 3 different weight classes and has won 12 straight fights, growing his fan base in the United Kingdom against some of England’s top contenders like Anthony Crolla and Luke Campbell.\n\nGesta (31-1-2, 17 KOs) has made several significant changes to his career since that last defeat. He has signed with Golden Boy Promotions, which also handl","Notable NBA games have been a staple hardcourt action during Christmas Day. Rival teams, compelling storylines and rematch of the NBA Finals are some of the games that are scheduled this year.\n\nSolar Entertainment, through BTV and NBA Premium TV, guarantees NBA fans in the Philippines to never miss the action and get their basketball fix on this special day.\n\nTune in on December 26 and don’t miss the following games:\n\nHouston Rockets vs Oklahoma Thunder\n\n LIVE at 9 AM on BTV\n\nThese 2 Western Conference Powerhouse teams were the busiest in the off-season as they acquired All Stars to bolster their lineup with Houston trading for Chris Paul and the Thunder trading for Paul George and Carmelo Anthony.\n\nLIVE at 4 AM on NBA Premium\n\nNow with Kyrie moving over to Boston; Cleveland remains to be a worthy contender against the defending champions with a retooled roster and still the arguably best player in the league Lebron James. Golden State on the other hand still has that intact lineup from last season featuring 4 All Stars in Stephen Curry, Klay Thompson, Draymond Green and last season’s Finals MVP Kevin Durant.\n\nLIVE at 11:30 AM on NBA Premium\n\nThis game puts the spotlight on young and up & coming superstars Lonzo Ball & Brandon Ingram of LA, who happens to be the back to back 2nd picks of the NBA Draft, as they go head to head with Rookie of the Year winners from 2015 & 2016 Andrew Wiggins & Karl Anthony Towns of Minnesota.\n\nWith Basketball TV and NBA Premium TV, we bring all the NBA action right at your doorstep #PlaybyPlayEveryDay #ThisIsWhyWePlay #NBAonBTV.\n\nBasketball TV is seen on Cignal Ch. 95, Dream Cable Ch. 34, GSAT Ch. 36, and Cablelink Ch. 60. Follow Basketball TV via facebook.com/BasketballTV, Twitter and Instagram @BTVHoops.\n\nNBA Premium TV is seen on Cignal SD Ch. 96 and HD Ch. 262, and Cablelink HD Ch. 350.\n\nContact your local provider now to subscribe to Basketball TV and NBA Premium TV and never miss an action throughout the whole NBA season. In as e","MANILA, Philippines — Jacob Ang bested an elite field and captured the overall crowns in the Formula 125 Sr. Open and the X30 SR classes of the Asian Karting Open Championship at the Kartodrome de Coloane Circuit in Macau recently.\n\nAng compiled 142 points after four legs held in Macau (June 10-11), the Philippines (Aug. 26-27), Thailand (Nov. 2-4) and Macau (Dec. 9-10) to run away with the Formula 125 class title over John Dizon (69 points) and Haopeng Zhang of China (67 points).\n\nThe San Miguel Corp. and Eagle Cement-backed ace  also dominated the X30 SR class with an overall 137-point total after four legs, beating compatriots Mikey Jordan (70 points) and John Dizon (68 points).\n\nOther overall winners were Eduardo Coseteng (Formula 125 Jr. Open and X30 Jr), Zach David (Minirok), and Leung Pui Chiu (Formula 125 Veteran Open).\n\nIn the Macau leg, Ang placed second runner-up behind champion Eshan Pieris and Royce Yu in the X30 class and finished first runner-up behind Royce Yu in the Formula 125 Sr Open.","MANILA, Philippines — Former rivals Premier Volleyball League, Philippine Super Liga and Philippine Volleyball Federation are sitting down to talk of possible unification.\n\nTony Liao, representing the PVL, PSL president Ramon “Tatz” Suzara, and the PVF’s Boy Cantada, Gerard Cantada and Ottie Camangian have met last Wednesday at a hotel in Manila and discussed the possibility of settling disputes and eventually unifying all stakeholders for the sake of Philippine volleyball.\n\nIn the initial talks, Liao said they discussed issues like grassroots development, formation of the national team and burying past leadership disputes.\n\nThe PVF was the old governing body of the sport in the country until the PVL — formerly the Shakey’s V-League — and the PSL joined hands to depose the former and form the Larong Volleyball sa Pilipinas, Inc, which is now headed by Joey Romasanta and Peter Cayco.\n\nIt turned out to be a temporary union for the PVL and PSL as the two leagues have quarreled on issues of scheduling, formation of national team and securing of International Transfer Certificates, or license for imports suiting up here.\n\nAnd now peace could reign again.\n\n“We’re always for unification and for the good of Philippine volleyball,” said Liao.\n\nCuriously, the LVPI was never informed nor invited to join the discussions.\n\n“We were not aware of it but if its unification they’re talking, we welcome it,” said Cayco, the LVPI vice president.\n\nLiao, however, said they will hold another meeting on January 15 next year, to which the LVPI will be invited.","The Magnolia Hotshots' Paul Lee tallies 30 points, with 10 in the 3rd quarter alone\n\nMANILA, Philippines – Paul Lee scorched hot for 30 points to provide the much-needed firepower for the injury-plagued Magnolia Hotshots in their 108-95 drubbing of the Alaska Aces in the 2018 PBA Philippine Cup at the Arena in San Juan on Wednesday, December 20.\n\nLee scored 10 in the 3rd quarter alone where the Hotshots led by as much as 16 points, 87-76.\n\nThe Aces worked their way to close the gap late to single digits in the 4th period following Simon Enciso's layup, 94-103.\n\nBut Calvin Abueva missed 3 of his last 4 free throws, which could have put Alaska within 5, as Robbie Herndon banked a shot in with 1:05 left in the game that put the game beyond the Hotshots' reach. – .com","LONDON — Arsenal scored three times in five minutes to wipe out Liverpool’s two-goal lead before capitulating again to draw a wild English Premier League encounter 3-3 on Friday (Saturday in Manila).\n\nSuch were the depths of Arsenal’s defensive ineptitude that the players were booed off at halftime at Emirates Stadium. And that was only when Arsene Wenger’s side was trailing 1-0 following Philippe Coutinho’s header.\n\nArsenal’s troubles deepened seven minutes into the second half when Mohamed Salah was gifted even more space to double Liverpool’s lead.\n\nBut inside 388 seconds, Arsenal was a force transformed. Liverpool paid the price.\n\nShowing the desire and assertiveness completely missing in the first half, Arsenal pulled level through Alexis Sanchez and Granit Xhaka by the 56th minute.\n\nMuch to the fury of Liverpool manager Juergen Klopp, Mesut Ozil was able to dink the ball over goalkeeper Simon Mignolet to send Arsenal into a 58th-minute lead that seemed improbable minutes earlier.\n\n“At this level you’ve got to see the game out,” Liverpool midfielder James Milner said. “You’ve got to be more boring.”\n\nBut on a night when defensive and goalkeeping calamities showed why Arsenal and Liverpool are already out of the title race at the midway point, the hosts could not hold on to the lead. Roberto Firmino had the last say, putting the ball under Arsenal goalkeeper Petr Cech in the 71st.\n\nThe draw kept Liverpool in the fourth and final Champions League qualification place, 17 points behind City.\n\nArsenal is a further point behind Liverpool in fifth but looked set to be far worse off heading into the packed festive program based on the first-half performance.\n\nArsenal was being carved apart by an attacking unit that was as cohesive as its defense was disjointed.\n\nA counterattack by Liverpool was launched by Milner’s long ball that set Salah free. The Egypt forward cut into the penalty area and delivered a cross that Coutinho met with a glancing header to mark his 150th ","MANILA–Eric Shauwn Cray revived Philippine athletics’ glory years in Asia by winning the 400m hurdles gold medal at the 22nd Asian Athletics Championships in Bhubaneswar, India.\n\nThe 2016 Rio Olympic Games semifinalist clocked 49.57 secs. to beat silver medalist Chen Chieh of Chinese-Taipei (49.75) and bronze winner Jabir MP of India (50.22).\n\nCray’s win is significant since this is the Philippines’ first gold at the Asian Championships since Marestella Torres-Sunang’s women’s long jump gold (6.51 m) in Guangzhou, China in 2009.\n\nThen at the 2011, 2013 and 2015 editions of Asia’s premiere athletics conclave, the country was shut out of the medals.\n\nAnd before Torres-Sunang’s Guangzhou feat, the last time the Philippines won gold at the Asian Championships was Lydia de Vega-Mercado’s 1987 golden sprint double (100m: 11.43 secs.; 200m, 23.38 secs.) in Singapore.\n\nOn July 7, Cray topped heat 2 with 50.85 secs. that became the second-fastest time (behind Chieh’s 50.64 secs. in heat 1). The top eight runners in the three heats qualified for the finals yesterday (July 8).\n\nWorld rankings in the 400m hurdles of All-Athletics.com (as of July 4) put Cray at no. 36 and second among Asians.\n\nAt the Rio Olympics last year, Cray reached the semifinals. In his semifinal heat, Cray clocked 49.37 secs. to place seventh (Japanese Keisuke Nozawa was sixth [49.20 secs.] in the same semifinal heat as Cray’s).\n\nBut during the preliminary heats in Rio, Cray actually posted his fastest time of 49.05 secs. to place third in heat 4 and reach the semis.\n\nAmerican Kerron Clement won the 400m gold in Rio with a time of 47.73 secs. The world record in the event is 46.78 secs., set by American Kevin Young at the 1992 Barcelona Olympics.\n\nCray’s win will give him momentum heading into the 2017 World Athletics Championships set this August 5-13 in London.\n\nEven though the entry standard for the 400m hurdles is 49.37 secs., the website of the International Athletics Federation (IAAF) wrote those wh","Nine countries are banned from competing in this year’s World Championships, being held in the American city of Anaheim in California state. And for the two-woman Philippine contingent, the development provides a chance to come home with at least one medal.\n\nChina, Russia, Kazakhstan, Armenia, Azerbaijan, Belarus, Moldova, Turkey and Ukraine were slapped with a ban by the International Weightlifting Federation (IWF). The IWF is trying to clean up the sport from a doping epidemic, and a re-testing of anti-doping samples from the 2008 Beijing and 2012 London Olympic Games showed positive results for identified lifters from each of the nine countries.\n\nFor Diaz, this means that the 53 kg. event will be without 2016 world no. 1 Chen Xiaoting (best total lift: 221), or running world no. 2 for 2017 Liao Qiuyun (208 kgs.). Xiaoting had collected nine World Championships medals in this weight class.\n\nBut 2016 Olympic gold medalist Hsu Shu-Ching is touted to rule the women’s 53 kg. class. She had collected seven World Championships medals in this category.\n\nA preview of the said weight class by IWF and gracenote (part of the Nielsen Company) wrote that Hsu is not only favored to win. Hsu aims to become the first female to claim a world title in the 53 kg. class in three straight editions of the World Championships.\n\nAt least a medal for Hsu will make her the first female to reach the medal at four straight World Weightlifting Championships.\n\nHsu and Diaz won the gold and silver medals, respectively at Rio after favored Chinese lifter Li Yajun outlifted everyone not until she failed all three attempts in the clean and jerk and got disqualified. Li had already set a new Olympic record in the snatch (104 kg.) prior to the debacle in the clean and jerk.\n\nThe other lucky medalist in Rio was Korean Yoon Jin Hee. Thus, Hsu and Yoon will be familiar foes for Diaz at Anaheim.\n\nIn Rio, Hsu lifted a total of 212 kg., Diaz 200 kg. and Yoon 199 kg. Diaz’s total lift was far from her 208 ","THE Davao Jones Academy (DJA) Spunky ended its 2017 on a high note by clinching the championship title of the United Basketball League (UBL) Mindanao Finals dubbed as \"The 18U D-Games\" held recently at the Lantapan Gymnasium in Bukidnon.\n\nDJA, which last won the title in 2009, eked out a 106-91 victory over Bukidnon North in the finals.\n\nThe team earlier defeated Team Lantapan, 111-76, in the semifinals after beating Cagayan de Oro City, Bukidnon South and Butuan City in the eliminations.\n\nDJA head coach Rael Diaz said that being a consistent underdog, among other traditional power house teams in Davao City, will finally end next year.\n\n\"The players are fully developed and ready for Division 1 battle,\" Diaz said.\n\nHe eyes to upset defending champion Ateneo de Davao University (Addu) Blue Knights in the National Basketball Training Center Philippines (NBTC) Davao City leg set in January 2018.\n\nIn a separate interview, coach Jimmy Colicot said the recently-concluded stint gave them confidence to keep pace among strong teams.\n\n\"We've learned (from the UBL Mindanao Finals) that in the game of basketball, there's no need to have a big man if you just know how to make defensive structure to force turnovers. Kasi lahat ng nakalaro namin sa UBL malalaki tapos undersized talaga kami,\" Colicot shared, adding that they relied on their tight defense and strategy to claim the crown.","An ice sculpture sums up the new Tanduay Rum and Brooklyn Nets partnership.  (Photo by NYPCG)\n\nIn a major overseas deal, Tanduay Distillers, Inc. launched on March 12, 2017 at the 40/40 Club of Barclays Center a landmark partnership with the Barclays Center, one of the major multi-event arenas in the U.S. and NBA’s Brooklyn Nets team.\n\nThe partnership designates Tanduay Rum as the official rum of Barclays Center and the Brooklyn Nets.\n\nTanduay Rum will likewise be the presenting sponsor of the popular 40/40 Club and Restaurant located at the Barclays Center.\n\nIn addition, the deal also provides that Tanduay will be the Barclay Center’s associate sponsor for its Brooklyn Show platform and will be visible in strategic areas of the arena.\n\nThe new partnership will also have Asian-inspired cocktails mixed with Tanduay Rum and prepared by New York’s top mixologists in the arena’s bars.\n\nDuring the March 12 launch, Tanduay Rum was prominently presented in various commercial breaks and sponsorship imaging and signage at Barclays Center.\n\nA Tanduay commercial was likewise aired during the Brooklyn Nets versus New York Knicks game.\n\nOutbreak Media Group led by Mr. Michael Ang (2nd from left) and Consul General Theresa Dizon-de Vega (far right) at the launch of the Tanduay Rum-Barclays Center and Brooklyn Nets partnership at the 40/40 Club in New York.  (Photo by NYPCG)\n\nThe official post-game launch held at the 40/40 Club now renamed the 40/40 Club.\n\nPresented by Tanduay Rum was attended by marketing, culinary, business, entertainment and sports personalities.\n\nAlso in attendance were officials of the Brooklyn Nets, Barclays Center, National Basketball Association, Filipino-American community members, tastemakers and influencers.\n\nIn an interview during the launch, Consul General Theresa Dizon-de Vega noted that Tanduay’s new deal with Barclays and the Nets is a significant development for Philippine products attempting to capture the global market.\n\nThrough an innovative an","MANILA, Philippines — Blackwater will be playing it safe in the new PBA season.\n\n“We don’t want to say words that we might not be able to fulfill,” Elite’s head coach Leo Isaac said. “Just give it our very best every time we play and whatever experience, confidence, we gain from the previous one, we’re hoping we could bring it in this all-Filipino.”\n\nAnd you can’t fault Isaac for saying that. After all, his squad had been riddled with injuries, with prized 2016 draft pick Mac Belo sitting out most games, the Elite just couldn’t pull off the launch they wanted.\n\nBlackwater's best outing came in last year’s season-ending Governors’ Cup, where they finished eighth and clinched a quarterfinals spot. The other two conferences didn’t see much accomplishment.\n\nBut according to Isaac, that eighth-place finish is enough to bring confidence to their side.\n\n\"The confidence of the players is elevated to the next level with those superb games that we had last conference and it came to a point that these players realized that they can do it, win big and beat those strong teams,” he said.\n\n“It’s a good morale booster for Blackwater and were hoping we could further improve in our games this conference,” Isaac continued.\n\nChoosing to pass in the 2017 Rookie Draft, Blackwater will be leaning on its old cast. Now with a healthy Belo, the Elite hope his return, paired with the still-growing crew of JP Erram, Mike DiGregorio and Gilas gunner Allein Maliksi—and the addition of draft pick Raymar Jose and veteran guard Mike Cortez—could propel them to new heights.\n\n\"We would want to get seasoned players, but since they’re not available, we have to content ourselves with developing players that someday will also be PBA superstars like Erram, DiGregorio, Belo, Maliksi,” Isaac said.\n\n\"I won't say that we will make the playoffs easily,” he noted. “[But] we will give them a run for their money. We will give our very best,” Isaac declared. “Every time we play a game, the attitude we’re bringing,","Matt Nieto reminisces about the time when he was once part of the audience during an Ateneo-La Salle game\n\nMANILA, Philippines – Ateneo Blue Eagle champion Matt Nieto posted a video on Friday, December 22, of himself and his older twin brother Mike Nieto cheering during an Ateneo-La Salle game back in 2008.\n\nThe video was taken at the upper box section of the Araneta Coliseum where the two young boys were dressed in their basketball shirseys and were seen cheering \"Go Ateneo!\"\n\nIt was in 2008 when the Ateneo Blue Eagles started their 5-peat era under Coach Norman Black, which ended in 2012.\n\nNearly a decade after the Nieto twins' video was taken, Matt and Mike are now part of the Ateneo Blue Eagles themselves. (READ: Promises and a lucky red shirt: Nieto twins continue father's legacy) – .com","It’s unusual for me to write about a golf course that I haven’t played but I’ve been victim to the unfortunate circumstance of having visited the Negros Occidental Golf and Country Club on two occasions as a journalist covering a tournament there instead of as a competitor. I did manage to play the more intriguing back nine during the 2005 PAL Interclub and spent three days on the course as a rules official on the recently concluded ICTSI Negros Occidental Championship so I’m not totally unfamiliar with the golf course.\n\nThat disclaimer aside, my mother’s family has its roots in nearby Silay City and I later learned that my grandfather, Aguinaldo Severino Gamboa had quite a role in the development of golf in the province. My mother used to tell me stories of how my grandfather had three holes of golf built on their farm in Buenbanyo not far from the city proper; a par 3, a par 4 and a par 5 prior to the Second World War The house there became the hangout of his cousins and friends that cherished the game as much as he did. Later (I’m not sure of the dates involved), he built and 18-hole layout on his property outside of the City of Silay in a place called Guinhalaran, which ran parallel to the beach. I remember going to the golf club with him in the early 60’s playing on the beach catching crabs while he and his friends played their afternoon round of golf. The great Larry Montes was a frequent visitor and stayed at my grandfather’s Silay City residence when he would visit. Another golf great, Paterno Braza, got his start in the game in Guinhalaran as my grandfather’s caddy and later as the caretaker of the course.\n\nLater still, Alfredo Montelibano, then the governor of Negros Occidental, convinced my grandfather to move the golf club to Bacolod City to the location that is now the Capitolville subdivision. The land was supposed to be granted to the club in perpetuity, but somewhere along the line, things changed and the Negros Occidental Golf and Country Club moved","EIGHTEEN-YEAR-OLD Filipino-British James Halasan Ryan said the country's Junior Volcanoes team played well but struggled in the execution department in the recently-concluded Asia Rugby U19s Championships Division 1 held at the International School of Manila.\n\nUnited Kingdom-based Ryan, 18, reinforced the Junior Volcanoes team that lost to Malaysia, 19-36, in their bronze medal match.\n\n\"We did play pretty good intensity but we lacked execution, having only five days to work together whereas many other teams played months and months,\" Ryan said during the Davao Sportswriters Association (DSA) Forum held Thursday at Hukad Restaurant, SM City Davao.\n\nHe was thankful for the opportunity to come and play for the Philippines again.\n\nRyan, whose father Edward is a British scientist and mother Fe a Dabawenya nurse, added, \"The experience was quite the same as last year, very excited! We had lots of fun together.\"\n\nHe said that he already played with some of his current teammates in past junior Volcanoes teams although a few were newcomers.\n\n\"We already built friendship that really helped alot of times (in the game),\" he said, praising his teammates for the great games they played together despite the small time they spent training as a team.\n\nRyan took a flight from London to Manila by himself early this month to join the U19 Junior Volcanoes team's training camp set December 8 to 12. The Junior Volcanoes played December 13 and 16. He then arrived in Davao City to celebrate Christmas with his relatives from her mother's side. He is slated to return to his birth country by December 27 to welcome the New Year with his parents.\n\nHis U19 stint was the second time he suited up for the Junior Volcanoes this year. He also joined the U20 Junior Volcanoes team that competed in the U20 Asia Rugby Sevens Championships in Hong Kong last August.\n\nThe judo blackbelt also won gold medals and silvers for Davao City in Batang Pinoy regional and national judo and wrestling competitions in th","Over 1,500 children are expected to participate in the first Ilocos Norte Children’s games this November 20-22, a celebration of Universal Children’s Day sponsored by the Provincial Government of Ilocos Norte (PGIN) thru Senior Sangguniang Panlalawigan Member Matthew Marcos Manotoc and Provincial Sports Consultant Faivo P. Bartolome, and the Philippine Sports Commission (PSC).\n\nThis is in line with the advocacy of Manotoc to promote a healthier lifestyle for Ilocanos by encouraging physical and athletic activity. Last year, he initiated the construction of three-generational or “3G” playgrounds in selected towns throughout the province to encourage residents of all ages to make use of facilities that include both playground sets and outdoor exercise apparatus.\n\nThe Children’s Games will involve a mix of traditional Filipino and modern games, ranging from tug-of-war, patintero, and bawang base to basketball, volleyball, and relays.\n\nThe competitions would be part of the strategic mass-based sports program under the development program that the PGIN is strategizing together with the PSC, which doubles as a community-building effort, according to PSC Consultant Sergio Opeña.\n\nOpeña was in the province last November __ for a workshop with provincial, city, and municipal sports officials to craft the official sports development program for Ilocos Norte.\n\nMeanwhile, Faivo shared, “Although marami na tayong ginawang mga programa for the province and through the local government units and provincial government, kailangan nating gumawa ng legit na manggagaling mismo sa mga idea natin, sa lahat ng sector – yung private sector, the Department of Education, at mga college at university natin.\n\nHe also explained the mass sports concept: “Pwedeng laruin ito ng mga bata, matatanda, mga senior citizen, at mga disabled, so sakop lahat.”\n\nFrom mass sports, said Opeña, “we go into grassroots sports development which would start scientifically with talent testing and [categorizing] chi","But more than the polite remarks over the Asian teams that the Boomers started playing against at the regional level since September, fatigue looms in the background for travelling teams in FIBA’s pilot home-and-away format.\n\nLemanis admits the selection of National Basketball League (NBL) players only got themselves together last November 20 prior to the trip to Taipei City. Australia to Asia, at least East Asia, is at least 12 hours to include one stopover. Straight flights from either Melbourne or Sydney can be eight hours minimum.\n\nBrisbane Bullets center Daniel Kickert, who topscored in the Boomers’ 82-58 win over Japan, admits the distance between countries, and the gaps in-between scheduled games, “takes a toll.”\n\nFrom Taipei City last Nov. 24, the Boomers flew out and got to Adelaide the following day. Their practice session was only Sunday, Nov. 25 prior to the game against the Akatsuki five of Japan at the Titanium Security Arena in Findon suburb.\n\n“We only had a 24-to-36 hour period to adjust,” Kickert told reporters at the post-game press conference. The two games for the Boomers were a rest for them in the ongoing NBL season.\n\nThis window period and distance that Australia experienced recently will soon be experienced by the Philippines. Gilas will first play hosts Australia, at a venue yet to be announced, on a Thursday, Feb. 22, 2018.\n\nThe next home game against Japan will be on Feb. 25.\n\nAmid the jetlag, Kickert swished four-of-four from three-point land en route to towing the Boomers with 22 pts. and seven rebs.\n\nBut the mobile 6’10” center is wishing for an extra day’s sleep. “An extra day will be huge for us, especially in the middle of the season.”\n\nLong-time Gilas tormentors Korea pulled off an upset last Nov. 24 over New Zealand in the Kiwi capital of Wellington, 86-80, on Nov. 23. However, a second-rate team from FIBA 2019 hosts China drubbed a beleaguered Korean squad, 91-82, in Seoul.\n\nSeoul to Wellington is at least 16 hours if non-stop.\n\nL","Metro Manila (CNN Philippines, December 4) — The Ateneo Blue Eagles fulfilled on the promise they made at the start of the season to team captain Vince Tolentino: graduate as a champion.\n\nThe Blue Eagles eked out an 88-86 win over archrivals De La Salle University Green Archers in Game 3 of the UAAP Season 80 finals Sunday at the Smart-Araneta Coliseum.\n\n\"For me, going into my last year, that was the only thing on my mind -- I wanted a championship,\" he said.\n\n\"And these boys promised me a championship. Since Day 1, we always talked about it, that we were going to get it,\" he added.\n\nTolentino finished his UAAP career with nine points and six rebounds.\n\nWith the victory, Ateneo claimed its first men's seniors basketball title in five years.\n\n\"I'm so thankful and blessed to be part of this organization,\" Tolentino said.\n\nAfter squandering a 21-point advantage and eventually losing in Game 2, the Blue Eagles held it together and were focused in finishing what they started.\n\n\"The motto of the team is always to believe. Even though we didn't finish the job in Game 2 and La Salle gave us a really good fight, we never stopped believing,\" he said.\n\nRELATED: Coach’s confidence in Isaac Go pays off\n\nTolentino had nothing but praise for head coach Tab Baldwin whom he said had a extensive grasp on developing talent.\n\n\"I've never had a coach like coach Tab. His mind is just full of basketball knowledge, for us young players, it's so important for us to develop at a young age, and coach Tab has done that and he will continue to do that in the program,\" he said.\n\n\"He's an amazing coach and probably one of the best coaches I've been coached under.\"\n\nREAD: Reigning MVP Ben Mbala looks at loss to Ateneo as a learning experience","FINDON, Australia — The reigning FIBA Asia Cup champions Australia Boomers continue to make the Asia-Oceania zone their house after posting a 82-58 thrashing of the Japan Akatsuki five at the FIBA 2019 World Cup Asian Qualifiers.\n\nThe win brought delight to a 5,000-6,000 crowd at the Titanium Security Arena in this suburb outside the South Australian capital of Adelaide. It was the Boomers’ first game in the Australian state in 20 years.\n\nBut the Boomers had to work their way in bruising past a tough-playing Japanese side that may give hints on how Gilas of the Philippines will match up with the Australians on Feb. 22, 2018.\n\nThe lead ballooned to its biggest 49-33 of an alley-hoop until Japan brought it down to seven, 55-48.\n\nJapanese star guard Yuki Togashi, at 5’6,” kept the pace of the game to Japan’s liking in the first. But as long as he was sent out at the 8:50 mark in the second, guards off the bench struggled in dictating the offense.\n\nThe Mitch Creek alley-hoop pass to fellow Adelaide 36er Matt Hodgson sealed the deal, 79-58.\n\nThe Boomers squad here, all from the local National Basketball League (NBL), showed why they will be the toughest test for the Philippines Gilas team. The current five did not even have an NBA player in its roster.\n\n“We need those sorts of games for this team to build,” Lemanis said who’s discontented with 16 turnovers and some stumbling moments due to the physicality of the Japanese. “Yet if you held a team to 58 pts. You have a chance to beat them.”\n\nBut the Japanese third-quarter run that led to a 48-55 deficit baffled the Boomers, yet Lemanis credits the team’s defense for surviving the Akatsuki onslaught. Japan can’t score in the last three minutes of the game.\n\nOn looking forward to the game against the Philippines, Lemanis calls the style of Filipino play as “free flowing” and with “much freedom.”\n\nThe Philippines is a “good athletic group,” Lemanis said. “They  move the ball, let them fly, play with good energy and fun around","MANILA, Philippines – Jacob Ang shone the most as he won the overall crowns in the Formula 125 Sr. Open and the X30 SR classes of the Asian Karting Open Championship at the Kartodrome de Coloane Circuit in Macau recently.\n\nAng compiled 142 points after four legs held in Macau (June 10-11), Philippines (August 26-27), Thailand (November 2-4) and Macau (December 9-10) to win hands down the Formula 125 class over John Dizon (69 points) and Haopeng Zhang of China (67 points).\n\nHe also dominated the X30 SR class with an overall 137 points after four legs, besting fellow Filipinos Mikey Jordan (70 points) and John Dizon (68 points) in his campaign backed by San Miguel Corporation and Eagle Cement.\n\nOther overall winners were Eduardo Coseteng (Formula 125 Jr. Open and X30 Jr.), Zach David (Minirok), and Leung Pui Chiu (Formula 125 Veteran Open).\n\nIn the Macau leg, Ang placed second runner-up, behind champion Eshan Pieris and Royce Yu in the X30 class and 1st runner up behind Royce Yu in the Formula 125 Sr. Open.","MANILA, Philippines — It's an understatement to say that Ben Mbala made a splash in the UAAP.\n\nHeck, he cast waves big enough to tip the whole ship and made sure the league will never be the same.\n\nTwo years of residency and an additional year of ban were all worth it as the Cameroonian led La Salle to a UAAP championship in Season 79.\n\nHis rare mix of height, speed and agility proved too much for the league and earned him two MVP plums.\n\nWe'll surely miss the big guy now that he skipped his last season and decided to suit up in Mexico.\n\nFor one, his monster of a slam last season will always be remembered as one of the best plays in UAAP history.\n\nEnjoy this seven-minute and two seasons worth of highlights from Mbala.\n\nWe wish you well in your future endeavors, Ben!","Mbala joins Mexican club Fuerza Regia with hopes of having an easier time transitioning to the pro world\n\nMANILA, Philippines – A few days after seeing his De La Salle Green Archers' reign as the kings of UAAP basketball come to a heartbreaking end at the hands of archrival Ateneo Blue Eagles, the last thing Ben Mbala expected was to be confined in a hospital near campus, recovering from dengue fever.\n\n\"I was in my hospital bed,\" said Mbala on Friday, December 22. \"I had a week to think it through.\"\n\nWhat the two-time UAAP MVP is referring to, of course, is the bombshell of an announcement he made early Friday morning. After spending 5 years at De La Salle (3 years in residency, two playing for the Green Archers), the Cameroonian big man made it public through his social media platforms that his college playing career was coming to an end after he decided to go pro.\n\nThe 6-foot-8, 22-year-old has signed with Mexican professional basketball club Fuerza Regia de Monterrey, which competes in the Liga Nacional de Baloncesto Profesional – Mexico's top pro league. It's the next step in Mbala's career, which started at Cebu-based Southwestern University and will end, he hopes, at the highest form of basketball in the world.\n\n\"I chose Mexico because I felt like I will have an easier time making the transition to the pro world,\" Mbala said.\n\nAccording to the Instagram post of La Salle alumnus and veteran sportscaster Quinito Henson, Mbala signed a one-year contract with Swiss agent Stefano Lips who arranged a tryout for Mbala with Fuerza Regia, the league's defending champion. Henson also wrote that Mbala has already made his Mexican league debut, finishing with 9 points and 5 rebounds in only 13 and a half minutes off the bench during his team's 87-69 victory last Thursday, December 21.\n\nThe news was shocking for many, especially fans of the Green Archers, given Mbala's comments about returning for the 2018 UAAP season following La Salle's Game 3 defeat to Ateneo. But accor","Winter is coming...but it's going to take a while\n\nMANILA, Philippines – The night is dark and full of terrors – at least for fans of Game of Thrones, who will have to go over a year without their beloved show. According to Sophie Turner, who plays Sansa Stark in the HBO series, the 8th and final season of the series will be out in 2019.\n\n“Yeah, I’m really excited. Game of Thrones comes out in 2019. Dark Phoenix is in November [2018],” Sophie said in an interview with Variety.\n\nWhile HBO has not confirmed the news, the longer wait time for the 8th season is not surprising. The upcoming season will have just 6 episodes in total, though each one will last an hour and a half long.\n\nWe’re ready to bet that HBO will not be holding back on special effects on this one, as CGI-heavy elements such as dragons, wildfire, and a fleet of whitewalkers gain a bigger role in the story.\n\nAs the final season, it’s also meant to tie up quite a handful of story lines – which means some tricky narrative navigation on the part of the writers.\n\nThis means that it might very well be more than a year’s wait before fans see new episodes of the show, whose most recent season finale saw two beloved characters unknowingly committing incest, a long-held fan theory finally being confirmed, and the Wall crumbling with the help of a zombified ice dragon. – .com","The Lakers overcome the 51-point outburst from James Harden to score the upset win\n\nLOS ANGELES, USA - Kyle Kuzma led the offensive charge as the Los Angeles Lakers snapped the red-hot Houston Rockets' 14-game winning streak with a 122-116 upset victory on Wednesday, December 20 (Thursday Manila time).\n\nKuzma scored a NBA career-high 38 points as the Lakers dominated the Rockets early then held on through a mid-game Houston rally to claim the win and end their own three-game losing skid.\n\n\"I scored 30 in the summer league,\" Kuzma said. \"This is a better team but the same mentality. I've got the same mentality every time I step on the court, play my hardest and just be locked in.\"\n\nThe loss spoiled a 51-point scoring performance by Rockets star James Harden, who also added 9 assists.\n\nThe Rockets dropped to 25-5 on the season and also lost for the first time with guard Chris Paul in their lineup.\n\nPaul departed early in the fourth quarter with a sore left leg and did not return after scoring eight points in 25 minutes.\n\nThe Lakers improved to 11-18 on the season with Kuzma scoring 24 of his 38 points in the first half on nine-of-nine shooting.\n\nLos Angeles shot 47.1 percent overall and, after entering the game dead last in the NBA in three-point percentage, nailed 15 of 35 attempts from beyond the arc to keep the Rockets in check.\n\nThe Lakers played without starters Brook Lopez (ankle) and Kentavious Caldwell-Pope (personal reasons).\n\nKuzma got plenty of offensive help as a half dozen Lakers finished in double-digit scoring, including reserve forward Corey Brewer who had a season-high 21 points.\n\nBrewer was shipped by the Rockets to Los Angeles at the trading deadline last February.\n\nBrewer sparked the decisive run with a nifty layup at the 7:04 mark of the fourth quarter to break a 100-100 tie.\n\nThe Lakers stretched that lead to 10 points before the Rockets could muster a reply that fell short.\n\nRookie guard Lonzo Ball added 16 points and 9 rebounds while Larry Nanc","The Rain or Shine Elasto Painters open their 2018 PBA Philippine Cup with a victory\n\nMANILA, Philippines (UPDATED) – The Rain or Shine Elasto Painters had just enough gas left in the tank as they eked out an 82-79 win over the TNT KaTropa to open their 2018 PBA Philippine Cup campaign at the Cuneta Astrodome in Pasay City on Friday, December 22.\n\nRain or Shine held a 6-point lead with 35 seconds to go following Maverick Ahanmisi's free throws, 82-76, before Kelly Williams buried a rare triple with 24.1 ticks to go to keep the KaTropa within striking distance, 79-82.\n\nThe game looked like it was for TNT to win after Ryan Reyes stole the ball from Raymond Almazan with 19 seconds to go, giving the last possession to the KaTropa for a potential game-tying bucket.\n\nBut Almazan made up for his late-game blunder by forcing Jayson Castro to pass his supposed 3-point attempt to Williams, who then airballed his last second shot from deep.\n\nBeau Belga paced the Elasto Painters with 14 points and 5 boards while Almazan had 11 markers, 10 rebounds, and 3 blocks. Chris Tiu added 12 points.\n\n\"Ang dami pa ring lapses but the team will get better,\" said Rain or Shine head coach Caloy Garcia of his wards, who allowed TNT to have 32 offensive boards which it used to score 25 second chance points.\n\nTrailing by 7 points midway the fourth period, 59-66, the KaTropa took the lead of a 9-0 spurt sparked by an Anthony Semerad trey. But it was not long until the Elastopainters regained the upper hand behind a 10-0 run, highlighted by back-to-back triples from Belga and Ed Daquioag, 76-68.\n\nCastro was impressive for TNT as he flirted with a triple-double with 18 points, 10 assists and 9 rebounds while Roger Pogoy had a double-double of 16 markers and 10 boards.","MANILA, Philippines — It's an understatement to say that Ben Mbala made a splash in the UAAP.\n\nHeck, he cast waves big enough to tip the whole ship and made sure the league will never be the same.\n\nTwo years of residency and an additional year of ban were all worth it as the Cameroonian led La Salle to a UAAP championship in Season 79.\n\nHis rare mix of height, speed and agility proved too much for the league and earned him two MVP plums.\n\nWe'll surely miss the big guy now that he skipped his last season and decided to suit up in Mexico.\n\nFor one, his monster of a slam last season will always be remembered as one of the best plays in UAAP history.\n\nEnjoy this seven-minute and two seasons worth of highlights from Mbala.\n\nWe wish you well in your future endeavors, Ben!","THE Department of Education-Division of Negros Occidental conducted a workshop-conference at the Goldenfield Kundutel Hotel in Bacolod City, Dec. 21, 2017 as part of their preparation for the 2018 Western Visayas Regional Athletic Association (WVRAA) meet.\n\nThe conference aims to assist coaches, education program supervisors, and provincial screening and accreditation committee members in the orderly and firm compliance with documentary requirements of the games.\n\nIt also intends to prepare student-athletes for the regional competition after two years of separation from Western Visayas with the formation of the defunct Negros Island Region.\n\nIn 2015 and 2016, Negros Occidental mounted its Palarong Panlalawigan and Palarong Negros Island Region where they competed against Negros Oriental.\n\nBut Negros Occ. reverted to Western Visayas with the dissolution of NIR in 2017.","IT’S been almost two months since Barangay Ginebra won the PBA Governors’ Cup before a record crowd \n\nat the Philippine Arena.\n\nThe Gin Kings will return to the same sprawling venue in Bocaue, Bulacan as they launch their \n\ncampaign in the Philippine Cup, the league’s most prestigious conference which has been elusive to \n\nthe league’s most popular ballclub in the last 10 years.\n\n     \n\nPlaying the Gin Kings are the Magnolia Hotshots, who will gun for either solo or share of the \n\nearly lead in the kick-off conference which is crown jewel of a season in the league that’s slowly \n\ngetting stability after an impasse.\n\n \n\nThey maybe sister teams but a game between them has always been expected by the fans — albeit \n\non the most wanted holiday of the year. \n\n    \n\nIt will be the 11th year that the Gin Kings will play on Christmas but their fourth time to \n\nhave the Hotshots as their opponents. The Gin Kings won all their previous meetings with the \n\nHotshots.\n\n    \n\n“It’s always a tough challenge playing on Christmas Day because of all the holiday \n\ndistractions, but it is always an honor to play it as well,” said Ginebra coach Tim Cone in a text \n\nmessage to People’s  yesterday.\n\n    \n\nDistractions are not the only concern that’s worrying Cone. He is worried too by the fact \n\nthat they started their preparations for the All-Filipino Conference just recently.\n\n    \n\n“We were actually the last one to return to practice after the break, so we’re a bit behind \n\nother teams, but despite that, I feel our guys really worked hard in the time we had and they are \n\nready,” said Cone.\n\n    \n\nGinebra will also set out for the 5:15 p.m. main offering of a double-header without Joe \n\nDevance, Sol Mercado and Arthur dela Cruz, and without them, Cone said the coaching staff has been \n\nscrambling a bit in determining the players’ roles.\n\n \n\nNevertheless, he said he was impressed with what he saw during practice.\n\n    \n\n“I like what I’ve seen in practice, but let’s see if that tr","AFTER Mariane Sotomil, 17-year-old discus thrower Franz Gela Bintad of Bacolod Tay Tung High School is also getting into the radar of University of the Philippines (UP) Maroons.\n\nIn a communication shared, the Thunderbolts and Maroons are expected early next year to discuss details about Bintad and Sotomil.\n\nBintad will be donning Negros Occidental colors in the next year’s Western Visayas Regional Athletic Association Meet after winning the gold medal in the secondary girls’ discus throw event of the 2017 Palarong Panlalawigan.\n\nShe also finished with a bronze during the last Palarong Pambansa in Antique behind National Capital Region’s gold and silver medalists Kasandra Alcantara and Daniella Daytona.\n\nJose Montalbo, vice chairman for Bacolod Tay Tung Sports Development Committee, said that aside from these latest names, Tay Tung has already sent a number of athletes to the University Athletic Association of the Philippines (UAAP) like Ateneo de Manila University and De La Salle University.\n\n“Some of them have already graduated from college while others are soon to graduate,” he said. (HGD)","NEGROS Occidental booters edged Iloilo, 2-1 at the end of elimination round for the 1st Governor’s Cup Regional Invitational U15 Football Championship which kicked off Tuesday at the Iloilo Sports Complex in Iloilo City.\n\nReuben Allen Liamsing scored all goals for the Negrense side in the fourth and 19th minutes to lift the Negrenses against the host who got their lone goal from Rolf Alminaza in the 76th minute.\n\nAs of press time, Negros Occidental is taking Aklan in the first semi-final match as Iloilo faces Capiz in the other scheduled face-off en route the finals.\n\nNegOcc demolished Aklan in the opener with a 12-0 blast behind Joshua Limco’s 4 goals in the 42’, 44’, 49’ and 66’ while Liansing, Chyle Miraflores and Jonan Lozada added two goals each as Raven Mesina and Ram Treyes got one apiece.\n\nIloilo also dumped Capiz in their initial face-off, 15-0 on Christian Talamor’s hat-trick (13’, 14’ and 31’) as Konrad Keim Sollorin, Zymone Binas and RJ Pescadera delivered pair of goals while Khent Brian Valenzuela, Nhelvin Solen Leonora, Archie John Belluga, Alminaza, Justin Clavaton and Joshmar Sornito scored one each.\n\nThis regional football invitational serves as gauge of how the forthcoming 2018 Western Visayas Regional Athletic Association Meet will be.","MANILA, Philippines — Nineteen pairs, led by the father-son tandem of Eddie and Leandro Bagtas and siblings Nikki and Sam Bruce, head the early roster of teams vying for the seventh National Doubles Amateur Golf Championship slated Dec. 27-29 at Camp Aguinaldo Golf Club in Quezon City.\n\nThe three-day event, organized and conducted by the National Golf Association of the Philippines, will keep the country’s leading and rising players in form and shape during the holidays as they gear up for the Philippine Amateur Golf Championship set Jan. 4-7 at Riviera’s Golf Club’s Couples course in Silang, Cavite.\n\nMany-time national champion Rupert Zaragosa is also in the fold, teaming up with Adrian Romero, while club bet Harmie Constantino hopes to cash in on her local knowledge as she partners with Joseph Orbito in the event sponsored by the MVP Sports Foundation.\n\nFormat is four-ball (best ball) in the first day and the aggregate format in the next before play shifts to two-ball foursome (alternate shot) in the final round.\n\nListup ends at 5 p.m. today. For registration, call NGAP at telefax (02) 706-5926 or Camp Aguinaldo Golf Club at (02) 913-2750 or email ngap2009handicap@yahoo.com or visit www.ngaponline.net or  competing in the premier Group I side of the tournament serving as part of the PLDT Group National Amateur Golf Tour, are Aldo Barro-Paqo Barro, Dan Cruz-Luis Guerrero, Santino Diokno-Miguel Roque, Carlo Gatmaytan-Rocky Brobio, Annika Guangko-David Guangko;\n\nMeanwhile, Pierre Ticzon and Allan Crisostomo banner the Group II (handicap of 4.1 and above) cast that includes Guilbert Purcia IV and Guilbert Purcia Sr., Rald Sarmiento and Masaichi Otake, and Jose Wenceslao and Lido De Guzman.","CLOUD NINE, General Luna, Siargao Island ( / 28 Sept) – With less than a point lead against his tough opponent, Raoni Monteiro of Brazil has been crowned the champion of the 2017 Siargao International Surfing Cup.\n\nThe former elite Championship Tour competitor Monteiro came up against Costa Rica’s Thomas King in the final.\n\nThe lead went back and forth between the two throughout the 35-minute final duel with King holding the lead score into the last minutes.\n\nKing maintained his momentum with a lead at 7.17 points in the dying seconds, but Monteiro made a last-ditch strike from a medium set wave with a score of 8.03, giving him the win with a heat total of 17.06.\n\nKing, who garnered a total heat score of 16.33 points, attempted to rally against Monteiro but the clock expired.\n\n“I’m super stoked. I can’t believe that I will win this event. I can’t even explain how happy I am right now,” said the 35-year-old champion who is a surf coach in Brazil.\n\n“Right at the end when I saw that wave come I knew it as the one and I knew I could do it. This has been a really amazing event for me. It is my first time here in the Philippines and the waves are so good, we have all been really spoiled with the waves we got and everyone was ripping so I feel really lucky to come out on top,” Monteiro added.\n\nMonteiro was off in the league in 2010 after he suffered knee injuries and took some time to focus on family and spent his time at home.\n\nHe said his last competition was sometime in 2010.\n\nThis year he has returned to competitive surfing arena and is determined to return to the elite level. This win not only gives him 3,000 raking points but the confidence to know he can still mix it with the best and win events – a feat he last accomplished at the prestigious Vans World Cup at Sunset Beach in 2010 in Hawaii, USA.\n\n“The last event I won was Sunset so it has been a while since I had this feeling,” Monteiro, who takes home the prize of $12,000, continued.\n\n“I have been workin","Tehillah Mag-aso braved the chilly weather and fought off the onset of fever to claim a silver medal in the recent Asian Junior Finswimming Competition in Yantai, China.\n\nThe 15-year-old, bothered by tonsillitis throughout the trip, placed second after finishing the 1500-meter race in 15 minutes and 41 seconds.\n\nMag-aso was 35 seconds slower than gold medalist Hu Yu Tieh of Chinese Taipei.\n\nJelahlou Mendoza added a bronze medal to the Philippine collection by checking in third in the 800m (7:40) behind China’s Li Jiayi (7:07) and Vietnam’s Pham Thi Kim (7:21).\n\n“We controlled Tehillah’s tonsillitis by letting her gargle ginger lemon water and massaging her with eucalyptus oil,” said Reyes.","Raymar Jose was truly feeling the nerves in his first PBA game on Friday that it even showed on his game, hilariously air-balling his free throw midway in the second quarter.\n\n“I was excited,” he said in Filipino as he tried to hide his embarrassment from his gaffe. “This is my first game and I’m surprised that happened.”\n\nLuckily, that wasn’t the case in his second freebie–which he swosshed–and for for his next shots, giving him the confidence he needed to deliver for Blackwater.\n\nThe third overall pick in the 2017 PBA Rookie Draft lived up to his billing as he paced the Elite with 16 points, six rebounds, and two assists in his pro debut.\n\nUnfortunately, that smashing first game went for naught as Blackwater fell to Meralco, 103-98, at Cuneta Astrodome in Pasay.\n\nJose, however, isn’t dwelling much on the loss and shared his optimism when talking about the youthful Elite frontline of him, Mac Belo, and JP Erram forming an intriguing three-man combo in the paint.\n\nBut he admits that there’s still a lot of ground for the newly-formed trio to cover, saying, “Hopefully, we can improve ourselves as a team and we continue working hard.”\n\n“What we did wasn’t enough and we haven’t proven anything yet. We still need to be one and we can still develop a lot of things as a unit.”\n\nErram notched a double-double in the season opener with 11 points, 10 rebounds, and three blocks, while Belo collected 13 markers, a rebound, and an assist in the game.\n\nJose is unfazed by his new team’s bad start in the 2018 PBA Philippine Cup as he keeps a positive vibe and looked at the good things Blackwater did in the game.\n\n“The mindset is the same: when coach puts me in, I’m always ready to do what he asks me to do and to execute our plays. I admit that I was excited and I’m still adjusting, but hopefully next game, I’m already okay,” he said.","CEBU, Philippines — The Cebu commercial basketball scene makes a big comeback with the staging of the Cebu City Sinulog Cup 2018 Basketball Invitational on January 8-13 at the Cebu Coliseum. This was bared by Councilor Jerry Guardo, Chairman of the Committee of Youth and Sports and head of the tournament’s organizing committee at a press gathering at Yayoy’s Grill yesterday.\n\nLeading the teams is PBA D-League team Marinerong Pilipino which will be fielding its new recruits in Alvin Pasaol, Vince Tolentino, and Abu Tratter. They will face the challenge of local teams led by UV-SRG/ARQ Builders, UC/M. Lhuillier, Cebu Landmasters and University of San Jose Recoletos.\n\nGuardo said the re-launch of the tournament was in reply to the call to revive the amateur basketball scene that has been silent for a long time now. “This gives us the opportunity to revive the local basketball league in Cebu City,” Guardo said. He added that this has the full support of the Cebu City Sports Commission and the City Council, and will be the first of a series of tournaments for 2018. “This is just the launch and everything will follow suit,” he added.\n\nJoining Guardo at the press conference were Cebu City Sports Commission Chairman Ed Hayco and Deputy Mayor for Sports Jun Gabuya.\n\nAll teams are expected to strengthen their sides as the tournament is open and will also feature imports. Marinerong Pilipino is considered as the pre-tourney favorite as it prepares for the upcoming PBA D-League games. Leading the team is head coach Koy Banal. However, the local teams will be up to the challenge to defend their turf. (FREEMAN)","This is about more than just the silverware and intra-Visayan bragging rights\n\nLivestream to be announced soon.\n\nAfter 7 months of grueling competition, the Philippines' first-ever fully professional nationwide football league will come to a close this Saturday, December 16. Ceres and Global, two of the most decorated Pinoy clubs in recent history, will lock horns for the inaugural title.\n\nThe Busmen defeated Kaya 3-1 over two semifinal legs, while Global bucked a lower seeding to topple FC Meralco Manila in their semis via a 3-2 scoreline. The final is one game for all the marbles.\n\nLet's take a look at the various subplots and talking points of what promises to be an epic final match.\n\nThis will be the second year in a row that the two sides will play in a final match. Last April Global defeated Ceres 3-1 in the UFL Cup final. That match was testy, physical and controversial encounter, with a Daisuke Sato handball not being called late in the game with Global leading 2-0. Misagh Bahadoran put Global ahead for good moments later in what essentially was a two-goal swing. Watch here.\n\nCeres players were so angry at the refereeing that the main ref had to be escorted off the pitch by other match officials.\n\nGlobal went on to capture the league as well and play in the AFC Cup this year. Ceres, on the other hand, retooled and recharged, with signings like Iain Ramsay and OJ Porteria.\n\nIn this maiden PFL season the teams played 4 times, with Ceres and Global with two wins each.\n\nThere are scores to be settled, no doubt.\n\nStephan Schrock, after a brief spell back in Germany, came back to Bacolod as a proper Ceres player, not just a loanee. He has been scoring goals aplenty all season long, but none bigger than this last-gasp gem against Kaya in the first leg. Watch as the former Azkal makes training cones out of the Makati defense.\n\nThe Busmen are missing striker Fernando Rodriguez and midfield point guard Manny Ott with long-term injuries, but the other Spanish goalscore","The Rockets lose two games in a row against the teams of Los Angeles\n\nLOS ANGELES, USA – James Harden delivered another dynamic performance with his second straight 51-point outing but once again it wasn't enough as the Houston Rockets lost 128-118 to the Los Angeles Clippers on Friday, December 22 (Saturday Manila time).\n\nThe Clippers came on in the second half to offset the heroics of guard Harden, who equalled his points total from Wednesday's 122-116 loss to the Los Angeles Lakers.\n\nHarden finished 15-of-28 from the floor and 15-of-16 from the free-throw line while contributing 8 assists in front of a crowd of 18,000 at the Rockets' Toyota Center arena.\n\nOn Wednesday, Harden scored 51 in 43 minutes of playing time – and Friday he did it in 41 minutes.\n\nAustin Rivers caught fire in the second half and, with some help from Lou Williams, shot the Clippers to victory.\n\nRivers scored 30 of his team-high 36 points on 10-of-18 shooting in the second half, drilling 5 of 10 3-pointers down the stretch to keep the Rockets off guard.\n\nWilliams, traded by Houston in the offseason as part of the blockbuster Chris Paul deal, scored 32 points.\n\nEric Gordon chipped in 28 points for Houston, which closed a season-long 7-game homestand with consecutive losses to the Los Angeles teams.\n\nElsewhere, the Brooklyn Nets started quickly, played aggressively and dominated on defense en route to a 119-84 wire-to-wire victory over the struggling Washington Wizards on Friday night.\n\nThe Nets used a balanced offensive attack as half a dozen players scored in double figures – including Rondae Hollis-Jefferson who tallied 21 points, 11 rebounds and 6 assists and swingman Caris LeVert who finished with 17 points and 6 rebounds.\n\n\"We just sustained it, stayed focused, locked in on defensive principles, locked in on guys we needed to stop, limited them to what they do best,\" Brooklyn guard Allen Crabbe said.\n\nBrooklyn ended a 4-game losing skid with its second home win over Washington in 10 days.","'This is a learning experience. You cannot learn by only winning, you also have to learn by losing,' says DLSU big man and UAAP back-to-back MVP Ben Mbala\n\nMANILA, Philippines – De La Salle University was the obvious favorite to win the title in the UAAP men’s basketball this year.\n\nThe Green Archers were coming off a sweep in the finals last season over archrivals Ateneo de Manila University and they still had the strongest lineup in league, at least on paper, despite losing Jeron Teng.\n\nWith reigning Most Valuable Player Ben Mbala expected to run over the league again and behind a program led by a coach who has won two collegiate titles with two different teams in just his first year at the helm, La Salle was at the forefront of the UAAP race. A championship in the BLIA Cup in Taiwan last August where they faced teams from China, France and the United States was proof.\n\nBut things went downhill since then. A few weeks after winning the title in Taiwan, the Green Archers were at the headlines for the wrong reasons following a bench-clearing brawl against the Far Eastern University Tamaraws in a pre-season game in Davao.\n\nA few weeks passed again and they lost to the University of the Philippines Fighting Maroons, 87-98, midway the first round. To be fair, the Fighting Maroons were highly competitive heading into Season 80 but no one anticipated them to defeat the Green Archers, much more win by double digits.\n\nNow, people had speculations if La Salle was imploding. Then the speculations grew louder after reports surfaced that there was a rift between players and bosses from La Salle were unsatisfied with how head coach Aldin Ayo handled his wards.\n\n“We were not able to handle very well our championship last season. I don’t want to expound on that. Medyo maselan eh. We were not able to handle really well our championship. Worried ako how we started our season. Siyempre, being the head coach, I’m accountable for everything that happened,” said Ayo.\n\nFast forward to t","“I hope we correct those things to be able to contend this season,” sabi ni TNT Katropa head coach Nash Racela, muling aasa kina Jayson Castro, RR Pogoy, Kelly Williams, Troy Rosario at Moala Tautuaa.\n\nIpaparada din ng Tropang Texters sina rookies Mark Tallo, Monbert Arong at Sydney Onwubere at sina Alex Nuyles, Frank Golla at Norbert Torres.\n\n“We’re already happy with what we have. We’re happy that we’re loaded with guards because teams like Phoenix and Alaska will really test our ball handling with their press,” ani Garcia.\n\nSa unang laro, naniniwala si one-time PBA Grand Slam champion coach Norman Black ng Bolts na matatakpan nina Nico Salva, Nino Canaleta, Jason Ballesteros at Mac Baracael ang butas na iniwan ng mga may injury na sina big men Ranidel De Ocampo, Cliff Hodge at Reynel Hugnatan. (RC)","MANILA, Philippines — Satisfaction with President Rodrigo Duterte significantly recovered in the last three months of 2017 after his rating fell to the lowest of his presidency in the third quarter, a Social Weather Stations survey released Friday found.\n\nIn the fourth quarter, net satisfaction, used by SWS as a rating of the president’s performance, jumped to +58, classified as “very good” in the survey of 1,200 Filipinos conducted from December 8 to 16.\n\nThat was 10 points above the “good” +48 in the third quarter, which saw an 18-point drop in the hugely popular leader’s satisfaction score following the death of a minor in his deadly drug war and allegations of hidden wealth.\n\n\"It's probably the success in the Marawi siege. And as always it's the economy,\" former Ateneo school of government dean Tony La Viña said.\n\n\"As long as people feel they are doing well, they give high scores to the government,\" he added.\n\nAmong the news items when the fourth quarter poll was conducted were the end of the security crisis in the principal Islamic city of Marawi — which was stormed by heavily-armed, homegrown extremists who pledged allegiance to ISIS.\n\nAlso in the news was Congress’ swift approval of an extension to Duterte’s martial law powers across Mindanao for another year to defeat jihadist militants and communist fighters operating there.\n\nThe Philippine economy also grew faster than expected in the third quarter, putting the country on track to meet its full-year target, data released by the government last November showed.\n\nNoting the drastic decline in the president's net satisfaction rating in the third quarter, for Ramon Casiple, executive director at the Institute for Political and Electoral Reform, the fourth quarter result \"proved that the downtrend is wrong.\"\n\nMeanwhile, SWS attributed the improvement in Duterte’s rating to sharp increases in all areas, with gains recorded in Balance Luzon (14 points), Metro Manila (11 points), Visayas (10 points) and Mindanao (","Blackwater may have lost its season debut last week, but forward Allein Maliksi feels the Elite can be a contender this season if they focus on playing consistently in the PBA Philippine Cup.\n\nThe team handled by coach Leo Isaac fell short on their comeback bid, dropping a heartbreaking 103-98 loss to the Meralco Bolts last Friday at the Cuneta Astrodome in Pasay City. Maliksi and rookie forward Reymar Jose led Blackwater with 16 points apiece.\n\nDespite the setback, Maliksi said they should learn from the mistakes they made during the game as they prepare against Rain or Shine this Friday at Astrodome.\n\n“We fought hard, that’s the good thing. Unfortunately, we fell short,” said Maliksi. “We still need to make adjustments on the things the coaching staff wants us to do. May mga mali na puwede naman kami matuto at may maganda din naman.”\n\nOne of the good things that Maliksi pointed out is the addition of the 6-foot-5 Jose, the No. 3 overall pick during the last PBA Rookie Draft.\n\nA product of Far Easter University and a meer of Gilas Pilipinas, Jose provided additional firepower to Blackwater’s offense and muscle on the team’s interior defense with six rebounds.\n\n“Sa tingin ko isa talaga siya sa maasahan ng team. He’s a rookie, but the way he performed parang beterano na siya. From inside and outside ang laro niya e, so we expect him na mag-contribute sa mga susunod pang games,” said Maliksi.\n\nAside from the addition of Jose, the team has also reactivated sophomore forward Mac Belo, who missed several games in the previous Governors’ Cup due to a knee injury. Belo, Jose and JP Erram give Blackwater a formidable young frontline, and Maliksi said once the trio plays consistent, they’ll be a force to reckon with in the PBA.\n\nAgainst the Bolts, however, the three coined for 14-of-34 shooting from the field. Overall, the team converted 35-of-93 (37 percent), while allowing Meralco to shoot 36-of-86 (45 percent). New addition KG Caneleta fired 25 points as he buried 5-o","TNT beat Rain or Shine across the board in their match-up to start the 2018 Philippine Cup.\n\nThe KaTropa made more field goals, won the rebounding battle by a mile, had more assists, committed less turnovers and fouls, and had more combined steals and blocks.\n\nHowever, the Elasto Painters had them beat where it actually counts: total points scored.\n\nThat is something that absolutey baffled TNT ace Jayson Castro and for good reason.\n\nHow in the world do you lose a game if you win across the board in all major statistical categories?\n\nOne major spot TNT can correct as the season goes is field goal shooting. The KaTropa shot 102 times Friday, making only 31.\n\nFor a team that is supposed to have a rather potent offense, shooting 30 percent from the field is simply not acceptable.\n\n\"Siguro kung pansin niyo rin, sobrang sama ng outside shots namin. Yun, kailangan naming i-work ‘yon, at ma-execute yung mga plays naming bago,\" Castro said.\n\nTNT shot a total of 35 percent from inside the arc and missed a total of 30 three-point shots.\n\nOh, and the KaTropa also bricked 10 free throws.\n\nIn comparison, the Elasto Painters shot 36 percent from the field, also bad but good enough, and made 12-of-17 freebies.\n\n\"Ah yes isa pa yon. Ang dami naming na-miss,\" Castro said on his team's free thros.\n\n\"And siguro, yun nga, outside shots namin. Binibigay na nga ng Rain or Shine eh. Next game siguro, sana pumasok na,\" he added.","Metro Manila (CNN Philippines, December 22) — Two-time UAAP Most Valuable Player Ben Mbala will no longer suit up for the De La Salle Green Archers next season.\n\nMbala, who played for two years for the Green Archers, confirmed his departure from the Taft-based squad in a Twitter post.\n\nThe Cameroonian led the Green Archers in capturing the Season 79 crown in 2016, and finishing runner-up in this year's tournament.\n\n\"It is with a heavy heart that I announce that the time has come for me to move on from De La Salle University and the Green Archers,\" Mbala said.\n\nMbala said he is aware that his decision \"might come as a surprise to many.\"\n\nIn an interview with CNN Philippines Sports Desk, Mbala reiterated that his decision is already final.\n\n\"The decision to leave was the toughest I have had to make after being with La Salle for so many years, but I feel that this decision is best for the next stage in my career and development,\" he added.\n\nIn an Instagram post, Mexican ball club Fuerza Regia announced that they have acquired the services of Mbala Fuerza Regia plays in Mexico's professional league.\n\nMbala averaged 26.0 points 13.1 rebounds and 2.5 blocks in Season 80 of the UAAP.","Bocaue, Bulacan (CNN Philippines, December 25) — The NLEX Road Warriors went home with all the Christmas cheer after downing the GlobalPort Batang Pier, 115-104, in the Philippine Basketball Association (PBA) Philippine Cup on Monday at the Philippine Arena.\n\nRookie Kiefer Ravena continued his hot start in the league with a 20-point outing, while JR Quinahan tacked on 19 markers of his own.\n\nAfter a hard fought opening frame, which saw the two teams knotted up at 25 points apiece, the Road Warriors let loose a 13-3 rally in the second quarter.\n\nBefore the halftime break NLEX was able to erect a lead as much as 41-31, after an Alex Mallari triple.\n\nThe Batang Pier would battle back to give themselves a chance in the payoff period, coming within 99-95 with 4:22 left to play.\n\nWith GlobalPort breathing down their neck the Road Warriors turned to Ravena in the clutch, who drained a dagger triple to give NLEX an unassailable 109-98 cushion to seal the win.\n\nIt was a tough Christmas day win for the Road Warriors, who improved their record to 2-0 in the Philippine Cup.\n\n\"We just gave ourselves and our supporters a really nice Christmas gift,\" said NLEX head coach Yeng Guiao.\n\nGuiao went on to discuss how fortunate his side was that Terrence Romeo was not available for GlobalPort.\n\n\"Just with Stanley Pringle, we had a handful,\" Guiao admitted. \"It's difficult to devise a way of defending Pringle, what more kung nandyan pa si Terrence.\"\n\nStanley Pringle topscored GlobalPort with 33 points in the losing effort.\n\nNLEX look to continue their perfect start on January 7 against the Phoenix Fuel Masters, while GlobalPort will look for their first win against Ginebra on that same day at the Smart Araneta Coliseum.","CLEVELAND — LeBron James scored 34 points, Kevin Love added 27 and the Cleveland Cavaliers won their 12th straight home game, 115-112, over the Chicago Bulls on Thursday night (Friday Manila time) as injured point guard Isaiah Thomas moved even closer to his return.\n\nJames had 11 points in the fourth quarter and dropped a pair of free throws with 11.1 seconds left as the Cavs won for the 19th time in 21 games and ended Chicago's seven-game winning streak.\n\nWith Cleveland's Jae Crowder guarding him closely, Chicago's Denzel Valentine was short with a tying 3-pointer in the final second. Rookie Lauri Markkanen scored 25 points for the Bulls.\n\nCavs coach Tyronn Lue missed the game with an undisclosed illness. Assistant coach Larry Drew filled in for Lue, who conducted his usual media session about 90 minutes before tip-off and was in Cleveland's locker room before the team announced he was sick.","Koy Banal had ended San Beda's 28-year title drought, and he wants the shot to end UE's 31-year title drought too\n\nMANILA, Philippines - Can Koy Banal be the one to snap the University of the East Red Warriors’ 31-year title drought? Banal certainly thinks so.\n\nIn an interview with ABS-CBN Sports, the current head coach of Marinerong Pilipino PBA D-League squad has thrown in his name for consideration. “I’ve submitted my application to them,” he said.\n\n“UE is on a 31-year title drought. I’ve done it with San Beda after a 28-year title drought,” said Banal, a former UAAP and NCAA champion head coach. “I know what to do and how to do it.”\n\nIf hired, Banal’s entry to UE gives not one, but two benefits to the struggling program. One, his championship mettle may be key to reviving UE’s championship pedigree. After all, UE is still tied with the University of Santo Tomas (UST) for the second-most UAAP men’s basketball championships at 18.\n\nTwo, as current Marinerong Pilipino head coach, Banal will get to spend time with prized UE star and Marinerong Pilipino’s 19th overall pick Alvin Pasaol, who has remained silent on whether he’ll return to the team after Derrick Pumaren resigned. Pasaol has formed a father-and-son-like bond with Pumaren, and Banal’s interaction with him will likely influence his decision to stay.\n\nBanal had led a young Arwind Santos to a title with Far Eastern University (FEU) in 2003 and received another in 2004 after De La Salle University (DLSU) was stripped of the honor due to a player eligibility scandal. He then led San Beda College in the NCAA to a title in his first full season in 2006, ending their drought. Even after his firing the very next year, San Beda completed a three-peat championship run from 2006-2008 and has since morphed into the title-collecting powerhouse it is today.\n\nHe has also tried his hand in professional basketball, serving as the chief tactician of the PBA’s Barako Bull Energy from 2014-2016 and the Phoenix Fuel Masters in","MANILA, Philippines — Two-time reigning UAAP MVP Ben Mbala has decided to spare La Salle from fighting to preserve his last year of varsity eligibility and is now playing for Fuerza Regia de Monterrey in the Mexican professional league LNBP (Lia Nacional de Baloncesto Profesional).\n\nMbala, 22, left Manila last Dec. 16 with a heavy heart. He had just recovered from a bout with dengue after leading La Salle to the UAAP Finals against Ateneo. Mbala, unsure about whether the UAAP Board will allow him to play his last year of eligibility, sought permission from La Salle’s benefactor San Miguel Corp. chairman Eduardo Cojuangco, Jr. to explore his options and received his blessings before leaving.\n\nCojuangco told Mbala that no matter what happens, his scholarship at La Salle will be waiting for him to earn his business management degree. An honor student, the Cameroonian said he hopes to eventually complete his studies and graduate from La Salle. He is about 60 units short of finishing up, roughly 1 1/2 years of classes.\n\nUAAP executive director Rebo Saguisag recently said the rule providing a seven-year eligibility limit from high school graduation will be reimposed next season after a two-year suspension. Unless the rule is repealed, Mbala would not be able to play his last year of UAAP eligibility. La Salle officials argued that reimposing the limit is discriminatory against Mbala because with the K-to-12 system, the rule has become academic.\n\n“They (the UAAP) don’t want me to play anymore,” said Mbala in tears. “They even questioned my MVP award, saying it is prejudicial to locals. I’ve spent the best years of my life in the Philippines and they treat me like someone who doesn’t deserve to play.” Since Mbala took his first MVP trophy last year, no foreign athlete had won the award in 36 years. The only other foreign MVP was FEU’s Anthony Williams in 1981. When Mbala bagged back-to-back MVP honors, detractors called for separate categories to distinguish locals from for","SILANG, Cavite, Philippines — Yupaporn Kawinpakorn bucked the wind and pulled away from Princess Superal after 10 holes then edged Chonlada Chayanun by two despite double-bogeys in the last two holes as Thailand dominated the ICTSI South Forbes Ladies Invitational at the South Forbes Golf Club here yesterday.\n\nTied with Superal after 36 holes, Kawinpakorn went 4-up with an even card after 10 holes as the local ace fumbled with two bogeys and a double-bogey and the Thai veteran bucked a shaky windup to card a 71 and beat Chayanun by two with a five-over 206 total for her second crown after winning the Philippine Ladies Open 10 years ago.\n\n“I knew I could win here because the course is short. But we had to deal with the wind that blew from all directions all tournament-long,” said Kawinpakorn, after receiving the top P150,000 purse from Philippine Golf Tour executive director Narlene Soriano during awards rites at the close of the record 11-stage Ladies PGT circuit.\n\nThree behind Kawinpakorn at the start of the final round, Chayanun fell by as many as seven shots after 16 holes but gained a three-shot swing with a birdie on No. 17. But she ran out of holes in her comeback bid, finishing with a 70 and pocketing P95,000 for second with a 208.\n\nIt was Chayanun’s second straight runner-up effort after a 1-2-3 romp by the Thais in the Philippine Ladies Masters won by Renuka Suksukont at The Country Club two weeks ago.\n\nAnd it was a sorry finish for Superal, who had hoped for a big windup after closing out her second round with three straight birdies to force a tie for the lead. But she failed to recover from a bogey-bogey miscue from No. 6 and a double-bogey mishap on the par-3 No. 10.\n\nShe dropped another stroke on No. 13, double bogeyed the 15th and wound up with a birdie-par-bogey finish for a 74, ending up third at 209 worth P60,000 in the event organized by Pilipinas Golf Tournaments, Inc.\n\nChihiro Ikeda, five behind Kawinpakorn after 36 holes, blew a one-under card a","MANILA, Philippines — A special committee made up of members of the PBA board is likely to be formed to lead the search for the next PBA chief who will succeed resigned commissioner Chito Narvasa.\n\nIf this is approved, the search committee will consider the credentials of possible aspirants and make a shortlist of candidates to be presented to the board.\n\nIn the proposed scheme, the two rival blocs which figured on the issue of Narvasa’s tenure will have representatives in the special committee.\n\nIt could be a three-man or five-man group.The would-be PBA commissioner will need a two-thirds vote (eight) to get an official mandate as the 10th chieftain of the league after Leo Prieto, Mariano Yenko, Rudy Salud, Rey Marquez, Jun Bernardino, Noli Eala, Sonny Barrios, Chito Salud and Narvasa.\n\nNarvasa is serving as league commissioner only until Dec. 31 then PBA external affairs and media bureau chief Willie Marcial takes over as officer-in-charge.\n\nA number of names have already been mentioned as possible candidates. Former Philippine Sports Commission board member Jolly Gomez is said to be one of those being considered for the job.\n\nNames also mentioned right after the board resolved their impasse were lawyers Ariel Magno, Rebo Saguisag and Charlie Cuna.\n\nThen there are Joel Banal, Chito Loyzaga and media man Bill Velasco.\n\nBanal is a former champion player and coach who has an MBA degree and runs a school in Pasig.\n\nLoyzaga is also a former champion player who had served as commissioner of the defunct Metropolitan Basketball Association and the PSC.\n\nVelasco, a Philippine STAR sports columnist, used to sit on the PBA TV panel and made a PBA documentary in 2015, with interviews of the most important figures in the first four decades of the league.","CLEVELAND — Isaiah Thomas is one big step closer to joining the Cavaliers.\n\nCleveland assigned the All-Star point guard to its Canton G-League team so he could practice and scrimmage with the Charge on Thursday (Friday in Manila), a significant development in his recovery from a torn labrum in his right hip. Thomas was scheduled to work out at the Cavs' training facility in Independence.\n\nOn Wednesday, Thomas said how his body responds from the stress of 5-on-5 scrimmages will determine how soon he'll be able to make his debut with Cleveland. He's been sidelined since aggravating a hip injury in the playoffs last season with the Boston Celtics.\n\nThe Cavs have said since October that they believed Thomas would be able to play in NBA games by Jan. 1. The 28-year-old was acquired during a hectic offseason in a trade for All-Star point guard Kyrie Irving. The Celtics sent Thomas, forward Jae Crowder, center Ante Zizic and a draft pick to Cleveland in the blockbuster deal.\n\nCleveland is eager to add him to the lineup, and LeBron James has sensed that Thomas is ready.\n\n\"Yeah, his attitude is getting worse and worse because he's getting closer and closer,\" James said following the team's morning shootaround before hosting the Chicago Bulls. \"When you get closer and closer to something you love and you want, your attitude actually gets worse.\"\n\nThomas, who averaged 28.9 points last season as one of the NBA's top playmakers, said he wants to be \"special\" when he returns to the floor and not \"just another body.\"\n\nAfter a slow start, the Cavaliers have won 18 of 20 and 11 straight at home. They'll visit the Golden State Warriors on Christmas and play at Sacramento and Utah next week before returning to Cleveland to face Portland on Jan. 2.\n\nThe next day, they'll play in Boston for their second matchup with Irving. This time, they might have Thomas on the floor.\n\n\"We're all excited for when he's able to come back to the team, but he's been around the team all year,\" James said.","MANILA, Philippines — TNT KaTropa and Meralco, two teams fancied as serious contenders as they barely missed nailing a crown last season, tangle with Rain or Shine and Blackwater, respectively, in the 2017-18 PBA Philippine Cup at the Cuneta Astrodome tonight.\n\nThe Bolts and the Elite clash at 4:15 p.m. then the Texters and the Elasto Painters collide at 7 p.m. in the third playdate of the season.\n\nIt will be followed by the much-awaited PBA Christmas Day showdown featuring Barangay Ginebra versus Magnolia and NLEX opposite GlobalPort at the Philippine Arena in Bocaue, Bulacan.\n\nThe Texters were the losing finalists versus the San Miguel Beermen in the last Commissioner’s Cup while the Bolts finished runner-up behind the Barangay Ginebra Kings in the recent Governors Cup.\n\nIn preparation for the new season, the Texters pitched an 11-day training camp in Lithuania highlighted by four matches against a Kazakh squad, the Lithuanian junior men’s team and two Lithuanian club teams.\n\nThe Bolts, meanwhile, tweaked their lineups, enlisting veteran players whom they hoped could help them match or improve their Governors Cup second-place windup.\n\n“We will open the year with four new faces and we are looking forward to being much competitive,” said Meralco coach Norman Black with new acquisitions in KG Canaleta, Mac Baracael, Nico Salva and Jason Ballesteros.\n\nMeralco, however, will be undermanned at the start of the season minus Ranidel de Ocampo and Cliff Hodge who are out because of injuries.\n\nRain or Shine and Blackwater are also both excited with their own prospects.\n\n“With only Rey Nambatac as new player, we will bank on familiarity. TNT is one of the teams to beat so it’s going to be a good test for us to start the conference,” said ROS coach Caloy Garcia.\n\n“We want to have a good start this conference. With that being said, we are going all out for a win versus Meralco,” said Blackwater coach Leo Isaac.\n\nThe E-Painters made the playoff round of all three conferences la","Japanese champion Ryoichi Taguchi believes movement will play a crucial role when he faces fellow titleholder Milan Melindo in their world light-flyweight unification fight on Dec. 31 in Tokyo.\n\n“The midrange is dangerous,” Taguchi (26-2-2 with 12 KOs)  told the Japan Times a few days ago after another intense workout a little over a week before he risks his World Boxing Association 108-lb crown.\n\nMelindo (37-2-2 with 13 KOs) is also staking his International Boxing Federation title in the scheduled 12-rounder at the New Ota City Gymnasium.\n\n“If I can move the way I’ve planned, I can win,” said Taguchi, who is also a right-hander like the Cebu-based Filipino.\n\nJapanese fight fans vividly remeer Melindo for his shocking first-round KO of Akira Yaegashi last May in Tokyo to win the IBF diadem.\n\nTaguchi, 31, feels he won’t allow Melindo to break the hearts of his countrymen when they square off on New Year’s Eve.\n\nMelindo is just one of threereigning Filipino world champions. The two others are ALA Boxing stablemate Donnie Nietes and IBF super-fly ruler Jerwin Ancajas.\n\nLike Taguchi, Melindo, 29, is neck-deep in training in the Queen City the past few weeks.\n\nTeam Melindo, also made up of chief trainer Edito Villamor and manager Michael Aldeguer, are heading to Tokyo tomorrow.\n\nKnown for his hard work, Melindo believes he will return home on New Year’s Day not only with the IBF belt strapped around his waist but with Taguchi’s head and WBA jewels stuffed inside his suitcase.","“Ms. Sandra Cam is now creating havoc at PCSO,” pahayag ni Balutan.\n\nBragging her moniker as whistleblower, Cam lashed out against her fellow officials at the agency in her daily program at a radio station (DWIZ) and gave interviews to televisions, other radio stations and newspapers by peddling confidential board documents not yet approved and authorized for public consumption by the board as a collegial body.\n\nSa kanyang radio program at panayam sa telebisyon, inakusahan ni Cam ang PCSO Board nina Corpuz, Balutan board member at dating Quezon City congressman Bong Suntay at dating Davao City village chief Marlon Balite na gasagawa ng magarbong Christmas party sa halagang P9 milyon.\n\n“We might be hitting up to P51 billion or it could be more this year as compared to only more than P37 billion in 2016. It’s all because we intensified our President’s battle against illegal numbers game. And I think that is one thing, particularly the STL, Sandra Cam wants to destroy in favor of a notorious gambling lord,” pahayag ni Balutan.\n\n“PCSO’s growth is historic high today under the new leadership,” aniya.","An ice sculpture sums up the new Tanduay Rum and Brooklyn Nets partnership.  (Photo by NYPCG)\n\nIn a major overseas deal, Tanduay Distillers, Inc. launched on March 12, 2017 at the 40/40 Club of Barclays Center a landmark partnership with the Barclays Center, one of the major multi-event arenas in the U.S. and NBA’s Brooklyn Nets team.\n\nThe partnership designates Tanduay Rum as the official rum of Barclays Center and the Brooklyn Nets.\n\nTanduay Rum will likewise be the presenting sponsor of the popular 40/40 Club and Restaurant located at the Barclays Center.\n\nIn addition, the deal also provides that Tanduay will be the Barclay Center’s associate sponsor for its Brooklyn Show platform and will be visible in strategic areas of the arena.\n\nThe new partnership will also have Asian-inspired cocktails mixed with Tanduay Rum and prepared by New York’s top mixologists in the arena’s bars.\n\nDuring the March 12 launch, Tanduay Rum was prominently presented in various commercial breaks and sponsorship imaging and signage at Barclays Center.\n\nA Tanduay commercial was likewise aired during the Brooklyn Nets versus New York Knicks game.\n\nOutbreak Media Group led by Mr. Michael Ang (2nd from left) and Consul General Theresa Dizon-de Vega (far right) at the launch of the Tanduay Rum-Barclays Center and Brooklyn Nets partnership at the 40/40 Club in New York.  (Photo by NYPCG)\n\nThe official post-game launch held at the 40/40 Club now renamed the 40/40 Club.\n\nPresented by Tanduay Rum was attended by marketing, culinary, business, entertainment and sports personalities.\n\nAlso in attendance were officials of the Brooklyn Nets, Barclays Center, National Basketball Association, Filipino-American community members, tastemakers and influencers.\n\nIn an interview during the launch, Consul General Theresa Dizon-de Vega noted that Tanduay’s new deal with Barclays and the Nets is a significant development for Philippine products attempting to capture the global market.\n\nThrough an innovative an","“I had no doubt whatsoever that he could make an impact, and he did. He’s going to be a special player in this league,” sabi ni Guiao kay Ravena, nagposte ng 18 points, 12 assists at 7 rebounds sa 119-115 panalo ng Road Warriors laban sa Kia Picanto noong Miyerkules.\n\nAng 6-foot-2 na anak ni dating PBA guard Bong Ravena ang nagbigay sa Ateneo Blue Eagles ng dalawang UAAP championship noong 2011 at 2012 at naging miyembro ng Gilas Cadets team na kumuha ng gold medal sa Southeast Asian Games noong 2011, 2013, 2015 at 2017.\n\n“He’s able to create his own shots, find his open teammates through more ball movement and that’s good for us,” ani Guiao sa 24-anyos na si Ravena.\n\n“Our style is to find the open guys with ball movement so he’s exactly what we’re looking for,” dagdag pa ng seven-time PBA champion coach.\n\nKung may PBA player mang maikukumpara si Guiao kay Ravena, ito ay sina two-time PBA Most Valuable Player Willie Miller at Magnolia combo guard Paul Lee.\n\n“Mahirap mag-isip ngayon, pero maybe it’s a combination of Paul Lee and Willie Miller,” pagkukumpara ni Guiao.","The trailer also shows the new season's launch date\n\nMANILA, Philippines – Fans of Netflix’s hit Marvel series Jessica Jones get a much-awaited peep at the show’s upcoming second season, which has everyone’s favorite bad-ass private investigator getting back to business in New York City.\n\nIt’s been two years since the first season ended, with Jessica snapping her tormentor Kilgrave’s neck, and seemingly leaving the crimefighting life for good.\n\nBut the new teaser shows Jessica back in the thick of the action, breaking down doors, taking surveillance photos, and beating up (presumable) baddies, which means she quickly realize that it’d be a waste of her superhuman strength to even attmept to live a normal life.\n\nDon’t go quoting Uncle Ben on her though. “If you say ‘with great power comes great responsibility,’ I swear, I’ll throw up on you,” she said, taking a dig at the cheesy Spiderman line.\n\nThe second season of Jessica Jones comes out on Netflix on March 8, 2018. – .com","As a basketball player, nothing beats a good revenge game to kick-start your new life.\n\nMANILA, Philippines - As a basketball player, nothing beats a good revenge game to kick-start your new life.\n\nFor new Miami Heat big man Kelly Olynyk, he couldn’t have picked a better time nor situation to break out as he erupted for a career-high 32 points with 6 three-pointers in his first game back in Boston. As a cherry on top, the Heat slipped past the first-seeded Celtics, 90-89, Wednesday, December 20 (Thursday Manila time).\n\nAlready missing team stars Hassan Whiteside and Goran Dragic due to injuries, the Heat trooped to the Celtics home court TD Garden possibly hoping that at the very least, they don’t get embarrassed on live television by the team which had the best regular season record in the Eastern Conference last season.\n\nInstead, Olynyk carried his new team on his back with the same shooting touch that endeared him to the fans in Beantown. Inadvertently, it was probably Boston itself that fired up Olynyk so much.\n\nIn a hilarious twist, at 11:28 am, Manila time, a Wikipedia user changed Olynyk’s Wikipedia picture to a goat, signifying that he’s the “Greatest Of All Time.” (G.O.A.T.)\n\nPrior to the game, it was announced that the 2013 13th overall pick would be receiving the “Heroes Among Us” Award from the Celtics organization. According to the Celtics page in the NBA website, Olynyk was chosen for the award “in celebration of the incredible impact that he had on the local community as an active, off-court citizen.” Usually, the team gives this award during timeouts to ordinary citizens who have gone above and beyond in service to the city.\n\n“I love this community and just everything the Celtics did,” Olynyk said Wednesday afternoon following Heat shootaround. “It was just fun, you know; fun to get out there with the kids, especially. This community does a lot for this team.\n\n“When I first got here, [the Celtics] weren’t very good at all, but [the community] support","Here are some of the most talked about local athletes and sports teams on 's social media accounts for this year\n\nMANILA, Philippines – From university athletics to international tournaments, 2017 has been a year full of highlights and emotions for Filipino sports fans. Ask any sports enthusiast and it will be very difficult for that person to pinpoint just one standout moment for the year.\n\nSocial media, however, can be a pretty good gauge in knowing which of the milestones caught the attention of our sports-loving readers. Netizens have utilized the different social networking sites – especially Twitter, Facebook, and Instagram – in showing their support for their favorite athletes.\n\nHere are some of the local athletes and sports teams who made waves on social media this year, based on 's most-engaged posts and stories:\n\nFilipinos celebrated on social media the moment marathoner Mary Joy Tabal delivered the Philippines its first gold medal in the 2017 Southeast Asian Games (SEA Games) in Kuala Lumpur, Malaysia.\n\nThe Philippines wrapped up the 2017 SEA Games with a medal tally of 24 golds, 33 silvers, and 64 bronzes for 6th place on the table. Despite crashing to its worst finish in the SEA Games since 1999, netizens still lauded the Filipino athletes, especially the podium finishers.\n\nSome of the notable SEA Games gold medalists from the country this year include 17-year-old Kaitlin De Guzman for gymnastics, double gold medalist Trenten Beram for athletics, the Philippine ice hockey team for winning the sport's first ever SEA Games gold, the Philippine lawn bowl team, Colin Syquia for equestrian, and light heavyweight boxer John Marvin for beating his Malaysian foe in just 21 seconds.\n\nThe Philippines is hosting the 30th Southeast Asian Games in 2019. (READ: Philippines makes U-turn, will host 2019 SEA Games)\n\nIt has been a busy year for the country's men's national basketball team.\n\nAside from winning the gold medal in this year's SEA Games, Gilas P","SPRINGFIELD, Massachusetts — Two-time NBA MVP Steve Nash, fellow star point guard Jason Kidd, Grant Hill and Ray Allen are among six first-year candidates for the Naismith Memorial Basketball Hall of Fame.\n\nThe Detroit Pistons backcourt of Chauncey Billups and Richard Hamilton also became eligible after the Hall changed its rules to allow players to reach the ballot after three years of retirement.\n\nThe candidates eligible for enshrinement in 2018 were announced Thursday (Friday Manila time) by the Hall on the anniversary of James Naismith’s invention of the game.\n\nCoaches on the ballot for the first time include Steve Fisher, who won a title at Michigan and later coached its Fab Five, and West Virginia’s Bob Huggins.\n\nThe women’s committee nominated former WNBA stars Becky Hammon, now a San Antonio Spurs assistant coach, as well as Tina Thompson and Katie Smith.\n\nFinalists from the North American and women’s committees will be announced at NBA All-Star weekend on Feb. 17 in Los Angeles. The entire class will be unveiled during the NCAA Final Four in San Antonio.","Editor’s note: The competitions were watched via the free livestreaming service of USA Weightlifting  AUSTRALIA (The Filipino Connection)—Hidilyn Diaz struggled in the snatch but came back quite strong in the clean and jerk to snatch silver and bronze medals in the 2017 World Weightlifting Championships.\n\nThe Filipina Olympic Games silver medallist and the rest of the field lifting in the US city of Anaheim in California also witnessed a new world champion in Sopita Tanasan of Thailand. Unfortunately, reigning Olympic champion Hsu-Shu Ching of Chinese-Taipei decided not to finish the competition after finishing second in the snatch.\n\nDiaz was second in the clean and jerk with 113kg., the same total posted by bronze winner Kristina Shermetova of Turkmenistan. Diaz hoisted 113kg. on her second attempt, as opposed to Shermetova on her third attempt.\n\nTanasan swept all three gold medals in the weight class: snatch, 96kg.; clean and jerk, 114kg.; total: 210kg.\n\nShermetova, a newbie in the weight class, was second overall with 204kg. and Diaz third with 199kg.\n\nA missed first attempt at 83 kg. and another botched attempt at 90 kgs. cost Diaz in the snatch. She ended up with 86 kgs., made on her second attempt. Diaz’s snatch lift landed her in sixth place.\n\nAt the clean and jerk, Diaz had to sidestep in her first and second attempts (110 and 113kg., respectively) in order to heave up the barbell.\n\nThe revelation of the weight class is 53 kg. returnee Tanasan. She showed power in all three snatch attempts and in her first two clean and jerk hoists —all standing still after the hoist, smiling radiantly.\n\nThe interesting thing with the 23-year-old Tanasan was that she dropped in weight —from 53 to 48kgs.— last year. That tactic made Tanasan win the gold medal in the 48kg. weight class at the 2016 Rio de Janeiro Olympic Games.\n\nDiaz moved down to 53 from her original class of 58kg., the latter weight class that landed the Zamboanga City native to the 2008 and 2012 Olympic Game","The Bolts are off to a good start in the Philippine Cup for a change after surviving the Blackwater Elite, 103-98, to start the 43rd PBA season Friday at the Cuneta Astrodome.\n\nUnloading a 19-0 run in the second half, the Bolts appeared to be on their way to an easy win before the Elite went on a late run.\n\nHowever, KG Canaleta would burn his former team, scoring Meralco's last five points, including a booming three off the glass with 11.3 seconds to go to, and his new team managed to hold on for the win.\n\n\"I thought we did a good job of recovering from a slow start today, especially in the first half. I thought Blackwater played very well, put a lot of pressure on us and forced us into a lot of turnovers,\" head coach Norman Black said.\n\n\"We did recover a little bit late in the second quarter and it carried over into the second half where we got off to a good start. But the energy that we spent trying to get that big lead really cost us down the stretch because we gave that lead up just as quickly as we got it,\" he added.\n\nThe Bolrs were down 12 in the second period, 27-39, before rallying to tie things up at the break.\n\nBlackwater was still ahead, 54-50, when the Bolts scored 19 unanswered points to take over the game in the third. The Bolts pushed their largest lead of the game to 19, 90-71, just before entering the final quarter.\n\nCanaleta scored 25 points for Meralco, 19 in the second half, built around five three-point shots. He also had eight rebounds for a great debut in a Bolts uniform.\n\nBaser Amer added 17 points, eight in the fourth, while Jared Dillinger also had a good game for Meralco, finishing with 15 markers.\n\nFor the Elite, Allein Maliksi and rookie Raymar Jose led the way, dropping 16 points apiece.","The Bolts survive Blackwater's 22-6 spurt in the fourth quarter\n\nMANILA, Philippines (UPDATED) – A clutch KG Canaleta triple saved Meralco from squandering a 19-point lead as the Bolts survived a late comeback scare from the Blackwater Elite,103-98, in their first game of the 2018 PBA Philippine Cup at the Cuneta Astrodome in Pasay City Friday, December 22.\n\nLeading 92-73 earlier in the fourth period following back-to-back triples from Baser Amer and Canaleta, it looked the Bolts were in for an easy victory. That was before the Elite unleashed a 22-6 spurt, with 10 points coming from rookie Raymar Jose, to close the gap and make things interesting, 95-98.\n\nFortunately for the Bolts, Canaleta, who played for Blackwater last season, buried a triple with 11.3 seconds remaining that gave Meralco a comfortable 101-95 lead.\n\nAllein Maliksi answered with his own trey with two seconds to go to keep Blackwater alive but the Elite ran out of time as Canaleta secured his free throws.\n\n\"I thought we did a good job of recovering from a slow start today, especially in the first half. I thought Blackwater played very well, put a lot of pressure on us and forced us into a lot of turnovers,\" said Meralco head coach Norman Black.\n\n\"It's a good start for us, considering it's the All-Filipino, it's nice to get off to a good start.\"\n\nCanaleta paced the Bolts with 25 points off 5 triples to go with 9 rebounds, two assists and two blocks while Baser Amer poured in 17 points, 12 assists and 5 boards. Jared Dillinger made his presence felt with 15 markers and 11 rebounds.\n\nBlackwater held a 54-50 lead early in the third quarter before the Bolts unleashed a 19-0 spurt, highlighted by 3 straight triples from Baser Amer, KG Canaleta and Jared Dillinger, to hold a comfortable 15-point advantage, 69-54.\n\nJose had a strong PBA debut despite the loss with 16 markers, 6 boards and two assists while Maliksi also had 16 points and 6 caroms. Roi Sumang added 15 points, 6 rebounds, 3 assists and two st","EIGHTEEN-YEAR-OLD Filipino-British James Halasan Ryan said the country's Junior Volcanoes team played well but struggled in the execution department in the recently-concluded Asia Rugby U19s Championships Division 1 held at the International School of Manila.\n\nUnited Kingdom-based Ryan, 18, reinforced the Junior Volcanoes team that lost to Malaysia, 19-36, in their bronze medal match.\n\n\"We did play pretty good intensity but we lacked execution, having only five days to work together whereas many other teams played months and months,\" Ryan said during the Davao Sportswriters Association (DSA) Forum held Thursday at Hukad Restaurant, SM City Davao.\n\nHe was thankful for the opportunity to come and play for the Philippines again.\n\nRyan, whose father Edward is a British scientist and mother Fe a Dabawenya nurse, added, \"The experience was quite the same as last year, very excited! We had lots of fun together.\"\n\nHe said that he already played with some of his current teammates in past junior Volcanoes teams although a few were newcomers.\n\n\"We already built friendship that really helped alot of times (in the game),\" he said, praising his teammates for the great games they played together despite the small time they spent training as a team.\n\nRyan took a flight from London to Manila by himself early this month to join the U19 Junior Volcanoes team's training camp set December 8 to 12. The Junior Volcanoes played December 13 and 16. He then arrived in Davao City to celebrate Christmas with his relatives from her mother's side. He is slated to return to his birth country by December 27 to welcome the New Year with his parents.\n\nHis U19 stint was the second time he suited up for the Junior Volcanoes this year. He also joined the U20 Junior Volcanoes team that competed in the U20 Asia Rugby Sevens Championships in Hong Kong last August.\n\nThe judo blackbelt also won gold medals and silvers for Davao City in Batang Pinoy regional and national judo and wrestling competitions in th","San Beda and Chiang Kai Shek College posted contrasting semifinal victories on Wednesday to forge a final showdown in the 6th PSSBC Dickies Underwear Cup held at SGS Stadium in Araneta Avenue in Quezon City.\n\nThe Red Cubs edged the National University Bullpups, 78-76, while the Blue Dragons routed the University of Visayas Baby Lancers, 91-60.\n\n“Our guys have been in that situation before and I’m just pleased that they were able to do what they’re supposed to be: Stay steady and composed,” said San Beda coach JB Sison.\n\nSan Beda stayed on track to regain the crown it last hoisted in 2014 in the tournament supported by Hapee Toothpaste, Blackwater, Freego Jeans, Poly Gloss, Rain or Shine, Che Lu Bar & Grill and MEC Computers.\n\nThe Blue Dragons, the 2015 titlists, leaned on John Galinato and Jason Celis to pull away early, 36-16, and never gave the Baby Lancers the chance to mount a rally.\n\nAt stake in the winner-take-all final are P50,000 in cash and a trophy.\n\nThe Red Cubs drew 15 points, 10 assists and nine rebounds from Evan Nelle.","MANILA, Philippines — Back-to-back Governors Cup titlist Barangay Ginebra finally makes its debut in PBA Season 43, bringing in its intact champion roster in tangling with old rival Magnolia in the mainer of a PBA Christmas Day presentation at the Philippine Arena in Bocaue, Bulacan.\n\nThe GlobalPort Batang Pier also play their first game in the season, clashing with the NLEX Road Warriors in the 3 p.m. curtain-raiser of a special bill tipped to draw a mammoth crowd.\n\nOver 30,000 fans trooped to the Philippine Arena in last year’s PBA Christmas Day Special also headlined by the keenly followed matchup between the Gin Kings and the Hotshots in what has been aptly billed “Manila Clasico.”\n\nWith their own star-studded, talent-laden lineup headed by twin behemoths Greg Slaughter and Japeth Aguilar, the Gin Kings are considered the biggest threat to the three-year reign of the San Miguel Beermen as Philippine Cup champs.\n\nBut as in all their previous tiffs, the Hotshots aren’t a bit intimidated. In fact, Magnolia coach Chito Victolero is upbeat of his wards’ chances.\n\n“We’re positive and optimistic. We’ll prepare to have the chemistry and teamwork to overcome their roster power advantage,” said Victolero.\n\n“If we can play as a team on both ends of the playing court, we’ll have a chance to beat them,” he added.\n\nPaul Lee made a rousing comeback from an injury and led the Hotshots to a 108-95 drubbing of the Alaska Milk Aces last Wednesday at The Arena in San Juan.\n\n“Mas mabigat nga lang ang Ginebra. They have the edge in our head-on matches,” said Victolero whose team ended on the losing end of the 2017 Christmas Day showdown between these two teams.\n\nThey later figured in a tough semifinals matchup, with the Gin Kings prevailing in the deciding Game Seven. The Kings also won their most recent tiff in the Governors Cup which Ginebra subsequently ruled on its conquest of Meralco in the finale.\n\n“We have to deal with Greg Slaughter and Japeth Aguilar inasmuch as we have to h","There is nothing flat in the New York City Marathon route; there is only an eternity of false flats, FIVE bridges that rise and stretch to no end and then you top it all with a small hill through Central Park that turns out to be the longest, quietest last FOUR miles of your run before you call on your remaining vive to sprint the last 200 meters or so through 125 flags of the world into a barrage of lights. camera flashes and thunderous cheer shouting the name emblazoned on your shirt. Thanks for the shirt, Doc Mike Munoz.\n\nThis was my most challenging World Marathon Major to date, after the predominantly flat courses of Berlin, Chicago and Tokyo. For one, it was my comeback marathon after 18 months of hiatus from long runs and only THREE months training. Secondly, I ran it with an MCL on the left knee complicated by osteoarthritis on both knees. Third, I’ve never ran under a continuous drizzle with cold winds the whole time making the entire route wet and my shoes wetter. At some point, i was concerned those arthritic knees would lock. Fourth, it’s the world’s largest marathon with 50,000 runners participating. Fifth, you start with these 50,000 runners on the very intimidating Verrazano-Narrows bridge from Staten Island, trying to shield your legs, your body, your fingers from the cold, biting wind while venturing to go straight through the throng of bodies up ahead, sticking to whatever remained of last year’s blue line (this year’s Blue Line Painting was cancelled for security reasons). You go through THREE more bridges in silence as there are no cheering crowds to push you on and then trudge ever so slowly up the kilometer or so long Queensboro bridge on 59th. You actually “slow down, (you) and don’t move too fast” to paraphrase Simon and Garfunkel.\n\nFellow WMM runner and 4x NYCM finisher Karinna Manuel, you are right on all counts. I should have acquainted myself with the famed silence of Queensboro Bridge and the last four miles at Central Park. These were t","'May this remind us of the camaraderie and sportsmanship that the UAAP aims to foster'\n\nMANILA, Philippines – After a display of sportsmanship when De La Salle University (DLSU) set the walls of St. La Salle Hall in Taft Avenue, Manila blazing in blue, the DLSU community is sending another message of unity by lighting up the same facade in blue and green on Monday night, December 4.\n\nThe post of the Facebook panorama said: \"In honor of the wonderful display of Magis and Animo on the court, the façade of St. La Salle Hall is now lit in the colors of the archrivals, Ateneo de Manila University and De La Salle University.\"\n\n\n\nThis is another call for \"camaredie\" and \"sportsmanship\" addressed to the UAAP community in celebration of a successful finals game 3, where the match was not marred by untoward incident. (READ: 'BEST GAME EVER': Netizens react to cardiac UAAP Season 80 Finals Game 3)\n\n\"May this remind us of the camaraderie and sportsmanship that the UAAP aims to foster. \"","MANILA, Philippines — With barely any changes to their lineup, TNT hopes their offseason campaign overseas translates well in the new PBA season.\n\n“It was a good tuneup for us,” head coach Nash Racela said of their training in Lithuania. \"Right away we played a strong team (then) we played a young one.\n\n\"Meron isang team na 17- to 20-year-olds and we lost to them by a point — last-second shot. Then there's the second team ng pro team nila,” he added.\n\nRacela noted that TNT can no longer shore up its frontline, hence they are trying to make the most out of their training overseas, and of course, with the materials they have.\n\n“Putting value in every possession — that’s something we’re trying to learn. It’s a learning process, because that’s how European teams play. From the start, they play hard. Walang pogi basketball,” the second-year KaTropa mentor noted.\n\n\"Obviously we can no longer go taller than we are now. Again, we just have to make do with what we have … We try to plug the holes na kulang kami. We try strengthening our rotation through guys who could relieve the others with good minutes,” he added.\n\nBut Racela is also aware that in the Philippine Cup, TNT will be dealt with a gut punch. With the team’s long-term commitment to the national team, they’re bound to let go of two, if not three, of their wards for the FIBA World Cup Asian Qualifiers.\n\nJayson Castro, Roger Pogoy and Troy Rosario have been called up for Gilas duties last year.\n\n\"That’s a disadvantage for us having committed the most number of players to the program but it is what it is. We’ll just have to make the adjustments again. That’s the sacrifice we’ll have to make for Philippine basketball,” Racela noted.\n\n\"That’s why we prepare the other guys,” he said. \"We try to make them ready for that eventuality.”\n\n\"That’s the biggest challenge for the new guys, especially the ones coming from the amateur ranks. The earlier they adjust, the earlier they would be able to help the team,” he ended.\n\nTNT b","The Meralco Bolts' KG Canaleta scores 25 points and grabs 9 rebounds against the Blackwater Elite\n\nMANILA, Philippines – Journeyman KG Canaleta showed why he remains a commodity in the PBA with a vintage game of 25 points and 9 rebounds for the Meralco Bolts against the Blackwater Elite, his former team.\n\nThe 12-year veteran, who was signed to a one-year deal by the Bolts in the offseason after his contract with Blackwater expired, was on fire throughout the game as he buried 5 of his 9 attempts from long range, including a triple with 11.3 seconds remaining that pushed Meralco to a 103-98 season opening win.\n\nBut the Tarlac City native clarified he wasn't out for revenge against the Elite, whom he helped almost pull off an upset against the Bolts in the quarterfinals of the 2017 Governors' Cup.\n\n\"Wala namang revenge or ano,\" Canaleta said. \"Every game naman, kailangang maging motivated ka. Pero ang maganda ngayon, former team ko. Kumbaga nadoble lang 'yung pagka-motivated ko.\"\n\nCanaleta did not need much time to adapt to the Bolts' system, especially since he has been adjusting for most of his PBA career after being part of 9 different squads. Also, he had already played for Meralco coach Norman Black when they were both part of Talk 'N Text in 2014.\n\nBut the 5-time Slam Dunk king downplayed his big game, saying his teammates just found him in open spots.\n\nBlack, who is missing the services of Cliff Hodge and Ranidel de Ocampo due to injuries, is glad to have Canaleta carry the scoring cudgels.\n\n\"I'd like to just give special mention to KG who I thought was exceptional tonight, scoring and rebounding. He's going to be a very good addition to our team,\" said the multi-titled tactician. – .com","PHOENIX — Troy Daniels knew his shot was going in the moment it left his hands, and he knew exactly where he was on the court — right in front of his former team’s bench.\n\nTroy Daniels hit a 3-pointer with 17.6 seconds to play to give Phoenix the lead, and the Suns held off the Grizzlies 97-95 on Thursday (Friday Manila time) for their third victory in four games.\n\n“We work each and every day for moments like this and I just happened to hit the shot,” Daniels said. “It feels great, I’ll tell you that. I rather for it to be on them (the Grizzlies) then anyone else.”\n\nT.J. Warren led the Suns with 27 points, and Daniels — acquired from the Grizzlies in September — added 14 off the bench. Phoenix won at home for the first time since Nov. 19 against Chicago.\n\nTyreke Evans led Memphis with 23 points, and Marc Gasol added 13 points, 11 rebounds, five assists and three blocked shots. The Grizzlies have lost eight of nine games and nine straight on the road.\n\n“It’s a matter of who makes the most plays and who makes the least mistakes,” Memphis coach J.B. Bickerstaff said, “and tonight they made one more play then we did.”\n\nThe teams traded baskets and leads for much of the fourth quarter, and there were three ties. Neither team scored from the 3:45 mark of the fourth quarter until Daniels’ key 3.\n\nMemphis had two chances to tie or take the lead, but Evans’ 26-footer at the buzzer missed.\n\nI thought I could have got to the basket but I kind of stepped back and shot the 3,” Evans said. “It shouldn’t have came down to that. We had the early lead in the game.”\n\nGreg Monroe rebounded a miss and saved the ball to Daniels for his shot. Monroe had 12 rebounds.\n\n“I just wanted to make sure I stayed in bounds,” Monroe said. “If I could just get it to him, I knew he had an open shot.”\n\nThe Grizzlies used a 15-2 run to grab a 21-9 lead in the first quarter. But Phoenix outscored Memphis 17-4 over the final four minutes of the quarter to take a 26-25 lead going into the second.\n\nEvans s","PHILIPPINE bowling is near to being unnoticed on the global stage after the Paeng Nepomuceno era until Krizziah Lyn Tabora rose from her own struggles in international play to win this year’s Qubica AMF Bowling World Cup.\n\nTabora beat Malaysia’s Siti Safiyah Amirah Abdul Rahman, 232-196, in the stepladder finals in Hermosillo, Mexico to post the biggest career triumph and the Philippines’ best finish in the World Cup in 14 years.\n\nTabora’s win was a surprise for the sport globally, what with the rise of Malaysians, Qataris, Japanese and Koreans as superpowers from Asia. But the surprise is also local, with the Philippines not having even a gold medal to show in the Southeast Asian Games and the Asian Games in the past seven years —and these are tournaments the country has a winning streak historically.\n\nIn Hermosillo, the 26-year-old Tabora placed third in the 40-game qualifying rounds with 8,799 (average: 219.97) behind defending champion Jenny Wagner of Sweden who even posted a perfect 300 game.\n\nAmong the top eight bowlers, Tabora posted six wins and two losses to lead the eight-woman pack and reach the stepladder semifinals. There, Tabora beat Rocio Restrepo of Colombia, 249-222 while Rahman upset Wagner, 227-197, in the other semifinal.\n\nChristian Suarez was the last Filipino to win a Bowling World Cup in 2003. But Tabora’s victory was the first for a Filipina since Olivia “Bong Coo” Garcia in 1979.\n\nTabora has not won a single’s championship on the international scene as her gold medals, at the 2014 Asian Inter-City Bowling Championships, are in women’s doubles and team of five.\n\nPrior to Hermosillo, Tabora was part of a five-woman Philippine team that won a silver in the 2017 Asian Indoor and Martial Arts Games (AIMAG) last September. In 2016, she was ranked only 28th in Asia, with compatriots Liza del Rosario and Lara Posadas ranking higher than her in the region.\n\nPhilippine bowling has not had any major international triumph lately, and four-time World Cup","Niño Cañaleta showed Blackwater what it let go of as he delivered Meralco a thrilling 103-98 victory in the 2018 PBA Philippine Cup Friday at Cuneta Astrodome in Pasay.\n\nLeft unsigned in the offseason, the veteran marksman punished his former team and went for 25 points, catching fire from beyond the arc as he shot 5-of-8 from threes on top of eight rebounds and two assists, none bigger than his dagger triple off the glass with 11.3 seconds to play to put the game out of reach, 101-95.\n\nAllein Maliksi kept the Elite’s flickering hopes alive with a three with 2.5 seconds to spare, but Cañaleta once again iced the game as he calmly drained his free throws with 1.3 ticks left.\n\n“I thought KG was exceptional tonight for us, scoring and rebounding. He’s going to be a very good addition to our team,” remarked coach Norman Black.\n\nBaser Amer added 17 markers, 12 dimes, and five boards, Jared Dillinger got 15 points, 11 rebounds, and two assists, and Chris Newsome had 15 markers in the win.\n\nMeralco took hold of the game in the third quarter as Cañaleta caught fire and ignited 19-0 blast to turn a close 50-54 deficit to a 69-54 advantage with 4:01 to play.\n\nThe Bolts seemingly were well on their way to an easy victory, taking a 90-71 lead with 8:19 left, but Blackwater made a late 24-8 run to trim the lead down to three, 98-95 with 33.1 seconds left before Cañaleta put the Elite to sleep late.\n\n“I thought we did a good job of recovering from a slow start today, especially in the first half. We did recover a little bit late in the second quarter and it carried over into the second half where we got off to a good start. But the energy that we spent trying to get that big lead really cost us down the stretch because we gave that lead up just as quickly as we got it. We’re lucky that we made some big shots down the stretch,” said Black.\n\nThird overall pick Raymar Jose lived up to his billing as he paced Blackwater with 16 points, six rebounds, and two assists in his PBA debut.\n","MANILA, Philippines — In its quest to win its very first Premier Volleyball League title, the Creamline Cool Smashers are forming what many believed is a “super team.”\n\nAfter securing the presence of Alyssa Valdez — the country’s unquestioned top volleyball player — for the whole of next year, Creamline has recently acquired Fil-Japanese Risa Sato of Bali Pure and National University that should help boost its title bid in next year’s much-anticipated PVL season.\n\nAccording to multiple sources, Sato has bid goodbye to her teammate at Bali Pure, last year’s Open Conference champion and Reinforced Conference runner-up.\n\nShe will join Valdez, whose contract with Attack Line in the Chinese Taipei League expires at the end of the year, and former Ateneo star setter Jia Morado.\n\nCreamline isn’t stopping there though as it has reportedly got commitments from Michele Gumabao and super setter Melissa Gohing, whose contracts with Cocolife and Pocari Sweat are expiring, to suit up for its team next season.\n\nSato, Gumabao and Gohing joining Valdez and Morado should establish Creamline, who will be coached by Thai Tai Bundit, as one of the early favorites to win the season-opening Reinforced Conference tentative set in March.\n\nWith Valdez and Morado doing most of the heavy lifting, Creamline finished only third in both the Reinforced and Open Conferences last year.\n\nIt didn’t help that Valdez also missed time as she suited up for 3BB Nakronont in the Thailand League early in the year as well as the national team that saw action in the Kuala Lumpur Southeast Asian Games last August.","GRACE Pauline Quintanilla flexed her muscles in the 2017 Cebu Country Club (CCC) Junior Golf Open Championship last Dec. 18 to 19, as she gets ready for two major tournaments in Luzon in January next year.\n\nThe 10-year-old Quintanilla finished with a 157 in the two-day tournament at the CCC layout’s in Banilad, Cebu City to win the girls’ Class C, a division for players aged 11 to 12.\n\nQuintanilla, a fifth grader at the St. Theresa’s College, is preparing for the 2018 Philippine Amateur Open Golf Championship at the Riviera Golf Country Club on Jan. 4 to 7.\n\nShe will also play at the 56th Philippine Ladies Amateur Open on Jan. 10 to 12 ath the Orchard Golf and Country Club in Dasmariñas, Cavite.\n\nQuintanilla shot 77 from a 36-41 card in the first round and followed it up with 80 from 38-42 card in the second round for an aggregate score 157.\n\nAshley Llena placed second with 186 built from rounds of 92 and 94.\n\n“This will be her first time to compete in the Amateur Open and Ladies Open. Her recent competition in CCC will help her build confidence for her coming tournaments in Luzon,” said Grace Pauline’s father, Gene.\n\nThe older Quintanilla said the two coming tournaments will be a great exposure for her daughter. They will be leaving for Cavite a day after New Year.\n\nThe other winners at CCC Junior Golf Open Championship were Rolando Bergente 153 (77, 76) and Nicole Ong Oh 222 (114, 108) in the boys’ and girls’ Class A.\n\nTatsuyoshi Ochiai 172 (89, 83) and Jordan Palge Quano 197 (99, 98) topped the boys’ and girls’ Class B; while Brian Choi 159 (80, 79) ruled the boys’ Class C and Cliff Richard Nuneza 164 (80, 84) won the boys’ Class D.\n\nIn Class E, Clement Ordeneza 70 (34, 36) and Laine Lois Go 88 (42, 46) were named champions in the boys’ and girls’ divisions.\n\nMeanwhile, Chris Yeom 145 (70, 75) topped the special division for players aged 18 to 23. (RSC)","Two-time world boxing champion Gerry Peñalosa insists he’s not biased but from his objective point of view, Manny Pacquiao is the greatest fighter who ever lived. “It’s not because Manny’s a friend and I’m Filipino,” says Peñalosa who was the WBC superflyweight ruler in 1997-98 and WBO bantamweight king in 2007-08. “I honestly believe Manny’s the greatest ever and it’s because no one can surpass or even duplicate what he has done. He’s the only fighter in history to win world titles in eight divisions from 112 pounds to 154, from flyweight to superwelterweight. It could’ve been 10 divisions but Manny went from flyweight to superbantamweight so he skipped superflyweight and bantamweight.”\n\nPeñalosa says Sugar Ray Leonard is a close second in his book. “In terms of talent, my choice is Leonard but in terms of achievement, no one comes close to Manny,” he says. “If they fought in their prime, it would be quite a match. Manny isn’t just strong, he’s also quick. What makes his punch so powerful is he delivers with all of his heart and soul, like he puts his entire body behind every shot. Line them up. Tommy Hearns, Roberto Duran, Aaron Pryor, Alexis Arguello, Marvelous Marvin Hagler. If they fought Manny at the same weight, Manny would win every fight. Hearns was strong but Manny would take him out because of his glass jaw. Against Leonard, it would just be a matter of time before Manny lands. Manny is a volume puncher and when he fights 12 rounds, you won’t be able to avoid getting hit.”\n\nPeñalosa says not even Muhammad Ali did what Pacquiao has done. Pacquiao turned pro as a minimumweight, scaling 106 pounds in his debut. Then, he moved up in weight to win world titles at flyweight, superbantamweight, featherweight, superfeatherweight, lightweight, superlightweight, welterweight and superwelterweight. Ali was a heavyweight throughout his career and Floyd Mayweather, Jr. claimed world titles in the superfeatherweight, lightweight, superlightweight, welterweight and supe","Metro Manila (CNN Philippines, December 22) — Filipino sprint legend Mona Sulaiman passed away Thursday due to a lingering illness. She was 75 years old.\n\nThe Philippine Sports Commission (PSC) confirmed the news on its official Facebook page.\n\nSulaiman represented the Philippines in the 1960 Rome and 1964 Tokyo Olympics.\n\nThe Cotabato-native athlete made her indelible mark at the 1962 Asian Games in Jakarta where she bagged three gold medals (100-meter dash, 200-meter dash, and 4x100 meter relay) .\n\nHer iconic status was immortalized when she was inducted to the Philippine Sports Hall of Fame last year.\n\nIn her retirement, she was hired by the PSC as consultant for the national athletics team.","Rain or Shine needed a solid defensive job in the end game as it held off TNT, 82-79 to open the 2018 PBA Philippine Cup on a good note Friday at Cuneta Astrodome in Pasay.\n\nThe Elasto Painters’ defense held through in the clutch as Jayson Castro and Kelly Williams botched their late three-pointers which could have tied the game at 82.\n\nStill, coach Caloy Garcia regarded his wards as “lucky” as Rain or Shine survived the duel despite committing 19 turnovers and allowing the KaTropa to grab 33 offensive boards.\n\n“We’re just lucky that they missed those late threes. We had so much lapses in this game,” he lamented.\n\nBeau Belga led the Elasto Painters’ balanced attack as he fired 14 points, five rebounds, and three assists.\n\nChris Tiu was also instrumental in the victory, chiming in 12 markers and three boards, Raymond Almazan added a double-double with his 11 points, 10 rebounds, and three blocks, while Gabe Norwood also got 11 markers and four boards for the team’s first win of the season.\n\nAs happy as Garcia was to start the year right, he noted that this game should serve as an eye-opener for Rain or Shine to buckle down and focus on what it prepared for in the offseason.\n\n“It’s good to start the season with a win but again, we had so many lapses. We turned the ball over too much, gave offensive boards up to TNT. The nice thing about it is we’re able to get this win. But I told the boys that we prepared so hard for this in the offseason and it’s unfortunate if we’re just going to waste it with these kinds of performances,” he said.\n\nCastro topped TNT in the losing effort as he flirted with a triple-double of 18 points, 10 assists, and nine rebounds.\n\nRoger Pogoy added 16 markers but shot 0-of-7 from threes, while Anthony Semerad got 13 points before injuring his right knee early in the fourth quarter.","MANILA, Philippines — Tanauan A and Sta. Maria, Bulacan stepped up their drive to the finals as they led four other teams into the quarterfinals of the Cebuana Lhuillier-AsaPhil U-18 Women’s Softball Championship at the Sto. Niño field in Marikina recently.\n\nTanauan A scored back-to-back wins at the start of the Last 6 phase, including a 6-0 rout of Makati, while Sta. Maria, Bulacan crushed Pasig, 5-0, then Giselle Villarubia and Alyssa Alindogan hit two runs apiece in the second and fifth innings, respectively, as the Bulakeñas ripped the Makati side, 11-0.\n\nAnother Batangas team, Tanauan B, edged Pasig, 4-2, while the latter trounced Rizal, 4-1. Makati and Rizal bring up the rear with 0-2 cards.\n\n“Despite the inclement weather that affected some of the games, we are happy with what we are seeing in this tournament. There are a lot of new and taller players who have emerged who could be our future national players,” said AsaPhil president Jean Henri Lhuillier whose Cebuana Lhuillier Group of Companies are backing the week-long event organized by the Amateur Softball Association of the Philippines as part of its grassroots developmental program for girls’ softball.\n\nOther supporters of the event, which drew a record 27 teams from all over the country, are Cebuana Pera Padala, Cebuana Microloans, Cebuana Micro Inc. Cebuana Savings Bank, Cebuana Lhuillier Foundation, Le Soleil de Boracay, Just Jewels, Palm Rock and One Hagdan.\n\nMeanwhile, the finals will be held tomorrow before an expected big crowd, also at the Marikina field.","MANILA, Philippines — De La Salle University's quest for a men's basketball title retention took a major blow after Ben Mbala confirmed he is no longer with the team.\n\nThe two-time UAAP MVP on Friday tweeted a lengthy post detailing his decision to leave the Green Archers.\n\n\"The decision to leave was the toughest I have had to make after being with La Salle for so many years,\" he wrote.\n\n\"But I feel that this decision is best for the next stage in my career and development,\" he added.\n\nMbala first made noise when he led the Cebu-based Southwestern University to their first CESAFI title in history in 2012.\n\nHe was then recruited by La Salle and served a two-year residency plus a year ban for playing in an outside league during his ban.\n\nIn Season 79, he led the Archers to their ninth men's basketball crown and picked up his first MVP award.\n\nHis onslaught continued the following year and was once again named MVP, but La Salle relinquished their crown to their archrivals Ateneo.\n\nThe 22-year-old Cameroonian thanked everyone who supported him with his stint with La Salle.\n\n\"I am truely grateful for having had the opportunity to represent the Green Archers and will always be a La Sallian at heart,\" Mbala wrote.\n\nMbala will take his talents to Fuerza Regia de Monterrey, a professional basketball team in Mexico.\n\nLa Salle will now bank on head coach Aldin Ayo, who will return for his third season, with a decent core of players in Ricci Rivero, Aljun Melecio and Andrei Caracut.","Hall of Fame promoter Bob Arum, who’s been in boxing for over half a century, knows genuine talent when he sees one.\n\nOne quick look at reigning International Boxing Federation (IBF) super-flyweight king Jerwin Ancajas got Arum into thinking and believing that the Filipino southpaw could be boxing’s next big star.\n\n“I see a lot of similarities to his co-promoter Manny Pacquuiao,” said Arum from the US, praising Ancajas’ “killer instinct” and his being “a great finisher.”\n\nAncajas is managed by the mild-mannered Joven Jimenez but he fights under Pacquiao’s MP Promotions, who has close ties with Arum’s Top Rank, Inc.\n\nSo impress was Arum with Ancajas that the 86-year-old Brooklyn native didn’t hesitate to ink the fighter to a juicy three-fight deal for 2018.\n\nIf Ancajas makes waves next year, a mouth-watering contract awaits him in 2019, said Arum, who is staging Ancajas’ US debut on Feb. 3 against Mexican Israel Gonzalez in Corpus Christi, Texas.\n\nEven before Arum formally announced Ancajas first fight on American soil, the fighter was already reporting for training in Magallanes, Cavite.\n\n“Sobrang excited ako kasi ito ang pangarap ko…ang makalaban sa Amerika,” said Ancajas, who has a 26-1-1 win-loss-draw card with 19 KOs.\n\nGonzalez, who hails from Los Cabos, has a 20-1-0 slate with eight KOs and has won his last eight fights, five inside the distance.\n\nAfter taking the IBF 115-lb crown from Puerto Rican McJoe Arroyo in Septeer last year, Ancajas hit the road this year, repulsing Jose Alfredo Rodriguez of Mexico in Macau, Teiru Kinoshita of Japan in Brisbane and Jamie Conlan of Northern Ireland in his native Belfast.","IN 2011, during the peak of popularity of the Gov. Gwen Garcia Unity Volleyball (GUV) Cup, a province-wide volleyball tournament, Cebu was hailed as the volleyball capital of the Philippines.\n\nThat did not hold for too long. Not long after, when the event folded up, the excitement in the volleyball scene in Cebu fizzled out as well.\n\nFor about five years, the volleyball scene in Cebu only got busy during the Cebu Schools Athletic Foundation Inc. (Cesafi) season.\n\nThis is contrary to the bustling volleyball scene where several tournaments took place, outside the intercollegiate events.\n\nBut that is about to change as the Cebu Province is bent on bringing back the province-wide tournament next year.\n\nCebu star Genie Sabas, who is now playing in the big leagues in Manila, is a perfect example of the good that came out of the GUV Cup.\n\nSabas suits up for the Philippine Army team and is excited about the return of the competition.\n\n“I miss playing for the GUV Cup. It has paved way for a lot of opportunities not just for me but for so many athletes in the province. I am so glad that they are finally bringing it back,” added Sabas, who had helped Mandaue win a grand slam in the GUV Cup.\n\nWhen the GUV Cup ended, Sabas was invited to apply as a special enlistee for the Army’s volleyball team, which she successfully passed. She has been with the Army since 2012 and plays in commercial professional leagues.\n\nSabas said the GUV Cup was not a run-of-the-mill tournament and the level of competition was high. “You get challenged to play and it is good exposure for any player. And Aside from experience, you get to know other volleyball enthusiasts. You get to meet known players and coaches and it’s a bonus that you get to visit other places in the province as well,” said Sabas.\n\nWhen she played for the GUV Cup, Sabas already had extensive experience in volleyball, having played for the national girls team in her teens and carried her alma matter to several collegiate titles. They m","CLEVELAND — LeBron James scored 34 points, Kevin Love added 27 and the Cleveland Cavaliers won their 12th straight home game, 115-112, over the Chicago Bulls on Thursday night (Friday Manila time) as injured point guard Isaiah Thomas moved even closer to his return.\n\nJames had 11 points in the fourth quarter and dropped a pair of free throws with 11.1 seconds left as the Cavs won for the 19th time in 21 games and ended Chicago's seven-game winning streak.\n\nWith Cleveland's Jae Crowder guarding him closely, Chicago's Denzel Valentine was short with a tying 3-pointer in the final second. Rookie Lauri Markkanen scored 25 points for the Bulls.\n\nCavs coach Tyronn Lue missed the game with an undisclosed illness. Assistant coach Larry Drew filled in for Lue, who conducted his usual media session about 90 minutes before tip-off and was in Cleveland's locker room before the team announced he was sick.","THE Philippine Sports Commission (PSC) eyes to bring back the glory day of Philippine diving when it holds a diving clinic and competition in Davao City summer of next year.\n\nPSC commissioner Charles Raymond A. Maxey, who guested in the Davao Sportswriters Association (DSA) Forum at Hukad restaurant, SM City Davao Thursday, shared that when he attended the Christmas party for national athletes at the Rizal Memorial Sports Complex baseball field, he saw a group of young divers aged five to six years old seating together.\n\n\"Gina-train karon sa Philippine diving team mga bata na (The Philippine diving team is training young divers now). But of course kabalo ta sa kalibre sa mga taga Davao that's why we plan to conduct a talent identification (ID) diri, hoping to discover more potential divers and we will push through with this,\" Maxey said.\n\nRetired Philippines' diving queen Sheila Mae Perez, an Olympian, is from Sasa, Davao City along with fellow Olympians Zardo Domenios and Rexel Ryan Fabriga who are both from Panacan.\n\nThe Dabawenyo commissioner added, \"We want to promote diving as a sport at the same time bring back the glory days of diving in the Philippines maski sa Southeast Asian (SEA) Games lang (even in the SEA Games).\"\n\nPerez rose to stardom when she collected three gold medals in the Philippines SEA Games held in 2005 as she also annexed SEA Games golds in other editions of the biennial meet. Davao divers, including Ceseil Domenios and Jaime Asok, used to dominate the SEA Games.\n\nMaxey said that with the revival of diving in Davao City, Philippine diving will also be restored to its glory.","Niño Cañaleta admits that he was truly motivated when Meralco opened its 2018 PBA Philippine Cup campaign on Friday.\n\nThat motivation, however, has noting to do with his new team facing his former club Blackwater.\n\n“Every game, you have to be motivated. It just so happened that we faced my former team. But there’s no revenge angle or whatever,” he reiterated in Filipino.\n\nSeeking redemption or not, the 35-year-old forward looked like a man on a mission when he took the court for the Bolts, punishing the Elite as he led the charge in a 103-98 victory.\n\nThe former UE stalwart torched the net as he went 5-of-8 from threes, with his gutsiest long bomb coming off the glass with 11.3 seconds remaining to put the game away for Meralco, 101-95. He finished with  25 points, eight rebounds and two assists in the win.\n\nBut for Cañaleta, he attributed his good showing to his extensive plans coming to this season, saying, “We had a good preparation. I adjusted well with this new team and I didn’t have much difficulty because they were very supportive. They’ve been encouraging me to perform at my best and that’s the reason why I’m really confident playing for Meralco.”\n\nIt also helps that he’s playing for coach Norman Black, the same mentor he had briefly in 2014.\n\nCañaleta’s explosion couldn’t have come at a right time, especially with the Bolts starting the new season without Ranidel de Ocampo and Cliff Hodge, both of whom are dealing with injuries. Still, the Tarlac native knows what he brings to the table for Meralco and he’s willing to hold the fort for his new squad as the Bolts go through this tough stretch without their usual starting forwards. “I’ve been in this league for so long and I know that I don’t need to rush anything. All you need to do is to be calm and control your emotions. It’s only then when you’ll be able to do what you need to do on the court,” he said.","MANILA, Philippines — Volleyball stakeholders met the other night and agreed to hold initial talks for a possible united front following disputes in various issues, including turf war and scheduling.\n\nHowever, the NSA (national sports association) for volleyball – the LVPI (Larong Volleyball sa Pilipinas, Inc.) was not invited to the meeting.\n\nTony Liao, representing the Premier Volleyball League, Philippine Superliga president Ramon Suzara and Philippine Volleyball Federation’s Boy Cantada, Gerard Cantada and Ottie Camangian have discussed the possibility of settling their disputes and eventually unifying all stakeholders for the sake of the sport, which has gained tremendous popularity the last few years through the year-long tournaments of the PVL and PSL.\n\nIssues on grassroots development and the formation of the national team were tackled during their initial meeting, according to Liao.\n\nThe PVF used to be the sport’s governing body until the PVL, formerly the Shakey’s V-League, and the PSL joined hands to topple the former, paving the way for the formation of LVPI, now headed by Joey Romasanta and Peter Cayco.\n\nIt turned out to be a temporary coalition for the PVL and PSL as the two leagues clashed on issues on scheduling, formation of national team and securing of International Transfer Certificates, or license for imports.\n\n“We’re always for the unification and the good of Phl volleyball,” said Liao.\n\nCuriously, the LVPI was never informed nor invited to join the initial talks.\n\n“We were not aware of it but if its unification they’re talking, we welcome it,” said Cayco, the LVPI vice president.\n\nLiao, however, said they will invite LVPI to the next meeting on Jan. 15 next year.","John David Velez and Elizabeth Abarquez each carved out a pair of victories in varying fashions to dominate their respective divisions in the Palawan Pawnshop-Palawan Express Pera Padala Naga City regional age-group tennis tournament at the City of Naga tennis courts recently.\n\n\n\nVelez repulsed Andrei Padao, 6-3, 6-4, in a duel of fancied bets to nail the boys’ 14-and-under crown then the rising Davao star stopped Mark Albarracin, 6-1, 6-2, to annex the 16-U diadem in the Group 2 tournament sponsored by Palawan Pawnshop and presented by Slazenger.\n\nThe top seeded Abarquez from Carcar, Cebu also held off young Alexa Milliam, 6-3, 6-4, in the girls’ 16-U finals then repeated over the Smapi, Ponte Vedra bet, 6-2, 0-6, 10-5, for the 18-U plum as she shared the MVP honors with Velez in the event hosted by Naga City Mayor Kristine Vanessa Chiong and the various LGUs.\n\nMilliam earlier dominated Ashley McKenzie, 6-1, 6-2, but fell short twice of her upset bid against Abarquez in the tournament backed by the Unified Tennis Philippines, including PPS-PEPP, Cebuana Lhuillier, Wilson, Toby’s, Dunlop, Slazenger and B-Meg.\n\n“While Velez and Abarquez have established themselves as forces to reckon with in the circuit, fresh faces continue to emerge, thus inspiring us more to put up more and more tournaments to widen the base of our talent-search,” said Palawan Pawnshop president/CEO Bobby Castro.\n\nUnranked local bet Vince Canete downed Gio Manito, 4-0, 5-3, to snatch the 10-unisex crown; Ormoc City’s Corazon Laonao outlasted Kierly McKenzie in a marathon duel, 6-4, 4-6, 11-9, for the girls’ 12-U title; Andrei Lago from Sogod, Leyte trounced Mitch Laygo, 6-2, 6-3, for the boys’ 12-U diadem; and top local entry Vhon Tudtud overpowered Lemuel Garbosa, 6-3, 6-2, in the boys’ 18-U finals.\n\nMeanwhile, the country’s longest, biggest junior circuit winds up in Angeles, Pampanga starting Dec. 26. Listup is\n\n ongoing, according to PPS-PEPP Sports Program Development director and organiz","Filipina gymnast Breanna Labadan dominates the 11-year-old category of the Hong Kong Queens Cup 2017 International Rhythmic Gymnastic competitions\n\nMANILA, Philippines - Filipina gymnast Breanna Labadan dominated the 11-year-old category of the Hong Kong Queens Cup 2017 International Rhythmic Gymnastic competitions held from December 16 to 17, bagging 3 golds and a bronze in the two-day tournament.\n\nAfter striking gold in the Ball Apparatus, Clubs Apparatus and the Individual All-Around routines, the Gymnastic Association of the Philippines (GAP) member and lone Philippine representative was named the Individual All-Around Champion, according to a news release. Although she settled for bronze in the Ribbon Apparatus routine, her collective performance was enough to best other participants from Malaysia, Singapore, host country China and host city Hong Kong.\n\n“We are happy with the outcome of Breanna’s efforts,” said mother Laurice Labadan. “Her triumph was a result of dedication and hard work. We dedicate this to God and the Philippines.”\n\nLabadan studies at St Scholastica College in Manila and trains under the Gymnastic Association of the Philippines (GAP) as a pre-junior national pool member. – .com","Metro Manila (CNN Philippines, December 22) — De La Salle University's prized cager Ben Mbala announced Friday his departure from the team.\n\nThe 6-foot-6 Cameroonian center is not ruling out any possibility on playing basketball again in the Philippines, which he considers home.\n\n\"Why not? I love the Philippines. It's not like I'm leaving the Philippines forever. I will visit from time to time,\" he told CNN Philippines' Sports Desk in an exclusive interview.\n\n\"If ever I get an offer or opportunity to play back in the Philippines, then I'd definitely grab it,\" he added.\n\nMbala, 22, led the Green Archers in claiming the UAAP Season 79 men's seniors basketball title and the 1st runner-up finish in this year's tournament.\n\nIn an Instagram post, Fuerza Regia -- a ball club which is part of a professional league in Mexico -- announced that they have tapped the services of Mbala.\n\nFor Mbala, he felt like it's time to go to the pro level and explore new possibilities.\n\n\"I feel like it's time to try get to the next level. It's been a long time for me in college and I feel like I'll try the pro level,\" he said.\n\nEXCLUSIVE: Basketball superstar @benmbala says his decision to leave La Salle is final https://t.co/0JKC6FSTrY pic.twitter.com/gehzWOxHtr — CNN Philippines (@) December 22, 2017","Christmas comes early for 3-year-old Zhuri as LeBron James gets candy for her\n\nMANILA, Philippines – LeBron James had to perform some daddy duties during his game against the Chicago Bulls on Thursday, December 21.\n\n\"Hey Momma, you want candy?\" James asked his wife and 3-year-old daughter Zhuri. The 3-time NBA champion then went looking for a little snack for his daughter midway through the game.\n\nAs James went around the courtside, he was finally able to score a treat for Zhuri. \"You're welcome!\" exclaimed James.\n\nThe 4-time NBA MVP recorded a game-high of 34 points in their 115-112 victory over the Bulls. – .com","Thai Yupaporn Kawinpakorn pulled away from Princess Superal after 10 holes then coasted to victory over compatriot Chonlada Chayanun in the\n\n ICTSI South Forbes Ladies Invitational in Silang, Cavite, on Thursday.\n\nTied with Superal after 36 holes, Kawinpakorn went 4-up with an even card after 10 holes as the local ace fumbled with two bogeys and a double-bogey.\n\nKawinpakorn then bucked double-bogeys in the last two holes to tally a four-over-par 71 and beat Chayanun by two with a 206 total for her second crown after winning the Philippine Ladies Open 10 years ago.\n\n“I knew I could win here because the course is short,” said Kawinpakorn, who received the top P150,000 purse from Philippine Golf Tour executive director Narlene Soriano at the close of the 11-stage Ladies PGT circuit. “But we had to deal with the wind that blew from all directions all tournament-long.”\n\nChayanun fell by as many as seven shots after 16 holes but gained a three-shot swing with a birdie on No. 17, finishing with a 70 and bagging P95,000 for second place at 208.\n\nIt was Chayanun’s second straight runner-up effort after a 1-2-3 romp by the Thais in the Philippine Ladies Masters won by Renuka Suksukont at The Country Club two weeks ago.\n\nSuperal got derailed by back-to-back bogeys from No. 6 and a double-bogey on No. 10 and tumbled to a 74, ending up third at 209 worth P60,000 in the event put up by Pilipinas Golf Tournaments, Inc.\n\n Chihiro Ikeda placed fourth following a 70 and 210 while Dottie Ardina skidded with a 73 after a triple bogey seven on the final hole to place fifth with a 211 total.","From being recognized as athletes to international victories, PH esport players has had a lot to celebrate in 2017\n\nAfter a success-filled 2016, who would’ve thought 2017 was going to be even better for Philippine esports?\n\nEsports in the archipelago has definitely been on the up and up over the past few years, with the local industry steadily becoming a global powerhouse. 2017 continued on that trend, and will be remembered for the sheer amount of achievements the community was able to garner.\n\nFrom government recognition to top-caliber events, here are some of our top picks for what Philippine esports achieved in 2017.\n\nEsports pros as athletes, given athletic licenses for quicker visa processing\n\nAs esports steadies its foothold in the Philippines landscape, the majority is coming to better recognize the industry’s rise and legitimacy as a form of competitive sport and entertainment.\n\nAs of July 2017, the Philippine government, through the Gaming and Amusements Board (GAB), now allows professional esports players to secure athletic licenses on par with legitimate sports. The GAB has expressed that competing in the field of esports requires a tremendous amount of dedication, persistence, and skill to develop, much like traditional sports, hence its support.\n\nPreviously, professional esports teams and players found difficulty in securing visas for competing internationally. Now, we enter an era where esports – regardless of what game you play – is welcomed and celebrated in its entirety, where homegrown talent can be supported and reared to become world-class.\n\nMainstream growth aside, esports also secured a large foothold in the scholastic scene this year. Be it League of Legends, Dota 2 or even Super Smash Bros., schools across the country are slowly but surely integrating esports into their respective campuses.\n\nOn the Dota 2 end of the spectrum, the UP Diliman Gaming Guild’s (UPGG) Impetus circuit had eight UAAP schools compete for a PHP 50,000 prize pool. Impe","Get to know the UAAP Sports teams who are establishing an era of excellence\n\nFor sports teams in the UAAP, each consecutive championship title is immortalized in history as the colors of their respective schools are brought under the spotlight of the collegiate league.\n\nIn 2017, we had 10 teams from the 8 UAAP schools that continued to establish themselves in their respective sports and bring honor to their school.\n\nPrior to Season 77, Ateneo Men's Volleyball had never recorded a championship title in history. That was until the Marck Espejo-led team denied the National University (NU) Bulldogs their 3rd straight title and started a streak of their own.\n\nSince then, head coach Oliver Almadro has continued to fortify his arsenal in order to achieve his players' champion form. The Blue Eagles were undefeated throughout Season 79, claiming their 3rd championship title after two grueling finals games against the NU Bulldogs in May.\n\nEspejo continued to dominate the individual rankings as he emerged as the undisputed 4-time Most Valuable Player (MVP) of UAAP men's volleyball. Ateneo setter Ish Polvorosa also claimed his 4th straight Best Setter award.\n\nIn Game 2 of the UAAP Season 80 Women's Basketball finals, the University of the East (UE) Lady Warriors threatened the National University Lady Bulldogs' reign atop the league, nearly ending their record of 63 straight victories.\n\nThe Lady Bulldogs still had enough magic to top the Lady Warriors in the fourth quarter, outscoring them 28-14 to clinch their 4th consecutive UAAP title and keep their undefeated record at its best of 64 wins and produce another perfect 16-0 season for the 4th straight time.\n\nJack Danielle Animam secured her first MVP title, keeping the award with NU for the 4th straight time after the graduation of 3-time MVP Afril Bernardino in Season 79. Rhena Itesi and Ria Nabalan joined Animam in the Mythical 5 as well this Season 80.\n\nUnfortunate news dawned onto the team when Olympian and 3-time UAAP MVP","Garcia faces Rios in his first fight after losing a decision to Keith Thurman\n\nLOS ANGELES, USA - Former world super lightweight and welterweight world boxing champion Danny Garcia returns from the first loss of his career in February against former world champion Brandon Rios, promoters announced Thursday, December 21 (Friday Manila time).\n\nThe fight will headline a February 17 card at Mandalay Bay in Las Vegas that also includes unbeaten American David Benavidez making his first World Boxing Council super middleweight title defense in a rematch with Romanian Ronald Gavril.\n\nGarcia, 33-1 with 19 knockouts, suffered the first defeat of his career last March, dropping a split decision to fellow American Keith Thurman at Brooklyn in a unification showdown for the World Boxing Council and World Boxing Association welterweight crowns.\n\n\"I'm excited just to get back in the ring,\" Garcia said. \"I needed the time off to recuperate and let my body heal.\n\n\"I'm ready to kick off the year in style and take over the welterweight division.\"\n\nThat would mean putting himself in position for a rematch against double champion Thurman, unbeaten International Boxing Federation king Errol Spence of the United States and undefeated Australian Jeff Horn, the World Boxing Organization champion.\n\nGarcia, 29, spent two years as a super lightweight champion after taking his first crown in 2012 by unanimous decision from Mexico's Erik Morales.\n\nRios, 31, is 34-3 with one draw and 25 knockouts. The former WBA lightweight champion dropped three of his past six starts, including a 2013 Macao matchup against Filipino star Manny Pacquiao, but won his most recent bout by knocking out Mexico's Aaron Herrera last June after a 19-month layoff.\n\n\"I'm excited to prove my critics wrong again,\" Rios said. \"Danny is a great fighter, but I will beat him just like I have beat others in the past.\"\n\nBenavidez, 19-0 with 17 knockouts, won the vacant crown last September with a split decision over Gavril, 18-2 w","The search for the next Mary Joy Tabal and Hidilyn Diaz will start next year as the Philippine Sports Commission (PSC) will be holding the inaugural Visayas Open Tournament in seven key cities around the Visayas region starting Jan. 7 with the Sinulog Fun Run. Conceptualized by PSC Visayas commissioner Ramon Fernandez, the Visayas Open Tournament not only aims to strengthen grassroots talent but also provide exposure for potential athletes who can represent the country in the 2024 Olympics. The Cebuana Tabal is a women’s marathon gold medalist in the 2017 Southeast Asian Games and an Olympian while Diaz won a silver medal in the women’s 53-kg weight division of weightlifting in the 2016 Summer Olympics. The Visayas Open aims to find more athletes who could follow the footsteps of Tabal and Diaz. It will have 15 Olympic sports: karatedo, boxing, taekwondo, judo, marathon, open water swimming, triathlon, archery, shooting, fencing, weightlifting, badminton, table tennis and tennis. It will also feature arnis, which is not an Olympic sport. Philippine Sports Institute (PSI) director Nonie Lopez said that the Visayas Open is for athletes aged 22 and below. Winners in each sport will be trained for free by the PSC until they are ready to compete in major competitions as members of the national team. The first part of the Visayas Open will be the Sinulog Fun Run, which will feature 10-kilometer, 5K and 3K distances. Winners here will automatically be champions for running and will be trained for free by John Philip Dueñas, the coach of Tabal. Cebu City will be hosting the first leg of the Visayas Open on April 8-9. The next legs will be on June 2 to 3 at the City of Naga, June 9 to 10 in Tagbilaran City, Aug. 11 to 12 in Iloilo City, Aug. 25 to 26 in Danao City, Oct. 27 to 29 in Boracay and Dec. 1 to 2 in Ormoc City. Aside from the Visayas Open, the PSC will also continue its Children’s Games, which is aiming to cover 49 cities around the Visayas.","For relatively little cash, a sponsored national cuesports team can bring very good exposure to a Pinoy corporate entity.\n\nLast week Carlo Biado became the newest Filipino world champion in pool, following the footsteps of Efren Reyes, Francisco Bustamante, Ronnie Alcano, Alex Pagulayan, Rubilen Amit, and Dennis Orcollo.\n\nThese are all champions of events that are recognized as world titles by the World Pool-Billiard Association. Lee Van Corteza snapped off the 14.1 (Straight Pool) World Tournament last October, which is not officially a WPA-sanctioned event but might as well be due to the strength of the field.\n\nBiado's triumph caps a banner year for the La Union-born, QC raised 34-year old. He won gold in the SEA Games, bronze in the Asian Indoor Games, and gold in the World Games, a competition with a very strong field. Biado finally gets his 9-ball world crown after finishing second in the 2015 world ten ball championship.\n\nThis achievement once again casts the spotlight on pocket billiards, which I strongly believe to be our best sport. It's also a game that needs a shot in the arm, as televised tournaments have disappeared, and pool halls are shuttering. BEC in Magallanes, one of the few remaining pool venues in Makati, for example, is closing its doors at the end of this year.\n\nAs Reyes and Bustamante, the two-headed Mount Rushmore of Pinoy pool, wind down their illustrious careers, pool seems to be fading into the sunset too. I get the impression that the public thinks that Philippine pool has no other world-class players now that the “magkumpare” are past their prime. That couldn't be farther from the truth.\n\nA new generation of Pinoy shooters is here. Apart from Biado, who was overdue for a world title, Johann Chua and Raymond Faraon, both former winners of the All-Japan Championship, are proven champs. Jeffrey Ignacio has “all the tools to be a world champion,” according to former world champ Darren Appleton, while other players like Renemar David, Anthon","CENTER STAGE: Young Filipino-American basketball players with the parents, coaches and mentors prepare to play a halftime game during the Brooklyn Nets Filipino Heritage Night.  (Photo by Bel Molina)\n\nFilipino-Americans came in droves to the Barclays Center in Brooklyn, N.Y., home court of the National Basketball Association (NBA) team Brooklyn Nets, on Oct. 22, 2017.\n\nThe event, held in commemoration of Filipino-American History Month, featured Philippine performances and sports demonstrations, as well as trivia games.\n\nFilipino law enforcement officers were likewise honored for their service.\n\nSeveral groups of young Filipino and Filipino-American basketball players were given an opportunity to play on the Brooklyn Nets court during halftime.\n\nThe short game showcased the Filipinos’ innate love and passion for basketball.\n\nYoung Fil-Am basketball enthusiasts show their skills on the Nets’ court.  (Photo by NYPCG)\n\nOne of the event organizer’s second generation Filipino-American Mark Anthony Agbuya, who also helped organize the equally successful Heritage Night in 2016, commented that this year’s event is made more significant in that it takes place while the entire Filipino-American Community commemorate Filipino-American History Month in October.\n\nMike Ang of Tanduay Rhum’s U.S. Team said that the company is happy to support the Filipino Heritage Night as one of the Brooklyn Nets official sponsors and the official rhum of the Barclays Center.\n\nA delegation from the Philippine Consulate General in New York led by Consul General Theresa Dizon-De Vega were in attendance during this event.\n\nMike Ang of the Tanduay Rhum Team in the U.S. and Consul General Theresa Dizon-De Vega at Barclays Center Tanduay 40/40 Club.  (Photo by NYPCG)\n\nOne of the event organizers, Mark Anthony Agbuya (center, 2nd from right), with 2nd and 3rd generation Fil-Am Community members at the Filipino Heritage Night.  (Photo courtesy of Bel Molina)","MANILA, Philippines — In its quest to win its very first Premier Volleyball League title, the Creamline Cool Smashers are forming what many believed is a “super team.”\n\nAfter securing the presence of Alyssa Valdez — the country’s unquestioned top volleyball player — for the whole of next year, Creamline has recently acquired Fil-Japanese Risa Sato of Bali Pure and National University that should help boost its title bid in next year’s much-anticipated PVL season.\n\nAccording to multiple sources, Sato has bid goodbye to her teammate at Bali Pure, last year’s Open Conference champion and Reinforced Conference runner-up.\n\nShe will join Valdez, whose contract with Attack Line in the Chinese Taipei League expires at the end of the year, and former Ateneo star setter Jia Morado.\n\nCreamline isn’t stopping there though as it has reportedly got commitments from Michele Gumabao and super setter Melissa Gohing, whose contracts with Cocolife and Pocari Sweat are expiring, to suit up for its team next season.\n\nSato, Gumabao and Gohing joining Valdez and Morado should establish Creamline, who will be coached by Thai Tai Bundit, as one of the early favorites to win the season-opening Reinforced Conference tentative set in March.\n\nWith Valdez and Morado doing most of the heavy lifting, Creamline finished only third in both the Reinforced and Open Conferences last year.\n\nIt didn’t help that Valdez also missed time as she suited up for 3BB Nakronont in the Thailand League early in the year as well as the national team that saw action in the Kuala Lumpur Southeast Asian Games last August.","President Rodrigo Duterte’s net satisfaction ratings bounced back by 10 points to 58% in the fourth quarter of 2017, according to a Social Weather Stations (SWS) survey.\n\nAccording to data released on Friday, the SWS said that 71% of adult Filipinos were satisfied with Duterte’s performance, 13% were dissatisfied while 15% were undecided.\n\nThe SWS classified Duterte’s latest net satisfaction rating as “very good,” an improvement from his 48% rating, classified as “good,” in September 2017.\n\nThe polling agency attributed Duterte’s 10-point rise to increases by 14 points in Luzon, 11 points in Metro Manila, 10 points in Visayas and 3 points in Mindanao.\n\nDuterte’s net satisfaction rating remained “excellent” in Mindanao at 80%, backed by a 4 point increase from the survey results in September 2017, the SWS said.\n\nThe president’s net ratings went up from “good” to “very good” in Metro Manila (55%), Luzon (50%) and Visayas (53%), the survey showed.\n\nMoreover, Duterte raked in “very good” net satisfaction ratings in both urban and rural areas, in all classes, among both men and women, among 25 year olds and above and in all educational levels.\n\nThe survey was conducted using face-to-face interviews of 1,200 adults (18 years old and above) nationwide, the SWS said. It has a margin of error of ±3% nationwide, ±4% for Luzon, and ±6% each for Metro Manila, Visayas and Mindanao. /je","May rekord na 26-1-1na may 18 pagwawagi sa knockouts, ito ang ikaapat na depensa ni Ancajas ng kanyang IBF junior bantamweight title laban sa No. 10 contender na si Gonzalez na may kartadang 20 panalo, 1 talo na may 8 knockouts at mula sa Cabo San Lucas, México.\n\n“I have had the opportunity to be ringside for Jerwin’s fights in Australia and in Macau and I see a lot of similarities to his co-promoter Manny Pacquiao,” sabi ni Arum sa Fightnews.com. “Jerwin has a killer instinct inside the ring and he is a great finisher. Just look at his record. Jerwin has only gone the distance once in his last 14 fights!”\n\n“Jerwin Ancajas, the IBF junior bantamweight world champion and MP Promotions’ first world title holder, is an exciting fighter who has not reached his full potential,” ani Pacquiao. “I am pleased to announce that we will have the opportunity to get worldwide exposure through his upcoming fights being televised on ESPN, with the help of the legendary Bob Arum and Top Rank. We, at MP Promotions feel that this opportunity will open the floodgates for Jerwin to reach his full potential and continue to bring great honor to the Philippines. That begins on February 3 in Corpus Christi, Texas, live on ESPN, and we will be with him in every step of the way throughout his journey.”","THE Land Transportation Franchising and Regulatory Board (LTFRB) will intensify Oplan Isnabero during the Christmas season because this is the time when taxi drivers are known to commit franchise violations.\n\nLTFRB 7 Director Ahmed Cuizon said that violators usually refuse to convey passengers to their destination, overcharging, pakyaw or fare contracting, colorum transport, and overloading.\n\n“Our office is partnering with malls where Oplan Isnabero tarpaulin streamers are installed in taxi stands and public utility vehicle terminals,” Cuizon said.\n\nThe tarpaulins contain LTFRB 7 hotline number (032) 231-6221 so that passengers can call the regulatory agency to complain regarding violations of public utility drivers.\n\n“This year, we want to reach out to passengers not only of taxis, but also of Transport Vehicle Network Service (TNVS) units. We urge passengers to call us if they experience violations made by taxi and TNVS drivers so we can immediately discipline them,” Cuizon said.\n\nOnce the LTFRB will receive a complaint from any passengers, the erring drivers will be immediately summoned for a hearing and will be immediately penalized if found guilty.\n\nCuizon said the penalties for these violations range from P2,000 to P6,000 for the first offense, suspension of franchise for the second offense, and cancellation of franchise for the third offense.\n\nOplan Isnabiro was launched by Cuizon last Dec. 15 and will be a year-round campaign. (EOB)","COACH Bo Perasol yesterday said he was surprised he was being floated as one of the candidates for the job set to be vacated by Commissioner Chito Narvasa next month.\n\n\n\n “I did not apply for the job. Probably, some well-meaning friends just recommended me,” Perasol told -Business Insight yesterday, adding his focus remains with University of the Philippines in the UAAP.\n\n\n\n “They thought that my corporate experience and having been involved in the PBA as a coach for almost 10 years would qualify me for the job,” he added.\n\n\n\n Also among those being floated as candidates to replace Narvasa are UAAP commissioner and executive director Rebo Saguisag, former Sta. Lucia Realty alternate governor Ariel Magno and broadcaster Charlie Cuna, all of whom are lawyers.\n\n\n\n Perasol, 44, was mentioned in a story by BusinessWorld yesterday along with coach Joel Banal as candidates to replace Narvasa. He previously coached Ateneo from 2013-2015.\n\n\n\n A corporate guy who served as manager of Airfreight2100 before he took up his MBA at Ateneo, Perasol was also a former pro league coach from 2005 to 2009 with Air21 and from 2009-2012 with Coca-Cola/Powerade.\n\n\n\n “I have no idea (how my name floated as candidate). I’m still sane enough not to apply for that very controlling job,” said Perasol.\n\n\n\n Narvasa resigned last Sunday when the league kicked off its 43rd season but will remain until the end of the year to help in the transition period.\n\n\n\n Perasol said if and when he gets serious consideration for the job, he has to discuss the matter with UP, a team likely to get a big boost with the arrival of 6-foot-8 Nigerian Bright Akhuetie next season. He admitted that leading Asia’s first pro cage league is no easy task.\n\n\n\n “That’s a huge responsibility, which needs full-time attention. I may have to talk to our management in UP regarding that,” he said. “Just to be considered is already an honor. The task is very challenging and whoever may be chosen should be fully up to the respo","Brisbane, Australia – Manny Pacquiao’s camp Sunday slammed the officials after the Filipino great lost his World Boxing Organization welterweight title in a controversial unanimous decision to Australia’s Jeff Horn on Sunday.\n\n”The referee was sketchy, the judges were crazy,” fumed Pacquiao’s strength and conditioning coach Justin Fortune, who is a former Australian heavyweight champion.\n\n”Manny lost the fight, but Jeff Horn looks like a pumpkin,” Fortune added, referring to Horn who finished the fight with a badly swollen face and needing stitches over his right eye.\n\nThe three judges scored the fight 117-111, 115-113 and 115-113 to Horn.\n\n”Those scores, that card? It should be the other way around,” said Fortune.\n\nThe result that caused dismay on social media among boxing and sporting greats.\n\n”This is what’s wrong with boxing,” tweeted former undisputed world heavyweight champion Lennox Lewis.\n\n”Horn was very game but I’m hard pressed to see how he could have won that fight by any stretch!”\n\nAmerican football quarterback Aaron Rodgers of the Green Bay Packers was equally forthright.\n\n”Boxing is a joke, and it proves it again tonight. Are you kidding me with those scorecards? #joke #rigged,” Rodgers said on Twitter.\n\nBaseball and NFL legend Deion Sanders said: ”@mannypacquiao was robbed! I’m really upset right now. Really. This is ignorant. God bless u Manny and all u do for your country. #Truth.”\n\nThe fight statistics seemed to back the belief that Pacquiao had done more than enough to win.\n\nBroadcaster ESPN said that Pacquiao had landed 182 punches to 82 from the challenger over the 12 rounds in front of more than 51,000 fans in Horn’s home town of Brisbane.\n\nFortune, who once fought against Lewis and  has been with Pacquiao since 2002, said Horn had been allowed to get away with a host of illegal tactics as he brawled his way to victory.\n\n”That’s what you get down here,” he said of the tactics.\n\n”You’d never get away with that anywhere else in the world. You’d ","Jerwin Ancajas will face a once-beaten Mexican in Corpus Christi, Texas on February 3, 2018\n\nCAVITE, Philippines – Jerwin Ancajas is heading stateside for his next title defense.\n\nThe 25-year-old from Panabo City, Philippines will put his IBF junior bantamweight title at stake for the 4th time when he faces Israel Gonzalez on February 3, 2018, at the Bank of America Center in Corpus Christi, Texas.\n\nThe fight was announced Saturday, December 16, at a press conference at Island Cove in Kawit, Cavite, the town where Ancajas now makes his residence.\n\nThe fight will be the televised in the United States on ESPN as the co-featured bout underneath WBO super middleweight champion Gilberto Ramirez against Habib Ahmed, and will be one of 3 fights in 2018 for Ancajas, said MP Promotions matchmaker Sean Gibbons.\n\nAncajas (28-1-1, 19 knockouts) is fresh off his 3rd successful defense, a crushing 6th-round stoppage of Jamie Conlan in Belfast, Northern Ireland a month ago.\n\nGibbons added that Ancajas is \"very close to formalizing a deal\" with Top Rank, the company which moved Ancajas' promoter Pacquiao in the United States.\n\nGonzalez (21-1, 8 KOs) of Los Cabos, Mexico, is also fighting for the first time in the States and will be taking a significant step up from his recent competition. The lone win over a recognizable name on the IBF number 10 ranked contender's record is a 2016 decision victory over a shopworn Ramon Garcia Hirales, who was once the WBO junior flyweight titleholder.\n\n\"What coach [Joven Jimenez] is telling me, don’t let your guard down for anyone, especially those who are being underestimated by others,\" said Ancajas. \"But for us, we’re not underestimating, instead we’re persevering even more so we can show our skills.\n\n\"We all know Mexicans fight really hard, so it’ll be a good fight.\"\n\nGibbons said he's been down to Mexico twice to see Gonzalez fight and believes the matchup will be tougher due to the lack of footage on Gonzalez.\n\n\"Israel Gonzalez, even though ","MANILA, Philippines — Kia made quite the statement on Wednesday night, giving a loaded NLEX squad a run for their money.\n\nPicanto’s coach, too, made another after the post-game huddle.\n\nFormer assistant coach and now the team’s head tactician, Chris Gavina entertained the press with a black shirt saying “Prove them wrong.”\n\n“I wore this for a reason today,” he shared. “I told everybody, ‘Prove everybody wrong today.’ I told them you have no idea how many people have doubted us.”\n\nKia narrowly lost to NLEX, 119-115, in a rare PBA affair at the Flying-V Arena in San Juan. Five cagers from Gavina’s fold registered double-digit production with former Road Warrior Eric Camson leading the charge with 24 points.\n\nTagged as the whipping boys of league, Kia was put on the hot seat after forgoing the first overall pick — which could’ve been Christian Standhardinger — in a bid to employ an “unconventional” approach in the new PBA season.\n\nFans and followers even went as far as translating the offseason move as Kia’s disinterest in competing.\n\n“I gave everybody this baller,” Gavina bared, pointing to a rubber band around his wrist. “[It] says ‘Nothing is impossible with God’ and that’s the mindset going in.”\n\n“If we put in the work, hopefully in our next game we come out on top,” he continued.\n\nFor three quarters, Kia was on the driver’s seat. Heck, they were even able to lead by as many as 13 markers in the game. If not for Larry Fonacier's four-point play late in game, the outcome would’ve been different.\n\nWhile falling short in their opening game definitely hurt, Gavina said they are keeping their heads up.\n\n“We showed our grit tonight. We showed a great deal of character in being able to keep up with what I feel is one of the contenders coming into this conference,” he explained.\n\n\"If we can do this against NLEX, we can do this against anybody,” Gavina declared.","Sa unang panalo ng NLEX ay nagsalansan ang No. 2 overall pick ng 18 points, 12 assists at 7 rebounds laban sa Kia.\n\n“I had no doubt whatsoever that he could make an impact, and he did,” wika ng seven-time PBA champion coach na si Guiao sa dating kamador ng Ateneo Blue Eagles sa UAAP. “He’s going to be a special player in this league.”\n\n“Mahirap mag-isip ngayon, pero maybe it’s a combination of Paul Lee and Willie Miller,” pagkukumpara ni Guiao.\n\nMalaki rin ang maitutulong ni Ravena, nagbigay sa Ateneo Blue Eagles ng dalawang UAAP championship noong 2011 at 2012 at bahagi ng Gilas Cadets team na kumuha ng gold medal sa Southeast Asian Games noong 2011, 2013, 2015 at 2017 sa kampanya ng NLEX.\n\n“Our style is to find the open guys with ball movement so he’s exactly what we’re looking for,” dagdag pa nito. (RC)","Ben Mbala moves on from De La Salle University and the UAAP to pursue the next stage of his career\n\nMANILA, Philippines (UPDATED) – De La Salle University (DLSU) Green Archer Ben Mbala announced on Friday, December 22, that he will not be back in UAAP Season 81 with the Green Archers.\n\nIn a tweet Friday morning, the back-to-back UAAP Most Valuable Player said he will be \"moving on from De La Salle University and the Green Archers.\"\n\n\"After five years, two incredible UAAP Seasons, numerous off season tournaments and of course, countless unforgettable memories, it is with a heavy heart that I announce that the time has come for me to move on from De La Salle University and the Green Archers,\" tweeted Mbala.\n\nIn an Instagram post by Mexican professional basketball club Fuerza Regia, Mbala is reported to be suiting up for the club that competes in the Liga Nacional de Baloncesto Profesional – the top pro league of Mexico.\n\n\n\nMbala underwent 3 years of residency and made his UAAP debut in Season 79, where he helped lead the Green Archers to a championship while clinching the Mythical 5 and Most Valuable Player honors.\n\nIn Season 80, Mbala missed out on his first two games with the Green Archers, as he donned the colors of Cameroon in the 2017 FIBA Afrobasket tournament. However, the DLSU big man still managed to top the league's numbers with 96.5833 statistical points, meriting him the Most Valuable Player award once again.\n\nMbala and the Green Archers ended their campaign for a title defense with a loss to the Ateneo Blue Eagles in the finals game 3 of Season 80, but the two-time UAAP MVP was still expected to return in Season 81 to finish his last year of eligibility.\n\nMbala ended his note with gratitude to all his supporters during his time in DLSU and reassured the public that his exit from the UAAP would be the \"best for the next stage in his career and development.\"\n\n\"I know my choice might come as a surprise to many, and I have to admit, the decision to leave was ","The Magnolia Hotshots' Marc Pingris is uncertain whether he'll be able to make an appearance after his kidney stone removal surgery\n\nMANILA, Philippines – Marc Pingris is coming off kidney stone removal surgery and is uncertain to see action in the PBA's Christmas Clasico on Monday, December 25. But if he would have it his way, of course, he would want to play.\n\n\"The Pinoy Sakuragi\" had just been discharged from the hospital last week. He admitted the operation has taken him \"back to zero,\" casting a shadow on his chances of providing the inside presence the Magnolia Hotshots will need against Barangay Ginebra.\n\n\"I'm not sure pa. 50-50. Kasi kailangan kong magpakundisyon pa (I still need to condition my body),\" said Pingris.\n\nThe Hotshots missed the services of Pingris and Rafi Reavis in their season opener against the Alaska Aces but thanks to a rejuvenated Paul Lee, who is recovering from a knee injury, they went home with a 108-95 triumph.\n\nHowever, against Ginebra, which will be featuring a gigantic frontcourt of Greg Slaughter and Japeth Aguilar, Magnolia could use all the help it can get inside, and that includes Pingris.\n\n\"Kung ako lang, oo naman (gusto ko maglaro sa Clasico). Kilala 'nyo naman ako eh. Kahit ano'ng mangyari. Hindi ko alam. Bahala na kung may masakit, tapalan na lang siguro. Masarap maglaro eh,\" the veteran forward said.\n\nThe NLEX Road Warriors will face the GlobalPort Batang Pier at 3 pm before Magnolia clashes against Ginebra at 5:15 pm at the Philippine Arena in Bocaue, Bulacan. – .com","MANILA, Philippines – Mona Sulaiman, one of the country’s athletic greats, has passed away.\n\nSulaiman died Thursday night at a quiet, dimly lit room of the East Avenue Medical Center in Quezon City, leaving a legacy of triumphs and Asian sprint supremacy that was cut short by unfair questions about her sexuality.\n\nBefore the likes of Lydia de Vega and Elma Muros-Posadas came, Sulaiman was once the country’s brightest star having snared three gold medals in the 100m, 200m and relay and a bronze in shot put in the 1962 Jakarta Asian Games while representing the country in the 1960 Rome and 1964 Tokyo Olympics, where she made the quarterfinals of the 100m.\n\nShe was inducted into the Philippine Sports Hall of Fame last year.\n\nSulaiman came from a humble beginning in Cotabato and even competed barefoot in local and regional meets.\n\nAnd then questions about her gender came.\n\nWhile she was overly qualified to compete in the 1966 Asiad, she ended up deciding to opt out in joining the national team seeing action in the 1966 Asian Games in Bangkok, Thailand when questions about her sexuality were raised.\n\nIt abruptly cut short what would have been a promising career as Sulaiman decided to go into the private sector and, in the 90s, accepted a consultancy job with the national track team upon the recommendation of Muros-Posadas.\n\nThere was no denying though she served the country well.\n\nTwo days before she passed away, Sulaiman was said to have been wanting to personally thank people who came to help her along the way like Muros-Posadas, Philippines Sports Commission chairman William “Butch” Ramirez and former athletics chief Go Teng Kok.\n\nShe didn’t get the chance.\n\n“Two days before Mona (Sulaiman) died, her niece (Mary Jane Neri) texted me and told me she’s looking for people who helped her along the way including Elma,” said national team coach Jojo Posadas, husband of Elma Muros-Posadas, in Filipino.\n\n“But Elma was out-of-town with the Philippine Sports Institute people an","RICO Navarro, the athletic director of Sacred Heart School-Ateneo de Cebu mentioned a troubling development regarding the Cviraa next year. He said, DepEd Region 7 released a memo requiring coaches to attend a seminar--at P3,500 a pop--before they could be allowed to coach in the regional meet.\n\nThat’s troubling because, according to Rico, the seminar could be the perfect way for some teachers to get the spots of the coaches who won their way to the Cviraa.\n\nI also asked my friend Francis Ramirez, the sports coordinator of DepEd Cebu City and he said the seminar is one way to weed out fly-by-night coaches, which is also a good purpose.\n\nBut one thing that concerns me, is making the seminar a requisite for coaches to participate in the Cviraa. Isn’t winning the City or Provincial meet enough? Shouldn’t that be the requisite?\n\nAnd who will be conducting the seminar? Coaches in Cebu who lost to the coaches who will be participating in the Cviraa? Experts from the national team?\n\nAnd at P3,500 per head, the five-day seminar, which will be held during the Christmas break, is very expensive. How many officials are there in Region 7? 1,000? That’s P3.5 million for a seminar.\n\nThat is quite expensive.\n\nI also saw the modules and while coaching ethics and legal responsibilities are useful topics, I don’t think that at the Cviraa level, these coaches need a course on the basic rules, interpretation of the rules and basic training.\n\nThese coaches won’t be at the Cviraa if they don’t know the basics.\n\nSo again, I hope DepEd reconsiders its stance on the seminar. It’s pretty late in the day to call it off, but I hope the officials won’t make it a requisite for the Cviraa.\n\nCoaches also have personal lives you know and I’m sure a lot of them made plans for the Christmas break, only to have it ruined because they have to attend a course on topics they are already experts on.\n\nLet those teachers who want to be coaches but have no knowledge on the basics join this seminar but don’t ","OAKLAND, Calif. — Steve Kerr had been waiting to see rookie Jordan Bell play significant minutes alongside Kevin Durant and Draymond Green.\n\nWith Green back to full strength, Bell got to shine — and the Golden State Warriors needed every little thing he provided on both ends.\n\nNow Kerr just wants to add a healthy Stephen Curry back to the mix and give that lineup a nice long look.\n\nDurant had 33 points, seven rebounds, seven assists and four blocks, and the Warriors held off the Los Angeles Lakers 113-106 on Friday night (Saturday in Manila) for their 11th straight victory.\n\nBell recorded his first career double-double with season bests of 20 points and 10 rebounds, making a key layup with 2:45 to go and dunking a minute later.\n\n“They’re the main guys on this team so the fact he wants to see me play with them more is a good sign for me in the future,” Bell said of Kerr, who loves the rookie’s instincts and wants him to keep learning at this level.\n\nKlay Thompson scored 16 points and Green added 13 points, 11 rebounds and seven assists as he came back from a shoulder injury for the defending champs.\n\nKyle Kuzma scored 27 points and fellow rookie Lonzo Ball had 24 points with five 3-pointers in his first visit to Oracle Arena. Julius Randle added 21 points off the bench for Los Angeles, which snapped the Rockets’ 14-game winning streak Wednesday night in Houston.\n\nDurant shot 9 for 20 in the Warriors’ 10th win in a row at home against the Lakers and sixth overall after Golden State outlasted the Lakers in overtime Monday night in Los Angeles.\n\nKerr and Lakers coach and former top Golden State assistant Luke Walton had a nice chat near the Warriors bench after the final buzzer.\n\nStill without two-time MVP Curry, Golden State got some much-needed reinforcements.\n\nGreen returned after missing five of six games with soreness in his right shoulder, while Andre Iguodala also was back after sitting out Wednesday night’s win against Memphis with flu-like symptoms.\n\n“That was ","BEN MBALA, one of the most dominant players in the collegiate leagues, won’t be back next year to help De La Salle regain the University Athletic Association of the Philippines (UAAP) men’s basketball crown.\n\nThe 6-foot-8 Mbala announced on Twitter late last week his decision to forego his final season in a Green Archer uniform.\n\n“After five years, two incredible UAAP seasons, numerous off-season tournaments and, of course, countless unforgettable memories, it is with a heavy heart to announce  that the time has come for me to move on from De La Salle University and the Green Archers,” the two-time UAAP Most Valuable Player said.\n\nMbala’s decision shocked De La Salle, which lost the Season 80 crown to Ateneo de Manila in three games last month. He averaged 23.3 points, 14.5 rebounds and 2.5 blocks in two dominant seasons.\n\nHe did not confirm his reason to forego his last year of eligibility but he is headed to Central America to play for Fuerza Regia de Monterrey in the Mexican professional league, Liga Nacional de Baloncesto Profesional.\n\n“I know my choice might come as a surprise to many and I admit the decision to leave was toughest I have had to make after being with La Salle for so many years,” he said. “But I feel that this decision is best for the next stage in my career and development.”\n\nThe Cameroonian national team star said he was grateful for his memorable experience in the Philippines and thanked De La Salle Head Coach Aldin Ayo and the coaching staff, his managers and bosses and the La Salle community for “the incredulous opportunity.”\n\n“You all have made my time in the Philippines worthwhile,” said Mbala, who steered La Salle to the Season 79 championship in his first season in the league.\n\nMbala first played for South Western University before he was recruited by De La Salle and spent three years to complete his residency.\n\n“I am truly grateful for having had the opportunity to represent the Green Archers and will always be La Sallian at heart,” Mba","THE cash-rich Pyroworks Christmas Chess Tournament kicks off today at the Robinsons Galleria Cebu. More than P50,000 worth of cash prizes await the winning wood pushers in the one-day tournament that features some of Cebu’s best wood pushers. Among the noted participants are Grand Master (GM) Enrico Sevillamo, International Masters (IM) Rico Mascariñas and Kim Steven Yap. Aside from the three, also competing are Rommel and Ronald Ganzon, Anthony Makinano and Merben Roque. The tournament will use a nine-round Swiss system rapid format with 15 minutes playing time and 10-second increment per round. The champion of the tournament will bag P20,000 while the second placer will get P10,000. The third to fifth placers will each get P7,000, P5,000 and P4,000, respectively. The top three Cebu Executives and Professionals Chess Association (Cepca) wood pushers will also receive cash prizes as well as the top three ladies and top three kiddie participants aged 14 and below. Registration fee is pegged at P300 while the ladies, kiddies, senior citizens and Cepca members registration fee is pegged at P200. For more information about the tournament, one can contact arbiter Marvin Ruelan at 0932-715-2411.","Mark Anthony Barriga boxes his way to a unanimous decision win while AJ Banal shakes off some ring rust after two years out of the ring\n\nMANILA, Philippines – Mark Anthony Barriga brought his hit-and-don't-be-hit show back to Metro Manila, outboxing Glenne Calacar for his eighth win as a pro and winning a unanimous decision, Saturday, December 16, at Makati Cinema Square Arena.\n\nBarriga (8-0, 1 knockout) earned marks of 97-92 on two cards and 98-91 on the third, with a 10-8 round for a knockdown scored on a quick counterpunch in the fourth. Despite his dominance against Calacar (3-2-6, 1 KO), a former amateur teammate of Barriga's from Davao del Sur, Barriga was content to potshot and move after a punishing first round, never pushing his advantage or pursuing a knockout.\n\nWhat Barriga did show was that he'd been studying the moves of Vasyl Lomachenko, stepping behind his opponent when he tried to hold, and landing cleanly with his back hand as a lead ala Floyd Mayweather.\n\n\"He's a good boxer, sometimes you have a fighter or opponent, he knows what is your style, he studies you,\" said Barriga, 24, of his opponent. \"Sometimes he checked my style, that's why sometimes it's so hard to get him.\"\n\nMP Promotions matchmaker Sean Gibbons, who was in town to announce the next title defense for IBF junior bantamweight champ Jerwin Ancajas earlier in the day, said he sees the case to fast-track Barriga into the world title picture due to his extensive amateur background and experience as a 2012 Olympian.\n\n\"I could see him absolutely fighting early next year for an IBF eliminator or WBO, and then potentially a world title by the end of the year,\" said Gibbons. Barriga is ranked number 5 by the IBF at 105 pounds, where the champion is Hiroto Kyoguchi of Japan, while Japan's Ryuya Yamanaka holds the title with the WBO, where Barriga is ranked number 6.\n\nThe fight was Barriga's fifth of 2017, and first since he outclassed two-time world title challenger Samartlek Kokietgym in Beiji","MANILA, Philippines — De La Salle University's Abu Tratter's boo-boo of a dunk in the Archers’ recent UAAP game against UST did not get them a point, but it caught the attention of some interesting people.\n\nTratter failed to complete a fast break from a steal when he missed a 360 dunk by a foot.\n\nThe hilarious move was picked up by producer Mike Goldfarb, creator of the infamous \"Shaqtin' a Fool.\"\n\n\"Shaqtin' a Fool\" is a weekly segment of the show Inside the NBA that highlights humorous, unusual and sometimes cringe-worthy basketball plays.\n\nTratter and the Green Archers still had the last laugh as they destroyed the Growling Tigers, 94-59."]
