[
  {
    "authors": [],
    "publish_date": "11/16/2017",
    "source": {
      "about_us_url": "http://cnnphilippines.com/aboutus/",
      "alexa_description": "",
      "alexa_rank": 38921,
      "alexa_title": "cnnphilippines.com/",
      "brand": "cnnphilippines",
      "category_abs_path": "",
      "category_title": "",
      "contact_us_url": "http://cnnphilippines.com/aboutus/contactus/",
      "contributing_subdomains": [
        {
          "page_views_pct": 100.0,
          "page_views_per_usr": 1.5,
          "reach_pct": 100.0,
          "url": "cnnphilippines.com"
        }
      ],
      "date_created": "00/00/0000",
      "description": "",
      "domain": "cnnphilippines.com",
      "links_in_count": 1790,
      "owned_domains": [],
      "ranks_by_country": [
        {
          "country_code": "IN",
          "page_views_pct": 1.7,
          "rank": 82225,
          "users_pct": 1.4
        },
        {
          "country_code": "SG",
          "page_views_pct": 1.2,
          "rank": 11470,
          "users_pct": 1.6
        },
        {
          "country_code": "MY",
          "page_views_pct": 0.6,
          "rank": 23915,
          "users_pct": 0.6
        },
        {
          "country_code": "PH",
          "page_views_pct": 52.0,
          "rank": 334,
          "users_pct": 56.1
        },
        {
          "country_code": "US",
          "page_views_pct": 10.5,
          "rank": 50355,
          "users_pct": 10.2
        },
        {
          "country_code": "HK",
          "page_views_pct": 7.5,
          "rank": 6051,
          "users_pct": 2.4
        },
        {
          "country_code": "AU",
          "page_views_pct": 0.8,
          "rank": 46061,
          "users_pct": 0.8
        },
        {
          "country_code": "SA",
          "page_views_pct": 5.1,
          "rank": 4687,
          "users_pct": 5.6
        },
        {
          "country_code": "NO",
          "page_views_pct": 1.2,
          "rank": 14909,
          "users_pct": 0.8
        },
        {
          "country_code": "AE",
          "page_views_pct": 2.5,
          "rank": 4621,
          "users_pct": 2.5
        },
        {
          "country_code": "FR",
          "page_views_pct": 0.5,
          "rank": 124555,
          "users_pct": 0.7
        },
        {
          "country_code": "OM",
          "page_views_pct": 1.2,
          "rank": 3682,
          "users_pct": 1.0
        },
        {
          "country_code": "QA",
          "page_views_pct": 4.1,
          "rank": 3212,
          "users_pct": 3.2
        },
        {
          "country_code": "CA",
          "page_views_pct": 1.7,
          "rank": 35112,
          "users_pct": 1.5
        },
        {
          "country_code": "JP",
          "page_views_pct": 2.7,
          "rank": 51905,
          "users_pct": 4.1
        },
        {
          "country_code": "O",
          "page_views_pct": 6.7,
          "rank": 0,
          "users_pct": 7.5
        }
      ],
      "related_links": [],
      "spd_median_load_time": 3676,
      "spd_percentile": 15
    },
    "text": "Metro Manila (CNN Philippines, November 15)  A reference to a landmark ruling favoring the Philippines' claims in the South China Sea may be implied, in the ASEAN Chairman's statement, but it still falls short of any significant action in resolving the dispute, an analyst said Thursday.\"No one is being 'urged' to do anything, and there is no language with any sense of urgency or emphasis,\" maritime expert Jay Batongbacal told CNN Philippines.The ASEAN Chairman's statement released Thursday \"stressed the need to adhere to the peaceful resolution of disputes, in accordance with universally recognized principles of international law and the 1982 United Nations Convention on the Law of the Sea (UNCLOS).\"\"[We] further reaffirmed the need to enhance mutual trust and confidence, emphasized the importance of non-militarization and self-restraint in the conduct of all activities by claimants and all other states,\" the statement read.Related: 31st ASEAN Chairman's statement references international law in South China SeaBatongbacal however said, that the mention in the Chairman's statement of resolving disputes according to \"universally recognized principles of international law\" and the UNCLOS provided \"closure\" to ASEAN's pussyfooting around China on the maritime dispute.\"Compared with previous ASEAN statements overall, the current paragraphs provide a soft closure to ASEAN's handling of the South China Sea disputes,\" said the University of the Philippines professor.The ASEAN and China announced on Monday the negotiations for a code of conduct in South China Sea, which the Chairman's statement acknowledged. It also welcomed the testing of cross-country hotlines on maritime emergencies, and \"looked forward to the operationalization of the Joint Statement on the Observance of the Code for Unplanned Encounters at Sea.\"Batongbacal said the Chairman's Statement, overall, was \"good for China.\"\"They project the South China Sea situation in a positive light, something like, 'There's nothing more to see here folks, it's back to business as usual,'\" said Batongbacal. \"It means South China Sea is no longer a problem and (it) gives no reason for external powers to be involved.\"But this does not necessarily mean the existing situation has improved or will turn in favor of the other smaller claimants. Although the Chairman's statement is from one of the major claimants, the Philippines, a mention of international law does not necessarily entail the country is taking a stronger stance against China.\"China's artificial structures are still there... Our movement becomes more and more constricted,\" he said in an earlier interview on Wednesday. \"China's [naval] forces still have free rein all over South China Sea and are even patrolling inside the West Philippine Sea,\" he added.President Rodrigo Duterte, who was ASEAN Chairman this year, has developed warmer relations with China. Following the eastern giant's refusal to acknowledge the arbitral tribunal ruling, the decision was not mentioned in talks with China.The reference to international law was removed from the 30th ASEAN Chairman's statement at the pressure of Beijing, sources told CNN Philippines.A November 11 draft of the Chairman's statement showed the Chair had yet to provide the regional bloc's official stance. Batongbacal told CNN Philippines on Monday that this missing section could mean the Philippines was \"placing the burden other countries to take the lead.\"\"This could possibly be due to China's displeasure with [the] last statement, which [Duterte] had to explain as being nothing more of his duty of relaying other ASEAN members' concerns,\" he said.Batongbacal was referring to the 50th ASEAN Foreign Ministers' Joint Communique in August, which was the first document from the regional bloc that acknowledged the importance of international law, raised concern on land reclamation, and emphasized non-militarization in the South China Sea. China continues to create islands and build structures in the disputed waters, blatantly ignoring the ruling of the International Arbitral Tribunal in July 2016.Foreign Affairs Secretary Alan Peter Cayetano back then told the press that the Philippines did not want to include these passages in the Joint Communique, but he gave in to other ministers.Apart from China and the Philippines, other claimants of the disputed islands are ASEAN member states Brunei, Malaysia, and Vietnam, as well as northern neighbor Taiwan.CNN Philippines digital producer Chad de Guzman contributed to this story.",
    "title": "Analyst: ASEAN Chairman's statement 'plays safe' on South China Sea issue",
    "top_image": "http://cnnphilippines.com/incoming/er8pbw-ASEAN-South-China-Sea_CNNPH.jpg/ALTERNATES/LANDSCAPE_640/ASEAN-South-China-Sea_CNNPH.jpg",
    "url": "http://cnnphilippines.com/news/2017/11/16/ASEAN-chair-statement-plays-safe-South-China-Sea-analyst.html"
  },
  {
    "authors": [],
    "publish_date": "06/20/2017",
    "source": {
      "about_us_url": "http://cnnphilippines.com/aboutus/",
      "alexa_description": "",
      "alexa_rank": 38921,
      "alexa_title": "cnnphilippines.com/",
      "brand": "cnnphilippines",
      "category_abs_path": "",
      "category_title": "",
      "contact_us_url": "http://cnnphilippines.com/aboutus/contactus/",
      "contributing_subdomains": [
        {
          "page_views_pct": 100.0,
          "page_views_per_usr": 1.5,
          "reach_pct": 100.0,
          "url": "cnnphilippines.com"
        }
      ],
      "date_created": "00/00/0000",
      "description": "",
      "domain": "cnnphilippines.com",
      "links_in_count": 1790,
      "owned_domains": [],
      "ranks_by_country": [
        {
          "country_code": "IN",
          "page_views_pct": 1.7,
          "rank": 82225,
          "users_pct": 1.4
        },
        {
          "country_code": "SG",
          "page_views_pct": 1.2,
          "rank": 11470,
          "users_pct": 1.6
        },
        {
          "country_code": "MY",
          "page_views_pct": 0.6,
          "rank": 23915,
          "users_pct": 0.6
        },
        {
          "country_code": "PH",
          "page_views_pct": 52.0,
          "rank": 334,
          "users_pct": 56.1
        },
        {
          "country_code": "US",
          "page_views_pct": 10.5,
          "rank": 50355,
          "users_pct": 10.2
        },
        {
          "country_code": "HK",
          "page_views_pct": 7.5,
          "rank": 6051,
          "users_pct": 2.4
        },
        {
          "country_code": "AU",
          "page_views_pct": 0.8,
          "rank": 46061,
          "users_pct": 0.8
        },
        {
          "country_code": "SA",
          "page_views_pct": 5.1,
          "rank": 4687,
          "users_pct": 5.6
        },
        {
          "country_code": "NO",
          "page_views_pct": 1.2,
          "rank": 14909,
          "users_pct": 0.8
        },
        {
          "country_code": "AE",
          "page_views_pct": 2.5,
          "rank": 4621,
          "users_pct": 2.5
        },
        {
          "country_code": "FR",
          "page_views_pct": 0.5,
          "rank": 124555,
          "users_pct": 0.7
        },
        {
          "country_code": "OM",
          "page_views_pct": 1.2,
          "rank": 3682,
          "users_pct": 1.0
        },
        {
          "country_code": "QA",
          "page_views_pct": 4.1,
          "rank": 3212,
          "users_pct": 3.2
        },
        {
          "country_code": "CA",
          "page_views_pct": 1.7,
          "rank": 35112,
          "users_pct": 1.5
        },
        {
          "country_code": "JP",
          "page_views_pct": 2.7,
          "rank": 51905,
          "users_pct": 4.1
        },
        {
          "country_code": "O",
          "page_views_pct": 6.7,
          "rank": 0,
          "users_pct": 7.5
        }
      ],
      "related_links": [],
      "spd_median_load_time": 3676,
      "spd_percentile": 15
    },
    "text": "Metro Manila (CNN Philippines, June 20)  You can do more to help meet the needs of those affected by the crisis in Marawi city.Various organizations have called for donations, either in cash or in kind, to help thousands of internally displaced persons (IDPs) who evacuated from the war-torn city.The clash in Marawi has been going on for a month now.Related: Marawi crisis hits 300 death toll markAlthough different organizations address different needs of Marawi evacuees, all of them remind the public to be culturally sensitive since most of the residents are Muslim.Food donations should be halal, meaning meals should be prepared in a way permissible to Islam culture. Any kind of pork is forbidden.Muslim women, in addition, are required to wear fully-covered clothes.Here are some government and private entities accepting donations for those affected by the Marawi crisis:Philippine Red CrossIn this dark hour, let us be the light for our fellow countrymen. Visit https://t.co/JbxHJQs98t to know how can you #HelpMarawi. pic.twitter.com/QwaiJ8ieHl  Philippine Red Cross (@philredcross) July 8, 2017Bank deposits can be made at the following accounts:Peso Savings Account:Banco de Oro: Savings Account No. 00453-0018647Philippine National Bank: Savings Account No. 3752-8350-0034Metrobank: Savings Account No. 151-3-04163122-8Bank of the Philippine Island: Savings Account No. 4991-0036-52Unionbank: Savings Account No. 1015-400-002-01Dollar Savings Account:Banco de Oro: Savings Account No.10-453-0039482 Swift Code BNOR PH MMPhilippine National Bank: Savings Account No. 3752-8350-0034 Swift Code: PNB MPH MMMetrobank: Savings Account No. 151-2-15100218-2 Swift Code MBTC PH MMBank of the Philippine Island: Savings Account No. 4994-0103-15 Swift Code BOPI PH MMUnionbank: Savings Account No. 1315-400-000-90 Swift Code UB MPH MMMenawhile, you may also send donations in kind to Philippine Red Cross  National Headquarters in Manila or drop them off at LBC Branches nationwide.Donations of food, bottled water, canned goods, rice and noodles, as well as non-food donations like hygiene kits, jerry cans and blankets are most welcome.Philippine Red Cross Events and Emergency-Giving Officer Shervi Corpuz told CNN Philippines that all perishable donations should be at least six months away from expiring. She added that food donations should be \"halal,\" which means the food preparation is permissible for Muslims.For other ways to donate, visit the Philippine Red Cross' website here.Armed Forces of the Philippines (AFP)AFP Spokesperson Restituto Padilla said recovering soldiers would appreciate visits from the public.Read: AFP to public: Visit wounded soldiers in hospitalsHe also encouraged the public to donate in cash to help wounded soldiers and the families of the fallen troops.For cash donations, the AFP has opened Land Bank accounts for Marawi City evacuees and for the families of soldiers killed-in-action:For the families of soldiers killed-in-action:Account Name: AFP Marawi CasualtyAccount Number: 00000552107128For the evacuees from Marawi City:Account Name: Marawi IDPAccount Number: 00000552107136Caritas ManilaCaritas Manila, the social arm of the Archdiocese of Manila, is accepting cash and in-kind donations, which can be dropped off at their office in 2002 Jesus St., Pandacan, Manila.Bank deposits can be made at the following accounts:Peso accounts:Banco De Oro - Savings Account No.: 5600-45905Bank of the Philippine Islands - Savings Account No.: 3063-5357-01Metrobank - Savings Account No.: 175-3-17506954-3Dollar accounts:Bank of the Philippine Islands - Savings Account No. 3064-0033-55 Swift Code - BOPIPHMMPhilippine National Bank - Savings Account No. 10-856-660002-5 Swift Code - PNBMPHMMFor online deposits, click here.NVC Foundation, Inc.Cash donations to nonprofit organization Negrense Volunteers for Change (NVC) Foundation, Inc. will fund its feeding program initiatives.NVC manufactures Mingo, an instant food made of rice, mongo, and malunggay.Deposits can be made through the following accounts:BPI:Account name: Negrense Volunteers for Change Foundation Inc.Peso Account: 1320011147Swift Code: BOPIPHMMMetrobank:Peso Current Account: 5467546007398Dollar Savings Account: 5462546008937Swift Code: MBTCPHMMFor online donations, click here.Save the ChildrenIndependent organization Save the Children is accepting cash donations, which will be used to support the educational needs of children.In addition, it is also allocating funds to deal with the mental and psychosocial needs of children.For donations, click here.Teach Peace Build Peace Movement (TPBPM)Peacebuilding group Teach Peace Build Peace Movement welcomes school supplies and art materials to address possible trauma caused by the war to children.The usual relief goods  food, hygiene kits, clothes  are also welcome.In-kind donations can be dropped off at #55 Esteban Abada St., Brgy. Loyola Heights. Quezon City.Cash donations can be deposited at the following accounts:Account Name: TEACH PEACE BUILD PEACE MOVEMENT INC.Account Number: 000040837270Bank Branch: BDO-SM MakatiSwift Code: BNORPHMMFor easier coordination, contact TPBPM Secretariat head Bernadette Fernandez at 0915-8480230.Read: Peacebuilding group readies help for kids traumatized by Marawi crisisWorld VisionHumanitarian organization World Vision is accepting cash donations, which will be used to provide hygiene kits and non-food items, as well as fund learner kits and temporary learning spaces for Marawi children.To donate, click here.This post will be updated.",
    "title": "Do more than #PrayforMarawi: Where to donate",
    "top_image": "http://cnnphilippines.com/incoming/p8du5p-Marawi-Donations_CNNPH.jpg/ALTERNATES/LANDSCAPE_640/Marawi-Donations_CNNPH.jpg",
    "url": "http://cnnphilippines.com/news/2017/06/20/pray-for-marawi-donate.html"
  },
  {
    "authors": [],
    "publish_date": "11/16/2017",
    "source": {
      "about_us_url": "http://cnnphilippines.com/aboutus/",
      "alexa_description": "",
      "alexa_rank": 38921,
      "alexa_title": "cnnphilippines.com/",
      "brand": "cnnphilippines",
      "category_abs_path": "",
      "category_title": "",
      "contact_us_url": "http://cnnphilippines.com/aboutus/contactus/",
      "contributing_subdomains": [
        {
          "page_views_pct": 100.0,
          "page_views_per_usr": 1.5,
          "reach_pct": 100.0,
          "url": "cnnphilippines.com"
        }
      ],
      "date_created": "00/00/0000",
      "description": "",
      "domain": "cnnphilippines.com",
      "links_in_count": 1790,
      "owned_domains": [],
      "ranks_by_country": [
        {
          "country_code": "IN",
          "page_views_pct": 1.7,
          "rank": 82225,
          "users_pct": 1.4
        },
        {
          "country_code": "SG",
          "page_views_pct": 1.2,
          "rank": 11470,
          "users_pct": 1.6
        },
        {
          "country_code": "MY",
          "page_views_pct": 0.6,
          "rank": 23915,
          "users_pct": 0.6
        },
        {
          "country_code": "PH",
          "page_views_pct": 52.0,
          "rank": 334,
          "users_pct": 56.1
        },
        {
          "country_code": "US",
          "page_views_pct": 10.5,
          "rank": 50355,
          "users_pct": 10.2
        },
        {
          "country_code": "HK",
          "page_views_pct": 7.5,
          "rank": 6051,
          "users_pct": 2.4
        },
        {
          "country_code": "AU",
          "page_views_pct": 0.8,
          "rank": 46061,
          "users_pct": 0.8
        },
        {
          "country_code": "SA",
          "page_views_pct": 5.1,
          "rank": 4687,
          "users_pct": 5.6
        },
        {
          "country_code": "NO",
          "page_views_pct": 1.2,
          "rank": 14909,
          "users_pct": 0.8
        },
        {
          "country_code": "AE",
          "page_views_pct": 2.5,
          "rank": 4621,
          "users_pct": 2.5
        },
        {
          "country_code": "FR",
          "page_views_pct": 0.5,
          "rank": 124555,
          "users_pct": 0.7
        },
        {
          "country_code": "OM",
          "page_views_pct": 1.2,
          "rank": 3682,
          "users_pct": 1.0
        },
        {
          "country_code": "QA",
          "page_views_pct": 4.1,
          "rank": 3212,
          "users_pct": 3.2
        },
        {
          "country_code": "CA",
          "page_views_pct": 1.7,
          "rank": 35112,
          "users_pct": 1.5
        },
        {
          "country_code": "JP",
          "page_views_pct": 2.7,
          "rank": 51905,
          "users_pct": 4.1
        },
        {
          "country_code": "O",
          "page_views_pct": 6.7,
          "rank": 0,
          "users_pct": 7.5
        }
      ],
      "related_links": [],
      "spd_median_load_time": 3676,
      "spd_percentile": 15
    },
    "text": "Metro Manila (CNN Philippines, November 16)  The Philippines, as chair of the 31st ASEAN Summit brought back a provision into the final Chairman's Statement that implied a reference to a landmark ruling recognizing the Philippines' claims over the South China Sea.The ASEAN Chairman's statement released Thursday \"stressed the need to adhere to the peaceful resolution of disputes, in accordance with universally recognized principles of international law and the 1982 United Nations Convention on the Law of the Sea (UNCLOS).\"\"[We] further reaffirmed the need to enhance mutual trust and confidence, emphasized the importance of non-militarization and self-restraint in the conduct of all activities by claimants and all other states,\" the statement read.This was a departure from the 30th ASEAN Chairman's statement in April, which skipped the passage acknowledging international law altogether. There was also no mention of militarization or land reclamation in the earlier statement.The 31st Chairman's Statement comes after leaders of the Association of South East Asian Nations (ASEAN) and China announced on Monday the beginning of negotiations for a Code of Conduct in the South China Sea.The Chairman's Statement also \"looked forward to the announcement of substantive negotiations on the [code of conduct].\" It welcomed the testing of cross-country hotlines on maritime emergencies, and \"looked forward to the operationalization of the Joint Statement on the Observance of the Code for Unplanned Encounters at Sea,\" it added.Sources told CNN Philippines that the 30th ASEAN Chairman's Statement in April did not include the reference to international law, following pressure from Beijing.As the 31st ASEAN Summit approached, ASEAN foreign ministers in their Joint Communique in August acknowledged international law, raised concern on land reclamation, and emphasized non-militarization.However, Foreign Affairs Secretary Alan Peter Cayetano told the press that the Philippines did not want to include these passages in the Joint Communique, but he gave in to other ministers.Apart from China and the Philippines, other claimants of the disputed islands are ASEAN member states Brunei, Malaysia, and Vietnam as well as northern neighbor Taiwan.A statement from the summit between ASEAN and China on Monday likewise \"agreed to cooperate in maintaining peace, security, stability, safety and freedom of navigation in and over-flight above the SCS, in accordance with international law, including the 1982 UNCLOS.\"",
    "title": "31st ASEAN Chairman's statement references international law in South China Sea",
    "top_image": "http://cnnphilippines.com/incoming/j1f12p-asean-us-001_CNNPH.jpg/ALTERNATES/LANDSCAPE_640/asean-us-001_CNNPH.jpg",
    "url": "http://cnnphilippines.com/incoming/2017/11/16/31st-ASEAN-chairman-statement-references-international-law-South-China-Sea.html"
  },
  {
    "authors": [],
    "publish_date": "11/16/2017",
    "source": {
      "about_us_url": "http://cnnphilippines.com/aboutus/",
      "alexa_description": "",
      "alexa_rank": 38921,
      "alexa_title": "cnnphilippines.com/",
      "brand": "cnnphilippines",
      "category_abs_path": "",
      "category_title": "",
      "contact_us_url": "http://cnnphilippines.com/aboutus/contactus/",
      "contributing_subdomains": [
        {
          "page_views_pct": 100.0,
          "page_views_per_usr": 1.5,
          "reach_pct": 100.0,
          "url": "cnnphilippines.com"
        }
      ],
      "date_created": "00/00/0000",
      "description": "",
      "domain": "cnnphilippines.com",
      "links_in_count": 1790,
      "owned_domains": [],
      "ranks_by_country": [
        {
          "country_code": "IN",
          "page_views_pct": 1.7,
          "rank": 82225,
          "users_pct": 1.4
        },
        {
          "country_code": "SG",
          "page_views_pct": 1.2,
          "rank": 11470,
          "users_pct": 1.6
        },
        {
          "country_code": "MY",
          "page_views_pct": 0.6,
          "rank": 23915,
          "users_pct": 0.6
        },
        {
          "country_code": "PH",
          "page_views_pct": 52.0,
          "rank": 334,
          "users_pct": 56.1
        },
        {
          "country_code": "US",
          "page_views_pct": 10.5,
          "rank": 50355,
          "users_pct": 10.2
        },
        {
          "country_code": "HK",
          "page_views_pct": 7.5,
          "rank": 6051,
          "users_pct": 2.4
        },
        {
          "country_code": "AU",
          "page_views_pct": 0.8,
          "rank": 46061,
          "users_pct": 0.8
        },
        {
          "country_code": "SA",
          "page_views_pct": 5.1,
          "rank": 4687,
          "users_pct": 5.6
        },
        {
          "country_code": "NO",
          "page_views_pct": 1.2,
          "rank": 14909,
          "users_pct": 0.8
        },
        {
          "country_code": "AE",
          "page_views_pct": 2.5,
          "rank": 4621,
          "users_pct": 2.5
        },
        {
          "country_code": "FR",
          "page_views_pct": 0.5,
          "rank": 124555,
          "users_pct": 0.7
        },
        {
          "country_code": "OM",
          "page_views_pct": 1.2,
          "rank": 3682,
          "users_pct": 1.0
        },
        {
          "country_code": "QA",
          "page_views_pct": 4.1,
          "rank": 3212,
          "users_pct": 3.2
        },
        {
          "country_code": "CA",
          "page_views_pct": 1.7,
          "rank": 35112,
          "users_pct": 1.5
        },
        {
          "country_code": "JP",
          "page_views_pct": 2.7,
          "rank": 51905,
          "users_pct": 4.1
        },
        {
          "country_code": "O",
          "page_views_pct": 6.7,
          "rank": 0,
          "users_pct": 7.5
        }
      ],
      "related_links": [],
      "spd_median_load_time": 3676,
      "spd_percentile": 15
    },
    "text": "Metro Manila (CNN Philippines, November 16)  The Health Department (DOH) said Thursday it is now distributing family planning supplies to regional health offices.This comes four days after the Food and Drug Administration (FDA) announced 51 contraceptives are non-abortifacients, thereby lifting a temporary restraining order on these that was issued in 2015 by the Supreme Court.\"There has been a resumption of the essential reproductive health services to Philippine women and their families,\" Health Secretary Francisco Duque said.Duque said they are prioritizing the distribution of around 261,000 implants stocked in DOH warehouses, which are set to expire in September 2018.Population Commission Executive Director Dr. Juan Antonio Perez clarified the expiration is only for the insertion of the implants, and not the product itself.\"Thereafter, anytime after insertion, the implant will be good for three years,\" Perez said.This means roughly 1,000 implants should be inserted every day to avoid wastage, Perez said.The DOH said they are cascading the supplies to civil society organizations, local government units, and rural health stations and clinics, for free distribution to the public.The Population Commission is also confident that the supplies will be used up due the number of people who are interested in getting contraceptives.\"Regularly, 1 million people take on a family planning service as a new acceptor every year. And every year, we also have 6 million already of what we call current users,\" Perez said. \"I think we have a good number of people who may be asking for these implants.\"Health officials also said they will conduct information campaigns alongside the distribution of contraceptives.\"The RPRH Law requires that everything should be done in full information and voluntary basis. So we will be discussing these methods to everyone, the choice of the woman or the man on what method they want to choose,\" Perez added.RPRH refers to the Responsible Parenthood and Reproductive Health law, which was enacted in December 2012 after contentious debates in this largely Catholic country.But a petition filed with the Supreme Court by groups affiliated with the pro-life movement and the Catholic church led to the imposition of a temporary restraining order in 2015, which prohibited the Food and Drug Administration from renewing the certification of contraceptives such as implants Implanon and Implanon NXT, which comprise most of the DOH stock.READ: FDA declares 51 contraceptives as non-abortifacientsThe Philippines ranks as the 13th most populated country all over the world, with an estimated 104.3 million population as of July 1.CNN Philippines' Joyce Ilas contributed to this report.",
    "title": "DOH starts distribution of contraceptives",
    "top_image": "http://cnnphilippines.com/incoming/yljakw-tondo-and-baseco.jpg/ALTERNATES/LANDSCAPE_640/tondo%20and%20baseco.jpg",
    "url": "http://cnnphilippines.com/news/2017/11/16/DOH-distribute-contraceptives.html"
  }
]